ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
/**************************************************************************//**
 * @file     NUC123SD4AN0.h
 * @brief    CMSIS Cortex-M0 Core Peripheral Access Layer Header File for
 *           Device NUC123SD4AN0
 * @version  V5.00
 * @date     13. May 2019
 ******************************************************************************/
/*
 * Copyright (c) 2019 /u/KeepItUnder. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifndef NUC123SD4AN0_H      /* ToDo: replace '<Device>' with your device name */
#define NUC123SD4AN0_H

#ifdef __cplusplus
extern "C" {
#endif

/* ToDo: replace '<Vendor>' with vendor name; add your doxyGen comment   */
/** @addtogroup NUVOTON
  * @{
  */


/* ToDo: replace '<Device>' with device name; add your doxyGen comment   */
/** @addtogroup NUC123SD4AN0
  * @{
  */


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum IRQn {
/* =======================================  ARM Cortex-M0 Specific Interrupt Numbers  ======================================== */

/* ToDo: use this Cortex interrupt numbers if your device is a Cortex-M0 / Cortex-M0+ device */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */

/* ===========================================  <Device> Specific Interrupt Numbers  ========================================= */
/* ToDo: add here your device specific external interrupt numbers
         according the interrupt handlers defined in startup_Device.s
         eg.: Interrupt for Timer#1       TIM1_IRQHandler   ->   TIM1_IRQn */
/**
 * IRQ numbers
 * 
 * See NUC123 Technical Reference Manual 5.2.3, page 32-33
 */
    BOD_OUT_IRQn            = 0,                // Brown-out low voltage detected interrupt
    WDT_IRQn                = 1,                // Watchdog/Window Watchdog Timer interrupt
    EINT0_IRQn              = 2,                // External signal interrupt from PB.14 pin
    EINT1_IRQn              = 3,                // External signal interrupt from PB.15 or PD.11 pin
    GPAB_IRQn               = 4,                // External signal interrupt from PA[15:0]/PB[13:0]
    GPCDF_IRQn              = 5,                // External interrupt from PC[15:0]/PD[15:0]/PF[3:0]
    PWMA_IRQn               = 6,                // PWM0, PWM1, PWM2 and PWM3 interrupt
    // IRQn                    = 7,                // Reserved
    TMR0_IRQn               = 8,                // Timer 0 interrupt
    TMR1_IRQn               = 9,                // Timer 1 interrupt
    TMR2_IRQn               = 10,               // Timer 2 interrupt
    TMR3_IRQn               = 11,               // Timer 3 interrupt
    UART0_IRQn              = 12,               // UART0 interrupt
    UART1_IRQn              = 13,               // UART1 interrupt
    SPI0_IRQn               = 14,               // SPI0 interrupt
    SPI1_IRQn               = 15,               // SPI1 interrupt
    SPI2_IRQn               = 16,               // SPI2 interrupt
    // IRQn                    = 17,               // Reserved
    I2C0_IRQn               = 18,               // I2C0 interrupt
    I2C1_IRQn               = 19,               // I2C1 interrupt
    // IRQn                    = 20,               // Reserved
    // IRQn                    = 21,               // Reserved
    // IRQn                    = 22,               // Reserved
    USBD_IRQn               = 23,               // USB 2.0 FS Device interrupt
    PS2_IRQn                = 24,               // PS/2 interrupt
    // IRQn                    = 25,               // Reserved
    PDMA_IRQn               = 26,               // PDMA interrupt
    I2S_IRQn                = 27,               // I2S interrupt
    PWRWU_IRQn              = 28,               // Clock controller interrupt for chip wake-up from Power-down state
    ADC_IRQn                = 29,               // ADC Interrupt
    // IRQn                    = 30,               // Reserved
    // IRQn                    = 31,               // Reserved
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the Arm Cortex-M4 Processor and Core Peripherals  =========================== */
/* ToDo: set the defines according your Device */
/* ToDo: define the correct core revision
         __CM0_REV if your device is a Cortex-M0 device
         __CM3_REV if your device is a Cortex-M3 device
         __CM4_REV if your device is a Cortex-M4 device
         __CM7_REV if your device is a Cortex-M7 device */
#define __CM0_REV                 0x0201    /*!< Core Revision r2p1 */

