ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
/* ToDo: define the correct core features for the <Device> */
#define __MPU_PRESENT             1         /*!< Set to 1 if MPU is present */
#define __VTOR_PRESENT            0         /*!< Set to 1 if VTOR is present */
#define __NVIC_PRIO_BITS          2         /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT             0         /*!< Set to 1 if FPU is present */
#define __FPU_DP                  0         /*!< Set to 1 if FPU is double precision FPU (default is single precision FPU) */
#define __ICACHE_PRESENT          0         /*!< Set to 1 if I-Cache is present */
#define __DCACHE_PRESENT          0         /*!< Set to 1 if D-Cache is present */
#define __DTCM_PRESENT            0         /*!< Set to 1 if DTCM is present */


/** @} */ /* End of group Configuration_of_CMSIS */


/* ToDo: include the correct core_cm#.h file
         core_cm0.h if your device is a CORTEX-M0 device
         core_cm3.h if your device is a CORTEX-M3 device
         core_cm4.h if your device is a CORTEX-M4 device
         core_cm7.h if your device is a CORTEX-M4 device */
#include <core_cm0.h>                           /*!< Arm Cortex-M# processor and core peripherals */
/* ToDo: include your system_<Device>.h file
         replace '<Device>' with your device name */
#include "system_NUC123SD4AN0.h"                    /*!< <Device> System */


/* ========================================  Start of section using anonymous unions  ======================================== */
#if   defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup NUC123SD4AN0_Peripherals
  * @{
  */

/* ToDo: add here your device specific peripheral access structure typedefs
         following is an example for a timer */

/* =========================================================================================================================== */
/* ================                                            TMR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Timer (TMR)
  */

// typedef struct
// {                                               /*!< (@ 0x40000000) TIM Structure                                              */
//   __IOM uint32_t   TimerLoad;                   /*!< (@ 0x00000004) Timer Load                                                 */
//   __IM  uint32_t   TimerValue;                  /*!< (@ 0x00000008) Timer Counter Current Value                                */
//   __IOM uint32_t   TimerControl;                /*!< (@ 0x0000000C) Timer Control                                              */
//   __OM  uint32_t   TimerIntClr;                 /*!< (@ 0x00000010) Timer Interrupt Clear                                      */
//   __IM  uint32_t   TimerRIS;                    /*!< (@ 0x00000014) Timer Raw Interrupt Status                                 */
//   __IM  uint32_t   TimerMIS;                    /*!< (@ 0x00000018) Timer Masked Interrupt Status                              */
//   __IM  uint32_t   RESERVED[1];
//   __IOM uint32_t   TimerBGLoad;                 /*!< (@ 0x00000020) Background Load Register                                   */
// } <DeviceAbbreviation>_TMR_TypeDef;


/* =========================================================================================================================== */
/* ================                                    Clock Controller                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief Clock Controller (CLK)
  * 
  * @description See NUC123 Technical Reference Manual 5.4.7 Register Map, page 106
  * 
  * CLK_BA = 0x5000_0200
  * 
  * Struct rearranged from table to track actual locations (without having to specify offsets)
  */
typedef struct {

    __IO uint32_t PWRCON;        // CLK_BA+0x00    System Power-down Control Register
    __IO uint32_t AHBCLK;        // CLK_BA+0x04    AHB Devices Clock Enable Control Register
    __IO uint32_t APBCLK;        // CLK_BA+0x08    APB Devices Clock Enable Control Register
    __IO uint32_t CLKSTATUS;     // CLK_BA+0x0C    Clock status monitor Register
    __IO uint32_t CLKSEL0;       // CLK_BA+0x10    Clock Source Select Control Register 0
    __IO uint32_t CLKSEL1;       // CLK_BA+0x14    Clock Source Select Control Register 1
    __IO uint32_t CLKDIV;        // CLK_BA+0x18    Clock Divider Number Register
    __IO uint32_t CLKSEL2;       // CLK_BA+0x1C    Clock Source Select Control Register 2
    __IO uint32_t PLLCON;        // CLK_BA+0x20    PLL Control Register
    __IO uint32_t FRQDIV;        // CLK_BA+0x24    Frequency Divider Control Register
    __I  uint32_t RESERVED0;     // CLK_BA+0x28    Missing from table    
    __IO uint32_t APBDIV;        // CLK_BA+0x2C    APB Divider Control Register

} CLK_T;

/**
  * @brief Clock Controller (CLK) - Register PWRCON
  * 
  * @description Power-down Control Register (PWRCON) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 107-109
  * 
  * PWRCON = CLK_BA+0x00
  * 
  * 
  * XTL12M_EN [0]
  * External 4~24 MHz High Speed Crystal Enable (Write-protection Bit)
  * 
  * The bit default value is set by flash controller user configuration register config0
  * [26:24]. When the default clock source is from external 4~24 MHz high speed crystal,
  * this bit is set to 1 automatically
  * 
  * 1 = External 4~24 MHz high speed crystal Enabled
  * 0 = External 4~24 MHz high speed crystal Disabled
  * 
  * 
  * OSC22M_EN [2]
  * Internal 22.1184 MHz High Speed Oscillator Enable (Write-protection Bit)
  * 
  * 1 = Internal 22.1184 MHz high speed oscillator Enabled.
  * 0 = Internal 22.1184 MHz high speed oscillator Disabled.
  * 
  * 
  * OSC10K_EN [3]
  * Internal 10 kHz Low Speed Oscillator Enable (Write-protection Bit)
  * 
  * 1 = Internal 10 kHz low speed oscillator Enabled.
  * 0 = Internal 10 kHz low speed oscillator Disabled.
  * 
  * 
  * PD_WU_DLY [4]
  * Enable the Wake-up Delay Counter (Write-protection Bit)
  * 
  * When the chip wakes up from Power-down mode, the clock control will delay certain
  * clock cycles to wait system clock stable.
  * The delayed clock cycle is 4096 clock cycles when chip work at external 4~24 MHz
  * high speed crystal, and 256 clock cycles when chip work at internal 22.1184 MHz high
  * speed oscillator.
  * 
  * 1 = Clock cycles delay Enabled.
  * 0 = Clock cycles delay Disabled.
  * 
  * 
  * PD_WU_INT_EN [5]
  * Power-down Mode Wake-up Interrupt Enable (Write-protection Bit)
  * 
  * 0 = Disabled.
  * 1 = Enabled.
  * 
  * The interrupt will only occur when both PD_WU_STS and PD_WU_INT_EN are high.
  * 
  * 
  * PD_WU_STS [6]
  * Power-down Mode Wake-up Interrupt Status
  * 
  * Set by the "Power-down wake-up event", which indicates that resume from Power-down
  * mode has occured.
  * 
  * The flag is set if the GPIO, USB, UART, WDT, CAN, ACMP or BOD wake-up occurred.
  * 
  * Write 1 to clear the bit to zero.
  * 
  * Note: This bit works only when PD_WU_INT_EN (PWRCON[5]) set to 1.
  * 
  * 
  * PWE_DOWN_EN [7]
  * System Power-down Enable Bit (Write-protection Bit)
  * 
  * When this bit is set to 1, the chip Power-down mode is enabled and chip Power-down
  * behavior will depend on the PD_WAIT_CPU bit.
  * (a) If the PD_WAIT_CPU is 0, the chip enters Power-down mode immediately after the
  *     PWR_DOWN_EN bit set.
  * (b) If the PD_WAIT_CPU is 1, the chip keeps active till the CPU sleep mode is also
  *     active and then the chip enters Power-down mode
  * 
  * When the chip wakes up from Power-down mode, this bit is auto cleared. User needs to
  * set this bit again for next Power-down.
  * 
  * In Power-down mode, external 4~24 MHz high speed crystal and the internal 22.1184MHz
  * high speed oscillator will be disabled in this mode, but the internal 10 kHz low
  * speed oscillator is not controlled by Power-down mode.
  * 
  * In Power-down mode, the PLL and system clock are disabled, and ignored the clock
  * source selection. The clocks of peripheral are not controlled by Power-down mode, if
  * the peripheral clock source is from the internal 10 kHz low speed oscillator.
  * 
  * 1 = Chip entering the Power-down mode instantly or wait CPU sleep command - WFI
  * 0 = Chip operating normally or chip in Idle mode because of WFI command.
  * 
  * 
  * PD_WAIT_CPU [8]
  * Power-down Entry Conditions Control (Write-protection Bit)
  * 
  * 1 = Chip entering Power-down mode when the both PD_WAIT_CPU and
  *     PWR_DOWN_EN bits are set to 1 and CPU run WFI instruction.
  * 0 = Chip entering Power-down mode when the PWR_DOWN_EN bit is set to 1
  * 
  * 
  * See NUC123 Technical Reference Manual, page 109, for Power-Down Mode Control Table
  * which contains operating modes for Power-Down.
  * 
  */

