ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define CLK_PWRCON_XTL12M_EN_Pos                          0
#define CLK_PWRCON_XTL12M_EN_Msk                          (0x01ul << CLK_PWRCON_XTL12M_EN_Pos)
// Bit 1 is Reserved
#define CLK_PWRCON_OSC22M_EN_Pos                          2
#define CLK_PWRCON_OSC22M_EN_Msk                          (0x01ul << CLK_PWRCON_OSC22M_EN_Pos)
#define CLK_PWRCON_OSC10K_EN_Pos                          3
#define CLK_PWRCON_OSC10K_EN_Msk                          (0x01ul << CLK_PWRCON_OSC10K_EN_Pos)
#define CLK_PWRCON_PD_WU_DLY_Pos                          4
#define CLK_PWRCON_PD_WU_DLY_Msk                          (0x01ul << CLK_PWRCON_PD_WU_DLY_Pos)
#define CLK_PWRCON_PD_WU_INT_EN_Pos                       5
#define CLK_PWRCON_PD_WU_INT_EN_Msk                       (0x01ul << CLK_PWRCON_PD_WU_INT_EN_Pos)
#define CLK_PWRCON_PD_WU_STS_Pos                          6
#define CLK_PWRCON_PD_WU_STS_Msk                          (0x01ul << CLK_PWRCON_PD_WU_STS_Pos)
#define CLK_PWRCON_PWR_DOWN_EN_Pos                        7
#define CLK_PWRCON_PWR_DOWN_EN_Msk                        (0x01ul << CLK_PWRCON_PWR_DOWN_EN_Pos)
#define CLK_PWRCON_PD_WAIT_CPU_Pos                        8
#define CLK_PWRCON_PD_WAIT_CPU_Msk                        (0x01ul << CLK_PWRCON_PD_WAIT_CPU_Pos)
// Bits 9-31 are Reserved


/**
  * @brief Clock Controller (CLK) - Register AHBCLK
  * 
  * @description AHB Devices Clock Enable Control Register (AHBCLK) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 110
  * 
  * AHBCLK = CLK_BA+0x04
  * 
  * 
  * PDMA_EN [1]
  * PDMA Controller Clock Enable Control
  * 
  * 1 = PDMA engine clock Enabled.
  * 0 = PDMA engine clock Disabled.
  * 
  * 
  * ISP_EN [2]
  * Flash ISP Controller Clock Enable Control
  * 
  * 1 = Flash ISP engine clock Enabled.
  * 0 = Flash ISP engine clock Disabled.
  * 
  */

// Bit 0 is Reserved.
#define CLK_AHBCLK_PDMA_EN_Pos                            1
#define CLK_AHBCLK_PDMA_EN_Msk                            (0x01ul << CLK_AHBCLK_PDMA_EN_Pos)
#define CLK_AHBCLK_ISP_EN_Pos                             2
#define CLK_AHBCLK_ISP_EN_Msk                             (0x01ul << CLK_AHBCLK_ISP_EN_Pos)
//Bits 3-31 are Reserved.

/**
  * @brief Clock Controller (CLK) - Register APBCLK
  * 
  * @description APB Devices Clock Enable Control Register (APBCLK) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 111-113
  * 
  * APBCLK = CLK_BA+0x08
  * 
  * 
  * WDT_EN [0]
  * Watchdog Timer Clock Enable (Write-protection Bit)
  * 
  * 1 = Watchdog Timer Clock Enabled.
  * 0 = Watchdog Timer Clock Disabled.
  * 
  * This bit is the protected bit, which means programming it needs to write "59h", "16h",
  * "88h" to address 0x5000_0100 to disable register protection.
  * 
  * Refer to the register REGWRPROT at address GCR_BA+0x100.
  * 
  * 
  * TMR0_EN [2]
  * Timer0 Clock Enable
  * 
  * 1 = Timer0 clock Enabled.
  * 0 = Timer0 clock Disabled.
  * 
  * 
  * TMR1_EN [3]
  * Timer1 Clock Enable
  * 
  * 1 = Timer1 clock Enabled.
  * 0 = Timer1 clock Disabled.
  * 
  * 
  * TMR2_EN [4]
  * Timer2 Clock Enable
  * 
  * 1 = Timer2 clock Enabled.
  * 0 = Timer2 clock Disabled.
  * 
  * 
  * TMR3_EN [5]
  * Timer3 Clock Enable
  * 
  * 1 = Timer3 clock Enabled.
  * 0 = Timer3 clock Disabled.
  * 
  * 
  * FDIV_EN [6]
  * Frequency Divider Output Clock Enable
  * 
  * 1 = FDIV clock Enabled.
  * 0 = FDIV clock Disabled.
  * 
  * 
  * I2C0_EN [8]
  * I2C0 Clock Enable
  * 
  * 1 = I2C0 clock Enabled.
  * 0 = I2C0 clock Disabled.
  * 
  * 
  * I2C1_EN [9]
  * I2C1 Clock Enable
  * 
  * 1 = I2C1 clock Enabled.
  * 0 = I2C1 clock Disabled.
  * 
  * 
  * SPI0_EN [12]
  * SPI0 Clock Enable
  * 
  * 1 = SPI0 clock Enabled.
  * 0 = SPI0 clock Disabled.
  * 
  * 
  * SPI1_EN [13]
  * SPI1 Clock Enable
  * 
  * 1 = SPI1 clock Enabled.
  * 0 = SPI1 clock Disabled.
  * 
  * 
  * SPI2_EN [14]
  * SPI2 Clock Enable
  * 
  * 1 = SPI2 clock Enabled.
  * 0 = SPI2 clock Disabled.
  * 
  * 
  * UART0_EN [16]
  * UART0 Clock Enable
  * 
  * 1 = UART0 clock Enabled.
  * 0 = UART0 clock Disabled.
  * 
  * 
  * UART1_EN [16]
  * UART1 Clock Enable
  * 
  * 1 = UART1 clock Enabled.
  * 0 = UART1 clock Disabled.
  * 
  * 
  * PWM01_EN [20]
  * PWM_01 Clock Enable
  * 
  * 1 = PWM01 clock Enabled.
  * 0 = PWM01 clock Disabled.
  * 
  * 
  * PWM23_EN [21]
  * PWM_23 Clock Enable
  * 
  * 1 = PWM23 clock Enabled.
  * 0 = PWM23 clock Disabled.
  * 
  * 
  * USBD_EN [27]
  * USB 2.0 FS Device Controller Clock Enable
  * 
  * 1 = USB clock Enabled.
  * 0 = USB clock Disabled.
  * 
  * 
  * ADC_EN [28]
  * Analog-Digital-Converter (ADC) Clock Enable
  * 
  * 1 = ADC clock Enabled.
  * 0 = ADC clock Disabled.
  * 
  * 
  * I2S_EN [29]
  * I2S Clock Enable
  * 
  * 1 = I2S Clock Enabled.
  * 0 = I2S Clock Disabled.
  * 
  * 
  * PS2_EN [31]
  * PS/2 Clock Enable
  * 
  * 1 = PS/2 clock Enabled.
  * 0 = PS/2 clock Disabled.
  * 
  */

#define CLK_APBCLK_WDT_EN_Pos                             0
#define CLK_APBCLK_WDT_EN_Msk                             (0x01ul << CLK_APBCLK_WDT_EN_Pos)
// Bit 1 is Reserved.
#define CLK_APBCLK_TMR0_EN_Pos                            2
#define CLK_APBCLK_TMR0_EN_Msk                            (0x01ul << CLK_APBCLK_TMR0_EN_Pos)
#define CLK_APBCLK_TMR1_EN_Pos                            3
#define CLK_APBCLK_TMR1_EN_Msk                            (0x01ul << CLK_APBCLK_TMR1_EN_Pos)
#define CLK_APBCLK_TMR2_EN_Pos                            4
#define CLK_APBCLK_TMR2_EN_Msk                            (0x01ul << CLK_APBCLK_TMR2_EN_Pos)
#define CLK_APBCLK_TMR3_EN_Pos                            5
#define CLK_APBCLK_TMR3_EN_Msk                            (0x01ul << CLK_APBCLK_TMR3_EN_Pos)
#define CLK_APBCLK_FDIV_EN_Pos                            6
#define CLK_APBCLK_FDIV_EN_Msk                            (0x01ul << CLK_APBCLK_FDIV_EN_Pos)
// Bit 7 is Reserved.
#define CLK_APBCLK_I2C0_EN_Pos                            8
#define CLK_APBCLK_I2C0_EN_Msk                            (0x01ul << CLK_APBCLK_I2C0_EN_Pos)
#define CLK_APBCLK_I2C1_EN_Pos                            9
#define CLK_APBCLK_I2C1_EN_Msk                            (0x01ul << CLK_APBCLK_I2C1_EN_Pos)
// Bits 10-11 are Reserved.
#define CLK_APBCLK_SPI0_EN_Pos                            12
#define CLK_APBCLK_SPI0_EN_Msk                            (0x01ul << CLK_APBCLK_SPI0_EN_Pos)
#define CLK_APBCLK_SPI1_EN_Pos                            13
#define CLK_APBCLK_SPI1_EN_Msk                            (0x01ul << CLK_APBCLK_SPI1_EN_Pos)
#define CLK_APBCLK_SPI2_EN_Pos                            14
#define CLK_APBCLK_SPI2_EN_Msk                            (0x01ul << CLK_APBCLK_SPI2_EN_Pos)
// Bit 15 is Reserved.
#define CLK_APBCLK_UART0_EN_Pos                           16
#define CLK_APBCLK_UART0_EN_Msk                           (0x01ul << CLK_APBCLK_UART0_EN_Pos)
#define CLK_APBCLK_UART1_EN_Pos                           17
#define CLK_APBCLK_UART1_EN_Msk                           (0x01ul << CLK_APBCLK_UART1_EN_Pos)
// Bits 18-19 are Reserved.
#define CLK_APBCLK_PWM01_EN_Pos                           20
#define CLK_APBCLK_PWM01_EN_Msk                           (0x01ul << CLK_APBCLK_PWM01_EN_Pos)
#define CLK_APBCLK_PWM23_EN_Pos                           21
#define CLK_APBCLK_PWM23_EN_Msk                           (0x01ul << CLK_APBCLK_PWM23_EN_Pos)
// Bits 22-26 are Reserved.
#define CLK_APBCLK_USBD_EN_Pos                            27
#define CLK_APBCLK_USBD_EN_Msk                            (0x01ul << CLK_APBCLK_USBD_EN_Pos)
#define CLK_APBCLK_ADC_EN_Pos                             28
#define CLK_APBCLK_ADC_EN_Msk                             (0x01ul << CLK_APBCLK_ADC_EN_Pos)
#define CLK_APBCLK_I2S_EN_Pos                             29
#define CLK_APBCLK_I2S_EN_Msk                             (0x01ul << CLK_APBCLK_I2S_EN_Pos)
// Bit 30 is Reserved.
#define CLK_APBCLK_PS2_EN_Pos                             31
#define CLK_APBCLK_PS2_EN_Msk                             (0x01ul << CLK_APBCLK_PS2_EN_Pos)


/**
  * @brief Clock Controller (CLK) - Register CLKSTATUS
  * 
  * @description Clock Status Register (CLKSTATUS) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 114-115
  * 
  * CLKSTATUS = CLK_BA+0x0C
  * 
  * 
  * XTL12M_STB [0]
  * External 4~24 MHz High Speed Crystal Clock Source Stable Flag
  * 
  * 1 = External 4~24 MHz high speed crystal clock is stable.
  * 0 = External 4~24 MHz high speed crystal clock is not stable or disabled.
  * 
  * This is read only bit.
  * 
  * 
  * PLL_STB [2]
  * Internal PLL Clock Source Stable Flag
  * 
  * 1 = Internal PLL clock is stable.
  * 0 = Internal PLL clock is not stable or disabled.
  * 
  * This is read only bit.
  * 
  * 
  * OSC10K_STB [3]
  * Internal 10 kHz Low Speed Oscillator Clock Source Stable Flag
  * 
  * 1 = Internal 10 kHz low speed oscillator clock is stable.
  * 0 = Internal 10 kHz low speed oscillator clock is not stable or disabled.
  * 
  * This is read only bit.
  * 
  * 
  * OSC22M_STB [4]
  * Internal 22.1184 MHz High Speed Oscillator Clock Source Stable Flag
  * 
  * 1 = Internal 22.1184 MHz high speed oscillator clock is stable.
  * 0 = Internal 22.1184 MHz high speed oscillator clock is not stable or disabled.
  * 
  * This is read only bit
  * 
  * 
  * CLK_SW_FAIL [7]
  * Clock Switching Fail Flag (Write-protection Bit)
  * 
  * 1 = Clock switching failed.
  * 0 = Clock switching success.
  * 
  * This bit is updated when software switches system clock source. If switch target clock
  * is stable, this bit will be set to 0.
  * If switch target clock is not stable, this bit will be set to 1.
  * 
  * Write 1 to clear the bit to zero.
  * 
  */

#define CLK_CLKSTATUS_XTL12M_STB_Pos                      0
#define CLK_CLKSTATUS_XTL12M_STB_Msk                      (0x01ul << CLK_CLKSTATUS_XTL12M_STB_Pos)
// Bit 1 is Reserved.
#define CLK_CLKSTATUS_PLL_STB_Pos                         2
#define CLK_CLKSTATUS_PLL_STB_Msk                         (0x01ul << CLK_CLKSTATUS_PLL_STB_Pos)
#define CLK_CLKSTATUS_OSC10K_STB_Pos                      3
#define CLK_CLKSTATUS_OSC10K_STB_Msk                      (0x01ul << CLK_CLKSTATUS_OSC10K_STB_Pos)
#define CLK_CLKSTATUS_OSC22M_STB_Pos                      4
#define CLK_CLKSTATUS_OSC22M_STB_Msk                      (0x01ul << CLK_CLKSTATUS_OSC22M_STB_Pos)
// Bits 5-6 are Reserved.
#define CLK_CLKSTATUS_CLK_SW_FAIL_Pos                     7
#define CLK_CLKSTATUS_CLK_SW_FAIL_Msk                     (0x01ul << CLK_CLKSTATUS_CLK_SW_FAIL_Pos)
// Bits 8-31 are Reserved.


/**
  * @brief Clock Controller (CLK) - Register CLKSEL0
  * 
  * @description Clock Source Select Control Register 0 (CLKSEL0) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 116
  * 
  * CLKSEL0 = CLK_BA+0x10
  * 
  * 
  * HCLK_S [0:2]
  * HCLK Clock Source Selection (Write-protection Bits)
  * 
  * 000 = Clock source from external 4~24 MHz high speed crystal clock
  * 001 = Clock source from PLL clock/2
  * 010 = Clock source from PLL clock
  * 011 = Clock source from internal 10 kHz low speed oscillator clock
  * 111 = Clock source from internal 22.1184 MHz high speed oscillator clock
  * 
  * Note 1 Before clock switching, the related clock sources (both pre-select and new-select)
  *        must be turn on.
  * Note 2 The 3-bit default value is reloaded from the value of CFOSC (Config0[26:24]) in
  *        user configuration register of Flash controller by any reset. Therefore the default
  *        value is either 000b or 111b.
  * 
  * 
  * STCLK_S [3:5]
  * Cortex_M0 SysTick Clock Source Selection (Write-protection Bits)
  * 
  * If SYST_CSR[2]= 0, SysTick uses clock source listed below.
  * 000 = Clock source from external 4~24 MHz high speed crystal clock
  * 010 = Clock source from external 4~24 MHz high speed crystal clock/2
  * 011 = Clock source from HCLK/2
  * 111 = Clock source from internal 22.1184 MHz high speed oscillator clock/2
  * 
  * 
  * All these bits are protected bit, It means programming this bit needs to write
  * "59h", "16h", "88h" to address 0x5000_0100 to disable register protection.
  * 
  * Refer to the register REGWRPROT at address GCR_BA+0x100.
  * 
  */

/* CLK CLKSEL0 Bit Field Definitions */
#define CLK_CLKSEL0_HCLK_S_Pos                            0
#define CLK_CLKSEL0_HCLK_S_Msk                            (0b0111ul << CLK_CLKSEL0_HCLK_S_Pos)
#define CLK_CLKSEL0_STCLK_S_Pos                           3
#define CLK_CLKSEL0_STCLK_S_Msk                           (0b0111ul << CLK_CLKSEL0_STCLK_S_Pos)
// Bits 4-31 are Reserved.


/**
  * @brief Clock Controller (CLK) - Register CLKSEL1
  * 
  * @description Clock Source Select Control Register 1 (CLKSEL1) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 117-119
  * 
  * CLKSEL1 = CLK_BA+0x14
  * 
  * 
  * WDT_S [0:1]
  * Watchdog Timer Clock Source Selection (Write-protection Bits)
  * 
  * 10 = Clock source from HCLK/2048 clock.
  * 11 = Clock source from internal 10 kHz low speed oscillator clock.
  * 
  * These bits are protected bits and programming this needs to write "59h", "16h", "88h" to
  * address 0x5000_0100 to disable register protection.
  * Refer to the register REGWRPROT at address GCR_BA+0x100.
  * 
  * 
  * ADC_S [2:3]
  * ADC Clock Source Selection
  * 
  * 00 = Clock source from external 4~24 MHz high speed crystal clock
  * 01 = Clock source from PLL clock
  * 10 = Clock source from HCLK
  * 11 = Clock source from internal 22.1184 MHz high speed oscillator clock
  * 
  * 
  * SPI0_S [4]
  * SPI0 Clock Source Selection
  * 
  * 1 = Clock source from HCLK.
  * 0 = Clock source from PLL clock.
  * 
  * 
  * SPI1_S [5]
  * SPI1 Clock Source Selection
  * 
  * 1 = Clock source from HCLK.
  * 0 = Clock source from PLL clock.
  * 
  * 
  * SPI2_S [6]
  * SPI2 Clock Source Selection
  * 
  * 1 = Clock source from HCLK.
  * 0 = Clock source from PLL clock.
  * 
  * 
  * TMR0_S [8:10]
  * TIMER0 Clock Source Selection
  * 
  * 000 = Clock source from external 4~24 MHz high speed crystal clock.
  * 010 = Clock source from HCLK.
  * 011 = Clock source from external clock source TM0.
  * 100 = Clock source from internal 10 kHz low speed oscillator clock.
  * 111 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 
  * 
  * TMR1_S [12:14]
  * TIMER1 Clock Source Selection
  * 
  * 000 = Clock source from external 4~24 MHz high speed crystal clock.
  * 010 = Clock source from HCLK.
  * 011 = Clock source from external clock source TM1.
  * 100 = Clock source from internal 10 kHz low speed oscillator clock.
  * 111 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 
  * 
  * TMR2_S [16:18]
  * TIMER2 Clock Source Selection
  * 
  * 000 = Clock source from external 4~24 MHz high speed crystal clock.
  * 010 = Clock source from HCLK.
  * 011 = Clock source from external clock source TM2.
  * 100 = Clock source from internal 10 kHz low speed oscillator clock.
  * 111 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 
  * 
  * TMR3_S [20:22]
  * TIMER3 Clock Source Selection
  * 
  * 000 = Clock source from external 4~24 MHz high speed crystal clock.
  * 010 = Clock source from HCLK.
  * 011 = Clock source from external clock source TM3.
  * 100 = Clock source from internal 10 kHz low speed oscillator clock.
  * 111 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 
  * 
  * UART_S [24:25]
  * UART Clock Source Selection
  * 
  * 00 = Clock source from external 4~24 MHz high speed crystal clock.
  * 01 = Clock source from PLL clock.
  * 11 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 
  * 
  * PWM01_S [28:29]
  * PWM0 and PWM1 Clock Source Select Bit [1:0]
  * 
  * PWM0 and PWM1 use the same Engine clock source, and both of them use the same
  * prescaler
  * 
  * The Engine clock source of PWM0 and PWM1 is defined by PWM01_S[0:2] and this
  * field is combined by CLKSEL2[8] and CLKSEL1[29:28].
  * 
  * 000 = Clock source from external 4~24 MHz high speed crystal clock.
  * 010 = Clock source from HCLK.
  * 011 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 111 = Clock source from internal 10 kHz low speed oscillator clock.
  * 
  * 
  * PWM23_S [30:31]
  * PWM2 and PWM3 Clock Source Select Bit [1:0]
  * 
  * PWM2 and PWM3 use the same Engine clock source, and both of them use the same
  * prescaler
  * 
  * The Engine clock source of PWM2 and PWM3 is defined by PWM23_S[0:2] and this
  * field is combined by CLKSEL2[9] and CLKSEL1[30:31].
  * 
  * 000 = Clock source from external 4~24 MHz high speed crystal clock.
  * 010 = Clock source from HCLK.
  * 011 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 111 = Clock source from internal 10 kHz low speed oscillator clock.
  * 
  * 
  * NOTE: Before clock switching, the related clock sources (pre-select and new-select)
  * must be turned on.
  * 
  */

