ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define CLK_CLKSEL1_WDT_S_Pos                             0
#define CLK_CLKSEL1_WDT_S_Msk                             (0b011ul << CLK_CLKSEL1_WDT_S_Pos)
#define CLK_CLKSEL1_ADC_S_Pos                             2
#define CLK_CLKSEL1_ADC_S_Msk                             (0b011ul << CLK_CLKSEL1_ADC_S_Pos)
#define CLK_CLKSEL1_SPI0_S_Pos                            4
#define CLK_CLKSEL1_SPI0_S_Msk                            (0b01ul << CLK_CLKSEL1_SPI0_S_Pos)
#define CLK_CLKSEL1_SPI1_S_Pos                            5
#define CLK_CLKSEL1_SPI1_S_Msk                            (0b01ul << CLK_CLKSEL1_SPI1_S_Pos)
#define CLK_CLKSEL1_SPI2_S_Pos                            6
#define CLK_CLKSEL1_SPI2_S_Msk                            (0b01ul << CLK_CLKSEL1_SPI2_S_Pos)
// Bit 7 is Reserved.
#define CLK_CLKSEL1_TMR0_S_Pos                            8
#define CLK_CLKSEL1_TMR0_S_Msk                            (0b0111ul << CLK_CLKSEL1_TMR0_S_Pos)
// Bit 11 is Reserved.
#define CLK_CLKSEL1_TMR1_S_Pos                            12
#define CLK_CLKSEL1_TMR1_S_Msk                            (0b0111ul << CLK_CLKSEL1_TMR1_S_Pos)
// Bit 15 is Reserved.
#define CLK_CLKSEL1_TMR2_S_Pos                            16
#define CLK_CLKSEL1_TMR2_S_Msk                            (0b0111ul << CLK_CLKSEL1_TMR2_S_Pos)
// Bit 19 is Reserved.
#define CLK_CLKSEL1_TMR3_S_Pos                            20
#define CLK_CLKSEL1_TMR3_S_Msk                            (0b0111ul << CLK_CLKSEL1_TMR3_S_Pos)
// Bit 23 is Reserved.
#define CLK_CLKSEL1_UART_S_Pos                            24
#define CLK_CLKSEL1_UART_S_Msk                            (0b011ul << CLK_CLKSEL1_UART_S_Pos)
// Bits 26-27 are Reserved.
#define CLK_CLKSEL1_PWM01_S_Pos                           28
#define CLK_CLKSEL1_PWM01_S_Msk                           (0b011ul << CLK_CLKSEL1_PWM01_S_Pos)
#define CLK_CLKSEL1_PWM23_S_Pos                           30
#define CLK_CLKSEL1_PWM23_S_Msk                           (0b011ul << CLK_CLKSEL1_PWM23_S_Pos)


/**
  * @brief Clock Controller (CLK) - Register CLKSEL2
  * 
  * @description Clock Source Select Control Register 2 (CLKSEL2) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 120-121
  * 
  * CLKSEL2 = CLK_BA+0x1C
  * 
  * 
  * I2S_S [0:1]
  * I2S Clock Source Selection
  * 
  * 00 = Clock source from external 4~24 MHz high speed crystal clock.
  * 01 = Clock source from HCLK.
  * 10 = Clock source from PLL clock.
  * 11 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 
  * 
  * FRQDIV_S [2:3]
  * Clock Divider Clock Source Selection
  * 
  * 00 = Clock source from external 4~24 MHz high speed crystal clock.
  * 01 = Clock source from HCLK.
  * 10 = Reserved.
  * 11 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 
  * 
  * PWM01_S [2]
  * PWM0 and PWM1 Clock Source Select Bit [2]
  * 
  * PWM0 and PWM1 use the same Engine clock source, and both of them use the same
  * prescaler.
  * 
  * The Engine clock source of PWM0 and PWM1 is defined by PWM01_S[2:0] and this
  * field is combined by CLKSEL2[8] and CLKSEL1[29:28].
  * 
  * 000 = Clock source from external 4~24 MHz high speed crystal clock.
  * 010 = Clock source from HCLK.
  * 011 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 111 = Clock source from internal 10 kHz low speed oscillator clock.
  * 
  * 
  * PWM23_S [9]
  * PWM2 and PWM3 Clock Source Select Bit [2]
  * 
  * PWM2 and PWM3 use the same Engine clock source, and both of them use the same
  * prescaler.
  * 
  * The Engine clock source of PWM2 and PWM3 is defined by PWM23_S[2:0] and this
  * field is combined by CLKSEL2[9] and CLKSEL1[31:30].
  * 
  * 000 = Clock source from external 4~24 MHz high speed crystal clock.
  * 010 = Clock source from HCLK.
  * 011 = Clock source from internal 22.1184 MHz high speed oscillator clock.
  * 111 = Clock source from internal 10 kHz low speed oscillator clock.
  * 
  * 
  * WWDT_S [16:17]
  * Windowed-Watchdog Timer Clock Source Selection (Write-protection Bits)
  * 
  * 10 = Clock source from HCLK/2048 clock.
  * 11 = Clock source from internal 10 kHz low speed oscillator clock.
  * 
  * 
  * NOTE: Before clock switching, the related clock sources (pre-select and new-select)
  * must be turned on.
  * 
  */

#define CLK_CLKSEL2_I2S_S_Pos                             0
#define CLK_CLKSEL2_I2S_S_Msk                             (0b011ul << CLK_CLKSEL2_I2S_S_Pos)
#define CLK_CLKSEL2_FRQDIV_S_Pos                          2
#define CLK_CLKSEL2_FRQDIV_S_Msk                          (0b011ul << CLK_CLKSEL2_FRQDIV_S_Pos)
// Bits 4-7 are Reserved.
#define CLK_CLKSEL2_PWM01_S_Pos                           8
#define CLK_CLKSEL2_PWM01_S_Msk                           (0b01ul << CLK_CLKSEL2_PWM01_S_Pos)
#define CLK_CLKSEL2_PWM23_S_Pos                           9
#define CLK_CLKSEL2_PWM23_S_Msk                           (0b01ul << CLK_CLKSEL2_PWM23_S_Pos)
// Bits 10-15 are Reserved.
#define CLK_CLKSEL2_WWDT_S_Pos                            16
#define CLK_CLKSEL2_WWDT_S_Msk                            (0b011ul << CLK_CLKSEL2_WWDT_S_Pos)
// Bits 18-31 are Reserved.


/**
  * @brief Clock Controller (CLK) - Register CLKDIV
  * 
  * @description Clock Divider Register (CLKDIV) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 122
  * 
  * CLKDIV = CLK_BA+0x18
  * 
  * 
  * HCLK_N [0:3]
  * HCLK Clock Divide Number from HCLK Clock Source
  * 
  * HCLK clock frequency = (HCLK clock source frequency) / (HCLK_N + 1)
  * 
  * 
  * USB_N [4:7]
  * USB Clock Divide Number from PLL Clock
  * 
  * USB clock frequency = (PLL frequency ) / (USB_N + 1)
  * 
  * 
  * UART_N [8:11]
  * UART Clock Divide Number from UART Clock Source
  * 
  * UART clock frequency = (UART clock source frequency ) / (UART_N + 1)
  * 
  * 
  * ADC_N [16:23]
  * ADC Clock Divide Number from ADC Clock Source
  * 
  * ADC clock frequency = (ADC clock source frequency ) / (ADC_N + 1)
  * 
  */

#define CLK_CLKDIV_HCLK_N_Pos                             0
#define CLK_CLKDIV_HCLK_N_Msk                             (0x0Ful << CLK_CLKDIV_HCLK_N_Pos)
#define CLK_CLKDIV_USB_N_Pos                              4
#define CLK_CLKDIV_USB_N_Msk                              (0x0Ful << CLK_CLKDIV_USB_N_Pos)
#define CLK_CLKDIV_UART_N_Pos                             8
#define CLK_CLKDIV_UART_N_Msk                             (0x0Ful << CLK_CLKDIV_UART_N_Pos)
// Bits 12-15 are Reserved.
#define CLK_CLKDIV_ADC_N_Pos                              16
#define CLK_CLKDIV_ADC_N_Msk                              (0xFFul << CLK_CLKDIV_ADC_N_Pos)
// Bits 24-31 are Reserved.


/**
  * @brief Clock Controller (CLK) - Register PLLCON
  * 
  * @description PLL Control Register (PLLCON) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 123-124
  * 
  * PLLCON = CLK_BA+0x18
  * 
  * 
  * FB_DV [0:8]
  * PLL Feedback Divider Control Pins
  * 
  * See formulas on NUC123 Technical Reference Manual, page 124
  * 
  * 
  * IN_DV [9:13]
  * PLL Input Divider Control Pins
  * 
  * See formulas on NUC123 Technical Reference Manual, page 124
  * 
  * 
  * OUT_DV [14:15]
  * PLL Output Divider Control Pins
  * 
  * See formulas on NUC123 Technical Reference Manual, page 124
  * 
  * OUT_DV = "00" : NO = 1
  * OUT_DV = "01" : NO = 2
  * OUT_DV = "10" : NO = 2
  * OUT_DV = "11" : NO = 4
  * 
  * 
  * PD [16]
  * Power-down Mode
  * 
  * If the PWR_DOWN_EN bit set to 1 in PWRCON register, the PLL will also enter
  * Power-down mode.
  * 
  * 0 = PLL is in Normal mode.
  * 1 = PLL is in Power-down mode (default).
  * 
  * 
  * BP [17]
  * PLL Bypass Control
  * 
  * 0 = PLL is in Normal mode (default).
  * 1 = PLL clock output is the same as clock input (XTALin).
  * 
  * 
  * OE [18]
  * PLL OE (FOUT Enable) Pin Control
  * 
  * 0 = PLL FOUT Enabled.
  * 1 = PLL FOUT is fixed low.
  * 
  * 
  * PLL_SRC [19]
  * PLL Source Clock Selection
  * 
  * 1 = PLL source clock from internal 22.1184 MHz high speed oscillator.
  * 0 = PLL source clock from external 4~24 MHz high speed crystal.
  * 
  */

