ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define CLK_PLLCON_FB_DV_Pos                              0
#define CLK_PLLCON_FB_DV_Msk                              (0x1FFul << CLK_PLLCON_FB_DV_Pos)
#define CLK_PLLCON_IN_DV_Pos                              9
#define CLK_PLLCON_IN_DV_Msk                              (0x01Ful << CLK_PLLCON_IN_DV_Pos)
#define CLK_PLLCON_OUT_DV_Pos                             14
#define CLK_PLLCON_OUT_DV_Msk                             (0x03ul << CLK_PLLCON_OUT_DV_Pos)
#define CLK_PLLCON_PD_Pos                                 16
#define CLK_PLLCON_PD_Msk                                 (0x01ul << CLK_PLLCON_PD_Pos)
#define CLK_PLLCON_BP_Pos                                 17
#define CLK_PLLCON_BP_Msk                                 (0x01ul << CLK_PLLCON_BP_Pos)
#define CLK_PLLCON_OE_Pos                                 18
#define CLK_PLLCON_OE_Msk                                 (0x01ul << CLK_PLLCON_OE_Pos)
#define CLK_PLLCON_PLL_SRC_Pos                            19
#define CLK_PLLCON_PLL_SRC_Msk                            (0x01ul << CLK_PLLCON_PLL_SRC_Pos)
// Bits 20-31 are Reserved.


/**
  * @brief Clock Controller (CLK) - Register FRQDIV
  * 
  * @description Frequency Divider Control Register (FRQDIV) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 125
  * 
  * FRQDIV = CLK_BA+0x24
  * 
  * 
  * FSEL [0:3]
  * Divider Output Frequency Select Bits
  * 
  * The formula of output frequency is:
  * 
  * Fout = Fin / 2 (N+1)
  * Fin is the input clock frequency.
  * Fout is the frequency of divider output clock.
  * N is the 4-bit value of FSEL[3:0].
  * 
  * 
  * DIVIDER_EN [4]
  * Frequency Divider Enable Bit
  * 
  * 0 = Frequency Divider Disabled.
  * 1 = Frequency Divider Enabled.
  * 
  */

#define CLK_FRQDIV_FSEL_Pos                               0
#define CLK_FRQDIV_FSEL_Msk                               (0x0Ful << CLK_FRQDIV_FSEL_Pos)
#define CLK_FRQDIV_DIVIDER_EN_Pos                         4
#define CLK_FRQDIV_DIVIDER_EN_Msk                         (0x01ul << CLK_FRQDIV_DIVIDER_EN_Pos)
// Bits 5-31 are Reserved.


/**
  * @brief Clock Controller (CLK) - Register APBDIV
  * 
  * @description APB Divider Control Register (APBDIV) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.4.8 Register Description, page 125
  * 
  * APBDIV = CLK_BA+0x24
  * 
  * 
  * APBDIV [0]
  * APB Divider Enable Bit
  * 
  * 0: PCLK = HCLK
  * 1: PCLK = HCLK / 2
  * 
  */

#define CLK_APBDIV_APBDIV_Pos                             0
#define CLK_APBDIV_APBDIV_Msk                             (0x01ul << CLK_APBDIV_APBDIV_Pos)
// Bits 1-31 are Reserved.



/* =========================================================================================================================== */
/* ================                                    System Manager Control                                 ================ */
/* =========================================================================================================================== */

/**
  * @brief System Manager Control (GCR)
  * 
  * @description See NUC123 Technical Reference Manual 5.3.4 System Manager Control Registers, page 57
  * 
  * GCR_BA = 0x5000_0000
  * 
  * Struct has large sections of reserved space (RESERVED<x>) for other NUC123 Family silicon
  * 
  */

typedef struct {

    __I  uint32_t PDID;          // GCR_BA+0x00                   Part Device Identification Number Register
    __IO uint32_t RSTSRC;        // GCR_BA+0x04                   System Reset Source Register
    __IO uint32_t IPRSTC1;       // GCR_BA+0x08                   Peripheral Reset Control Register 1
    __IO uint32_t IPRSTC2;       // GCR_BA+0x0C                   Peripheral Reset Control Register 2
    __I  uint32_t RESERVED0[2];
    __IO uint32_t BODCR;         // GCR_BA+0x18                   Brown-out Detector Control Register
    __I  uint32_t RESERVED1[2];
    __IO uint32_t PORCR;         // GCR_BA+0x24                   Power-on-Reset Controller Register
    __I  uint32_t RESERVED2[2];
    __IO uint32_t GPA_MFP;       // GCR_BA+0x30                   GPIOA Multiple Function and Input Type Control Register
    __IO uint32_t GPB_MFP;       // GCR_BA+0x34                   GPIOB Multiple Function and Input Type Control Register
    __IO uint32_t GPC_MFP;       // GCR_BA+0x38                   GPIOC Multiple Function and Input Type Control Register
    __IO uint32_t GPD_MFP;       // GCR_BA+0x3C                   GPIOD Multiple Function and Input Type Control Register
    __I  uint32_t RESERVED3;
    __IO uint32_t GPF_MFP;       // GCR_BA+0x44                   GPIOF Multiple Function and Input Type Control Register
    __I  uint32_t RESERVED4[2];
    __IO uint32_t ALT_MFP;       // GCR_BA+0x50                   Alternative Multiple Function Pin Control Register
    __IO uint32_t ALT_MFP1;      // GCR_BA+0x54                   Alternative Multiple Function Pin Control Register 1
    __I  uint32_t RESERVED5[26];
    __IO uint32_t GPA_IOCR;      // GCR_BA+0xC0                   GPIOA IO Control Register
    __IO uint32_t GPB_IOCR;      // GCR_BA+0xC4                   GPIOB IO Control Register
    __I  uint32_t RESERVED6;
    __IO uint32_t GPD_IOCR;      // GCR_BA+0xCC                   GPIOD IO Control Register
    __I  uint32_t RESERVED7[12];
    __IO uint32_t REGWRPROT;     // GCR_BA+0x100                  Register Write Protect Register

} GCR_T;


/**
  * @brief System Manager Controller (SYS) - Register PDID
  * 
  * @description Part Device ID Code Register (PDID) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 58
  * 
  * Part Device Identification Number
  * This register reflects the device part number code. S/W can read this register to identify
  * which device is used.
  * 
  * PART NUMBER   |  PACKAGE  |  FLASH  |  SRAM  |     PDID
  * ==============|===========|=========|========|=============
  * NUC123ZD4AN0  |  QFN-33   |   68    |   20   |  0x0001_2355
  * NUC123ZC2AN1  |  QFN-33   |   36    |   12   |  0x0001_2345
  * NUC123LD4AN0  |  LQFP-48  |   68    |   20   |  0x0001_2335
  * NUC123LC2AN1  |  LQFP-48  |   36    |   12   |  0x0001_2325
  * NUC123SD4AN0  |  LQFP-64  |   68    |   20   |  0x0001_2315
  * NUC123SC2AN1  |  LQFP-64  |   36    |   12   |  0x0001_2305
  * 
  */

