ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define SYS_PDID_PN_Pos                                   0
#define SYS_PDID_PN_Msk                                   (0xFFFFFFFFFFFFFFFFul << SYS_PDID_PN_Pos)


/**
  * @brief System Manager Controller (SYS) - Register RSTSRC
  * 
  * @description System Reset Source Register (RSTSRC) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 59-60
  * 
  * 
  * RSTS_POR [0]
  * The RSTS_POR flag is set by the "reset signal" from the Power-On Reset (POR)
  * controller or bit CHIP_RST (IPRSTC1[0]) to indicate the previous reset source.
  * 
  * 1 = Power-On Reset (POR) or CHIP_RST had issued the reset signal to reset the
  *     system.
  * 0 = No reset from POR or CHIP_RST
  * 
  * RSTS_RESET [1]
  * The RSTS_RESET flag is set by the "reset signal" from the /RESET pin to indicate the
  * previous reset source.
  * 
  * 1 = Pin /RESET had issued the reset signal to reset the system.
  * 0 = No reset from /RESET pin
  * 
  * RSTS_WDT [2]
  * The RSTS_WDT flag is set by the "reset signal" from the watchdog timer to indicate the
  * previous reset source.
  * 
  * 1 = Watchdog timer had issued the reset signal to reset the system.
  * 0 = No reset from watchdog timer
  * 
  * RSTS_LVR [3]
  * The RSTS_LVR flag is set by the "reset signal" from the Low-Voltage-Reset controller
  * to indicate the previous reset source.
  * 
  * 1 = LVR controller had issued the reset signal to reset the system.
  * 0 = No reset from LVR
  * 
  * RSTS_BOD [4]
  * The RSTS_BOD flag is set by the "reset signal" from the Brown-out-Detector to
  * indicate the previous reset source.
  * 
  * 1 = BOD had issued the reset signal to reset the system
  * 0 = No reset from BOD
  * 
  * RSTS_SYS [5]
  * The RSTS_SYS flag is set by the "reset signal" from the Cortex_M0 kernel to indicate
  * the previous reset source.
  * 
  * 1 = Cortex_M0 had issued the reset signal to reset the system by software writing 1 to
  *     bit SYSRESETREQ(AIRCR[2], Application Interrupt and Reset Control Register,
  *     address = 0xE000ED0C) in system control registers of Cortex_M0 kernel.
  * 0 = No reset from Cortex_M0
  * 
  * RSTS_CPU [7]
  * The RSTS_CPU flag is set by hardware if software writes CPU_RST (IPRSTC1[1]) 1 to
  * reset Cortex-M0 CPU kernel and Flash memory controller (FMC).
  * 
  * 1 = Cortex-M0 CPU kernel and FMC are reset by software setting CPU_RST to 1.
  * 0 = No reset from CPU
  * 
  * 
  * Software can write 1 to any bit to clear to zero.
  * 
  */

#define SYS_RSTSRC_RSTS_POR_Pos                           0
#define SYS_RSTSRC_RSTS_POR_Msk                           (0x01ul << SYS_RSTSRC_RSTS_POR_Pos)
#define SYS_RSTSRC_RSTS_RESET_Pos                         1
#define SYS_RSTSRC_RSTS_RESET_Msk                         (0x01ul << SYS_RSTSRC_RSTS_RESET_Pos)
#define SYS_RSTSRC_RSTS_WDT_Pos                           2
#define SYS_RSTSRC_RSTS_WDT_Msk                           (0x01ul << SYS_RSTSRC_RSTS_WDT_Pos)
#define SYS_RSTSRC_RSTS_LVR_Pos                           3
#define SYS_RSTSRC_RSTS_LVR_Msk                           (0x01ul << SYS_RSTSRC_RSTS_LVR_Pos)
#define SYS_RSTSRC_RSTS_BOD_Pos                           4
#define SYS_RSTSRC_RSTS_BOD_Msk                           (0x01ul << SYS_RSTSRC_RSTS_BOD_Pos)
#define SYS_RSTSRC_RSTS_SYS_Pos                           5
#define SYS_RSTSRC_RSTS_SYS_Msk                           (0x01ul << SYS_RSTSRC_RSTS_SYS_Pos)
// Bit 6 is Reserved.
#define SYS_RSTSRC_RSTS_CPU_Pos                           7
#define SYS_RSTSRC_RSTS_CPU_Msk                           (0x01ul << SYS_RSTSRC_RSTS_CPU_Pos)
// Bits 8-31 are Reserved.


/**
  * @brief System Manager Controller (SYS) - Register IPRSTC1
  * 
  * @description Peripheral Reset Control Register1 (IPRSTC1) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 61-62
  * 
  * 
  * These bits are protected bits, which means programming them requires writing to "59h", "16h",
  * and "88h" to address 0x5000_0100 to disable register protection.
  * 
  * Refer to the register REGWRPROT at address GCR_BA+0x100 (See below)
  * 
  * 
  * CHIP One-shot Reset (Write-protection Bit)
  * Setting this bit will reset the whole chip, including CPU kernel and all peripherals, and
  * this bit will automatically return to 0 after the 2 clock cycles.
  * 
  * The CHIP_RST is same as the POR reset, all the chip controllers is reset and the chip
  * setting from flash are also reload.
  * 
  * 1 = CHIP one-shot reset.
  * 0 = CHIP normal operation.
  * 
  * 
  * CPU kernel one-shot reset (Write-protection Bit)
  * Setting this bit will only reset the CPU kernel and Flash Memory Controller(FMC), and
  * this bit will automatically return to 0 after the 2 clock cycles
  * 
  * 1 = CPU one-shot reset.
  * 0 = CPU normal operation.
  * 
  * 
  * PDMA Controller Reset (Write-protection Bit)
  * Setting this bit to 1 will generate a reset signal to the PDMA. User need to set this bit to
  * 0 to release from reset state.
  * 
  * 1 = PDMA controller reset.
  * 0 = PDMA controller normal operation.
  *
  */

#define SYS_IPRSTC1_CHIP_RST_Pos                          0
#define SYS_IPRSTC1_CHIP_RST_Msk                          (0x01ul << SYS_IPRSTC1_CHIP_RST_Pos)
#define SYS_IPRSTC1_CPU_RST_Pos                           1
#define SYS_IPRSTC1_CPU_RST_Msk                           (0x01ul << SYS_IPRSTC1_CPU_RST_Pos)
#define SYS_IPRSTC1_PDMA_RST_Pos                          2
#define SYS_IPRSTC1_PDMA_RST_Msk                          (0x01ul << SYS_IPRSTC1_PDMA_RST_Pos)
// Bits 3-31 are Reserved.


/**
  * @brief System Manager Controller (SYS) - Register IPRSTC2
  * 
  * @description Peripheral Reset Control Register2 (IPRSTC2) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 63-65
  * 
  * 
  * GPIO controller Reset
  * 1 = GPIO controller reset
  * 0 = GPIO controller normal operation
  * 
  * Timer0 controller Reset
  * 1 = Timer0 controller reset
  * 0 = Timer0 controller normal operation
  * 
  * Timer1 controller Reset
  * 1 = Timer1 controller reset
  * 0 = Timer1 controller normal operation
  * 
  * Timer2 controller Reset
  * 1 = Timer2 controller reset
  * 0 = Timer2 controller normal operation
  * 
  * Timer3 controller Reset
  * 1 = Timer3 controller reset
  * 0 = Timer3 controller normal operation
  * 
  * I2C0 controller Reset
  * 1 = I2C0 controller reset
  * 0 = I2C0 controller normal operation
  * 
  * I2C1 controller Reset
  * 1 = I2C1 controller reset
  * 0 = I2C1 controller normal operation
  * 
  * SPI0 controller Reset
  * 1 = SPI0 controller reset
  * 0 = SPI0 controller normal operation
  * 
  * SPI1 controller Reset
  * 1 = SPI1 controller reset
  * 0 = SPI1 controller normal operation
  * 
  * SPI2 controller Reset
  * 1 = SPI2 controller reset
  * 0 = SPI2 controller normal operation
  * 
  * UART0 controller Reset
  * 1 = UART0 controller reset
  * 0 = UART0 controller normal operation
  * 
  * UART1 controller Reset
  * 1 = UART1 controller reset
  * 0 = UART1 controller normal operation
  * 
  * USB Device controller Reset
  * 1 = USB Device controller reset
  * 0 = USB Device controller normal operation
  * 
  * ADC controller Reset
  * 1 = ADC controller reset
  * 0 = ADC controller normal operation
  * 
  * I2S controller Reset
  * 1 = I2S controller reset
  * 0 = I2S controller normal operation
  * 
  */

// Bit 0 is Reserved.
#define SYS_IPRSTC2_GPIO_RST_Pos                          1
#define SYS_IPRSTC2_GPIO_RST_Msk                          (0x01ul << SYS_IPRSTC2_GPIO_RST_Pos)
#define SYS_IPRSTC2_TMR0_RST_Pos                          2
#define SYS_IPRSTC2_TMR0_RST_Msk                          (0x01ul << SYS_IPRSTC2_TMR0_RST_Pos)
#define SYS_IPRSTC2_TMR1_RST_Pos                          3
#define SYS_IPRSTC2_TMR1_RST_Msk                          (0x01ul << SYS_IPRSTC2_TMR1_RST_Pos)
#define SYS_IPRSTC2_TMR2_RST_Pos                          4
#define SYS_IPRSTC2_TMR2_RST_Msk                          (0x01ul << SYS_IPRSTC2_TMR2_RST_Pos)
#define SYS_IPRSTC2_TMR3_RST_Pos                          5
#define SYS_IPRSTC2_TMR3_RST_Msk                          (0x01ul << SYS_IPRSTC2_TMR3_RST_Pos)
// Bits 6-7 are Reserved.
#define SYS_IPRSTC2_I2C0_RST_Pos                          8
#define SYS_IPRSTC2_I2C0_RST_Msk                          (0x01ul << SYS_IPRSTC2_I2C0_RST_Pos)
#define SYS_IPRSTC2_I2C1_RST_Pos                          9
#define SYS_IPRSTC2_I2C1_RST_Msk                          (0x01ul << SYS_IPRSTC2_I2C1_RST_Pos)
// Bits 10-11 are Reserved.
#define SYS_IPRSTC2_SPI0_RST_Pos                          12
#define SYS_IPRSTC2_SPI0_RST_Msk                          (0x01ul << SYS_IPRSTC2_SPI0_RST_Pos)
#define SYS_IPRSTC2_SPI1_RST_Pos                          13
#define SYS_IPRSTC2_SPI1_RST_Msk                          (0x01ul << SYS_IPRSTC2_SPI1_RST_Pos)
#define SYS_IPRSTC2_SPI2_RST_Pos                          14
#define SYS_IPRSTC2_SPI2_RST_Msk                          (0x01ul << SYS_IPRSTC2_SPI2_RST_Pos)
// Bit 15 is Reserved.
#define SYS_IPRSTC2_UART0_RST_Pos                         16
#define SYS_IPRSTC2_UART0_RST_Msk                         (0x01ul << SYS_IPRSTC2_UART0_RST_Pos)
#define SYS_IPRSTC2_UART1_RST_Pos                         17
#define SYS_IPRSTC2_UART1_RST_Msk                         (0x01ul << SYS_IPRSTC2_UART1_RST_Pos)
// Bits 18-19 are Reserved.
#define SYS_IPRSTC2_PWM03_RST_Pos                         20
#define SYS_IPRSTC2_PWM03_RST_Msk                         (0x01ul << SYS_IPRSTC2_PWM03_RST_Pos)
// Bits 21-22 are Reserved.
#define SYS_IPRSTC2_PS2_RST_Pos                           23
#define SYS_IPRSTC2_PS2_RST_Msk                           (0x01ul << SYS_IPRSTC2_PS2_RST_Pos)
// Bits 24-26 are Reserved.
#define SYS_IPRSTC2_USBD_RST_Pos                          27
#define SYS_IPRSTC2_USBD_RST_Msk                          (0x01ul << SYS_IPRSTC2_USBD_RST_Pos)
#define SYS_IPRSTC2_ADC_RST_Pos                           28
#define SYS_IPRSTC2_ADC_RST_Msk                           (0x01ul << SYS_IPRSTC2_ADC_RST_Pos)
#define SYS_IPRSTC2_I2S_RST_Pos                           29
#define SYS_IPRSTC2_I2S_RST_Msk                           (0x01ul << SYS_IPRSTC2_I2S_RST_Pos)
// Bits 30-31 are Reserved.


/**
  * @brief System Manager Controller (SYS) - Register BODCR
  * 
  * @description Peripheral Brown-out Detector Control Register (BODCR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 66-68
  * 
  * Part of the BODCR control registers bits are initiated by the flash configuration and part of the
  * bits are write-protected. Programming write-protected bits needs to write "59h", "16h", "88h" to
  * address 0x5000_0100 to disable register protection.
  * Refer to the register REGWRPROT at address GCR_BA+0x100.
  * 
  * BODCR = GCR_BA+0x18
  * 
  * 
  * BOD_EN [0]
  * Brown-out Detector Enable (Write-protection Bit)
  * 
  * The default value is set by flash controller user configuration register config0 bit[23].
  * 
  * 1 = Brown-out Detector function Enabled.
  * 0 = Brown-out Detector function Disabled.
  * 
  * This bit is a protected bit.
  * 
  * 
  * BOD_VL [1:2]
  * Brown-out Detector Threshold Voltage Selection (Write-protection Bits)
  * 
  * The default value is set by flash controller user configuration register config0 bit[22:21]
  * 
  * BOV_VL[1]  | BOV_VL[0]  |  Brown-out Voltage
  * ===========|============|=====================
  *     1      |     1      |      4.5 V
  *     1      |     0      |      3.8 V
  *     0      |     1      |      2.7 V
  *     0      |     0      |      2.2 V
  * 
  * 
  * BOD_RSTEN [3]
  * Brown-out Reset Enable (Write-protection Bit)
  * 
  * 1 = Brown-out "RESET" function Enabled.
  *     While the Brown-out Detector function is enabled (BOD_EN high) and BOD reset
  *     function is enabled (BOD_RSTEN high), BOD will assert a signal to reset chip when
  *     the detected voltage is lower than the threshold (BOD_OUT high).
  * 0 = Brown-out "INTERRUPT" function Enabled.
  *     While the BOD function is enabled (BOD_EN high) and BOD interrupt function is
  *     enabled (BOD_RSTEN low), BOD will assert an interrupt if BOD_OUT is high. BOD
  *     interrupt will keep till to the BOD_EN set to 0. BOD interrupt can be blocked by
  *     disabling the NVIC BOD interrupt or disabling BOD function (set BOD_EN low).
  * 
  * The default value is set by flash controller user configuration register config0 bit[20].
  * 
  * 
  * BOD_INTF [4]
  * Brown-out Detector Interrupt Flag
  * 
  * 1 = When Brown-out Detector detects the VDD is dropped down through the voltage of
  *     BOD_VL setting or the VDD is raised up through the voltage of BOD_VL setting, this
  *     bit is set to 1 and the Brown-out interrupt is requested if Brown-out interrupt is enabled.
  * 0 = Brown-out Detector does not detect any voltage draft at VDD down through or up
  *     through the voltage of BOD_VL setting.
  * 
  * Software can write 1 to clear this bit to zero.
  * 
  * 
  * BOD_LPM [5]
  * Brown-out Detector Low power Mode (Write-protection Bit)
  * 
  * 1 = BOD low power mode Enabled.
  * 0 = BOD operated in Normal mode (Default).
  * 
  * The BOD consumes about 100 uA in Normal mode, the low power mode can reduce
  * the current to about 1/10 but will slow the BOD response.
  * 
  * 
  * BOD_OUT [6]
  * Brown-out Detector Output Status
  * 
  * 1 = Brown-out Detector output status is 1, which means the detected voltage is lower
  *     than BOD_VL setting. If the BOD_EN is 0, BOD function disabled , this bit always
  *     responds to 0
  * 0 = Brown-out Detector output status is 0, which means the detected voltage is higher
  *     than BOD_VL setting or BOD_EN is 0.
  * 
  * 
  * LVR_EN [7]
  * Low Voltage Reset Enable (Write-protection Bit)
  * 
  * The LVR function reset the chip when the input power voltage is lower than LVR circuit
  * setting. LVR function is enabled by default.
  * 
  * 1 = Low Voltage Reset function Enabled– After enabling the bit, the LVR function will
  *     be active with 100uS delay for LVR output stable (Default).
  * 0 = Low Voltage Reset function Disabled.
  * 
  * 
  */

