ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define SYS_BODCR_BOD_EN_Pos                              0
#define SYS_BODCR_BOD_EN_Msk                              (0x01ul << SYS_BODCR_BOD_EN_Pos)
#define SYS_BODCR_BOD_VL_Pos                              1
#define SYS_BODCR_BOD_VL_Msk                              (0x03ul << SYS_BODCR_BOD_VL_Pos)
#define SYS_BODCR_BOD_RSTEN_Pos                           3
#define SYS_BODCR_BOD_RSTEN_Msk                           (0x01ul << SYS_BODCR_BOD_RSTEN_Pos)
#define SYS_BODCR_BOD_INTF_Pos                            4
#define SYS_BODCR_BOD_INTF_Msk                            (0x01ul << SYS_BODCR_BOD_INTF_Pos)
#define SYS_BODCR_BOD_LPM_Pos                             5
#define SYS_BODCR_BOD_LPM_Msk                             (0x01ul << SYS_BODCR_BOD_LPM_Pos)
#define SYS_BODCR_BOD_OUT_Pos                             6
#define SYS_BODCR_BOD_OUT_Msk                             (0x01ul << SYS_BODCR_BOD_OUT_Pos)
#define SYS_BODCR_LVR_EN_Pos                              7
#define SYS_BODCR_LVR_EN_Msk                              (0x01ul << SYS_BODCR_LVR_EN_Pos)
// Bits 8-31 are Reserved.


/**
  * @brief System Manager Controller (SYS) - Register PORCR
  * 
  * @description Peripheral Power-On-Reset Control Register (PORCR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 69
  * 
  * PORCR = GCR_BA+0x24
  * 
  * POR_DIS_CODE [0:15]
  * This register is used for the Power-On-Reset enable control (Write-protection Bits)
  * 
  * When powered on, the POR circuit generates a reset signal to reset the whole chip
  * function, but noise on the power may cause the POR active again. User can disable
  * internal POR circuit to avoid unpredictable noise to cause chip reset by writing 0x5AA5
  * to this field.
  * 
  * The POR function will become active again when this field is set to another value or
  * chip is reset by other reset source, including:
  * /RESET, Watchdog, LVR reset, BOD reset, ICE reset command and the software-chip
  * reset function
  * 
  * This bit is a protected bit, which means programming it needs to write "59h", "16h",
  * "88h" to address 0x5000_0100 to disable register protection.
  * 
  * Refer to the register REGWRPROT at address GCR_BA+0x100.
  * 
  */

#define SYS_PORCR_POR_DIS_CODE_Pos                        0
#define SYS_PORCR_POR_DIS_CODE_Msk                        (0xFFFFul << SYS_PORCR_POR_DIS_CODE_Pos)
// Bits 16-31 are Reserved.


/**
  * @brief System Manager Controller (SYS) - Register GPA_MFP
  * 
  * @description Peripheral Multi Function Pin GPIOA Control Register (GPA_MFP) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 70-71
  * 
  * GPA_MFP GCR_BA+0x30
  * 
  */

#define SYS_GPA_MFP_GPA_MFP_Pos                           0
#define SYS_GPA_MFP_GPA_MFP_Msk                           (0xFFFFul << SYS_GPA_MFP_GPA_MFP_Pos)
#define SYS_GPA_MFP_GPA_TYPE_Pos                          16
#define SYS_GPA_MFP_GPA_TYPE_Msk                          (0xFFFFul << SYS_GPA_MFP_GPA_TYPE_Pos)

// Available Alternate Function Pins
#define GPA_MFP10                                         10
#define GPA_MFP11                                         11
#define GPA_MFP12                                         12
#define GPA_MFP13                                         13
#define GPA_MFP14                                         14
#define GPA_MFP15                                         15


/**
  * @brief System Manager Controller (SYS) - Register GPB_MFP
  * 
  * @description Peripheral Multi Function Pin GPIOB Control Register (GPB_MFP) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 72-75
  * 
  * GPB_MFP GCR_BA+0x34
  * 
  */

#define SYS_GPB_MFP_GPB_MFP_Pos                           0
#define SYS_GPB_MFP_GPB_MFP_Msk                           (0xFFFFul << SYS_GPB_MFP_GPB_MFP_Pos)
#define SYS_GPB_MFP_GPB_TYPE_Pos                          16
#define SYS_GPB_MFP_GPB_TYPE_Msk                          (0xFFFFul << SYS_GPB_MFP_GPB_TYPE_Pos)

// Available Alternate Function Pins
#define GPB_MFP0                                          0
#define GPB_MFP1                                          1
#define GPB_MFP2                                          2
#define GPB_MFP3                                          3
#define GPB_MFP4                                          4
#define GPB_MFP5                                          5
#define GPB_MFP6                                          6
#define GPB_MFP7                                          7
#define GPB_MFP8                                          8
#define GPB_MFP9                                          9
#define GPB_MFP10                                         10
#define GPB_MFP12                                         12
#define GPB_MFP13                                         13
#define GPB_MFP14                                         14
#define GPB_MFP15                                         15


/**
  * @brief System Manager Controller (SYS) - Register GPC_MFP
  * 
  * @description Peripheral Multi Function Pin GPIOC Control Register (GPC_MFP) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 76-78
  * 
  * GPC_MFP GCR_BA+0x38
  * 
  */

#define SYS_GPC_MFP_GPC_MFP_Pos                           0
#define SYS_GPC_MFP_GPC_MFP_Msk                           (0xFFFFul << SYS_GPC_MFP_GPC_MFP_Pos)
#define SYS_GPC_MFP_GPC_TYPE_Pos                          16
#define SYS_GPC_MFP_GPC_TYPE_Msk                          (0xFFFFul << SYS_GPC_MFP_GPC_TYPE_Pos)

// Available Alternate Function Pins
#define GPC_MFP0                                          0
#define GPC_MFP1                                          1
#define GPC_MFP2                                          2
#define GPC_MFP3                                          3
#define GPC_MFP4                                          4
#define GPC_MFP5                                          5
#define GPC_MFP8                                          8
#define GPC_MFP9                                          9
#define GPC_MFP10                                         10
#define GPC_MFP11                                         11
#define GPC_MFP12                                         12
#define GPC_MFP13                                         13


/**
  * @brief System Manager Controller (SYS) - Register GPD_MFP
  * 
  * @description Peripheral Multi Function Pin GPIOD Control Register (GPD_MFP) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 79-81
  * 
  * GPD_MFP GCR_BA+0x3C
  * 
  */

#define SYS_GPD_MFP_GPD_MFP_Pos                           0
#define SYS_GPD_MFP_GPD_MFP_Msk                           (0xFFFFul << SYS_GPD_MFP_GPD_MFP_Pos)
#define SYS_GPD_MFP_GPD_TYPE_Pos                          16
#define SYS_GPD_MFP_GPD_TYPE_Msk                          (0xFFFFul << SYS_GPD_MFP_GPD_TYPE_Pos)

