ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
// Available Alternate Function Pins
#define GPD_MFP0                                          0
#define GPD_MFP1                                          1
#define GPD_MFP2                                          2
#define GPD_MFP3                                          3
#define GPD_MFP4                                          4
#define GPD_MFP5                                          5
#define GPD_MFP8                                          8
#define GPD_MFP9                                          9
#define GPD_MFP10                                         10
#define GPD_MFP11                                         11


/**
  * @brief System Manager Controller (SYS) - Register GPF_MFP
  * 
  * @description Peripheral Multi Function Pin GPIOF Control Register (GPF_MFP) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 82-83
  * 
  * GPF_MFP GCR_BA+0x44
  * 
  */

#define SYS_GPF_MFP_GPF_MFP0_Pos                          0
#define SYS_GPF_MFP_GPF_MFP0_Msk                          (0x01ul << SYS_GPF_MFP_GPF_MFP0_Pos)
#define SYS_GPF_MFP_GPF_MFP1_Pos                          1
#define SYS_GPF_MFP_GPF_MFP1_Msk                          (0x01ul << SYS_GPF_MFP_GPF_MFP1_Pos)
#define SYS_GPF_MFP_GPF_MFP2_Pos                          2
#define SYS_GPF_MFP_GPF_MFP2_Msk                          (0x01ul << SYS_GPF_MFP_GPF_MFP2_Pos)
#define SYS_GPF_MFP_GPF_MFP3_Pos                          3
#define SYS_GPF_MFP_GPF_MFP3_Msk                          (0x01ul << SYS_GPF_MFP_GPF_MFP3_Pos)
// Bits 4 to 15 are Reserved.
#define SYS_GPF_MFP_GPF_TYPE_Pos                          16
#define SYS_GPF_MFP_GPF_TYPE_Msk                          (0xFul << SYS_GPF_MFP_GPF_TYPE_Pos)
// Bits 20 to 31 are Reserved.

// Available Alternate Function Pins
#define GPF_MFP0                                          0
#define GPF_MFP1                                          1
#define GPF_MFP2                                          2
#define GPF_MFP3                                          3


/**
  * @brief System Manager Controller (SYS) - Register ALT_MFP
  * 
  * @description Peripheral Alternate Multi Function Pin Control Register (ALT_MFP) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 84-89
  * 
  * ALT_MFP GCR_BA+0x50
  * 
  */

#define SYS_ALT_MFP_PB10_MFP1_Pos                         0
#define SYS_ALT_MFP_PB10_MFP1_Msk                         (0x01ul << SYS_ALT_MFP_PB10_MFP1_Pos)
#define SYS_ALT_MFP_PB9_MFP1_Pos                          1
#define SYS_ALT_MFP_PB9_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PB9_MFP1_Pos)
// Bits 2-4 are Reserved.
#define SYS_ALT_MFP_PC0_MFP1_Pos                          5
#define SYS_ALT_MFP_PC0_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PC0_MFP1_Pos)
#define SYS_ALT_MFP_PC1_MFP1_Pos                          6
#define SYS_ALT_MFP_PC1_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PC1_MFP1_Pos)
#define SYS_ALT_MFP_PC2_MFP1_Pos                          7
#define SYS_ALT_MFP_PC2_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PC2_MFP1_Pos)
#define SYS_ALT_MFP_PC3_MFP1_Pos                          8
#define SYS_ALT_MFP_PC3_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PC3_MFP1_Pos)
#define SYS_ALT_MFP_PA15_MFP1_Pos                         9
#define SYS_ALT_MFP_PA15_MFP1_Msk                         (0x01ul << SYS_ALT_MFP_PA15_MFP1_Pos)
#define SYS_ALT_MFP_PB12_MFP1_Pos                         10
#define SYS_ALT_MFP_PB12_MFP1_Msk                         (0x01ul << SYS_ALT_MFP_PB12_MFP1_Pos)
#define SYS_ALT_MFP_PA11_MFP1_Pos                         11
#define SYS_ALT_MFP_PA11_MFP1_Msk                         (0x01ul << SYS_ALT_MFP_PA11_MFP1_Pos)
#define SYS_ALT_MFP_PA10_MFP1_Pos                         12
#define SYS_ALT_MFP_PA10_MFP1_Msk                         (0x01ul << SYS_ALT_MFP_PA10_MFP1_Pos)
// Bits 13-14 are Reserved.
#define SYS_ALT_MFP_PB4_MFP1_Pos                          15
#define SYS_ALT_MFP_PB4_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PB4_MFP1_Pos)
#define SYS_ALT_MFP_PB7_MFP1_Pos                          16
#define SYS_ALT_MFP_PB7_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PB7_MFP1_Pos)
#define SYS_ALT_MFP_PB6_MFP1_Pos                          17
#define SYS_ALT_MFP_PB6_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PB6_MFP1_Pos)
#define SYS_ALT_MFP_PB5_MFP1_Pos                          18
#define SYS_ALT_MFP_PB5_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PB5_MFP1_Pos)
// Bit 19 is Reserved.
#define SYS_ALT_MFP_PC12_MFP1_Pos                         20
#define SYS_ALT_MFP_PC12_MFP1_Msk                         (0x01ul << SYS_ALT_MFP_PC12_MFP1_Pos)
#define SYS_ALT_MFP_PC13_MFP1_Pos                         21
#define SYS_ALT_MFP_PC13_MFP1_Msk                         (0x01ul << SYS_ALT_MFP_PC13_MFP1_Pos)
// Bits 22-23 are Reserved.
#define SYS_ALT_MFP_PB15_MFP1_Pos                         24
#define SYS_ALT_MFP_PB15_MFP1_Msk                         (0x01ul << SYS_ALT_MFP_PB15_MFP1_Pos)
// Bit 25 is Reserved.
#define SYS_ALT_MFP_PB2_MFP1_Pos                          26
#define SYS_ALT_MFP_PB2_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PB2_MFP1_Pos)
#define SYS_ALT_MFP_PB3_MFP1_Pos                          27
#define SYS_ALT_MFP_PB3_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PB3_MFP1_Pos)
// Bit 28 is Reserved.
#define SYS_ALT_MFP_PC4_MFP1_Pos                          29
#define SYS_ALT_MFP_PC4_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PC4_MFP1_Pos)
#define SYS_ALT_MFP_PC5_MFP1_Pos                          30
#define SYS_ALT_MFP_PC5_MFP1_Msk                          (0x01ul << SYS_ALT_MFP_PC5_MFP1_Pos)
// Bit 31 is Reserved.


/**
  * @brief System Manager Controller (SYS) - Register ALT_MFP1
  * 
  * @description Peripheral Alternate Multi Function Pin Control Register1 (ALT_MFP) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 90-92
  * 
  * ALT_MFP1 GCR_BA+0x54
  * 
  */

// Bits 0-15 are Reserved.
#define SYS_ALT_MFP1_PD0_MFP1_Pos                         16
#define SYS_ALT_MFP1_PD0_MFP1_Msk                         (0x01ul << SYS_ALT_MFP1_PD0_MFP1_Pos)
#define SYS_ALT_MFP1_PD1_MFP1_Pos                         17
#define SYS_ALT_MFP1_PD1_MFP1_Msk                         (0x01ul << SYS_ALT_MFP1_PD1_MFP1_Pos)
#define SYS_ALT_MFP1_PD2_MFP1_Pos                         18
#define SYS_ALT_MFP1_PD2_MFP1_Msk                         (0x01ul << SYS_ALT_MFP1_PD2_MFP1_Pos)
#define SYS_ALT_MFP1_PD3_MFP1_Pos                         19
#define SYS_ALT_MFP1_PD3_MFP1_Msk                         (0x01ul << SYS_ALT_MFP1_PD3_MFP1_Pos)
#define SYS_ALT_MFP1_PD4_MFP1_Pos                         20
#define SYS_ALT_MFP1_PD4_MFP1_Msk                         (0x01ul << SYS_ALT_MFP1_PD4_MFP1_Pos)
#define SYS_ALT_MFP1_PD5_MFP1_Pos                         21
#define SYS_ALT_MFP1_PD5_MFP1_Msk                         (0x01ul << SYS_ALT_MFP1_PD5_MFP1_Pos)
// Bit 22 is Reserved.
#define SYS_ALT_MFP1_PC8_MFP1_Pos                         23
#define SYS_ALT_MFP1_PC8_MFP1_Msk                         (0x01ul << SYS_ALT_MFP1_PC8_MFP1_Pos)
#define SYS_ALT_MFP1_PF2_MFP1_Pos                         24
#define SYS_ALT_MFP1_PF2_MFP1_Msk                         (0x03ul << SYS_ALT_MFP1_PF2_MFP1_Pos)
// Bit 25 is Reserved.
#define SYS_ALT_MFP1_PF3_MFP1_Pos                         26
#define SYS_ALT_MFP1_PF3_MFP1_Msk                         (0x03ul << SYS_ALT_MFP1_PF3_MFP1_Pos)
// Bits 27-31 are Reserved.


/**
  * @brief System Manager Controller (SYS) - Register DFP_CSR
  * 
  * @description Peripheral Dynamic Function Pin Conflict Status Register (DFP_CSR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 93-94
  * 
  * DFP_CSR GCR_BA+0xA0
  * 
  * 
  * DFP0_CST [0]
  * Conflict Status of PD.9
  * 
  * 1 = PD.9 is conflicted.
  * 0 = PD.9 worked normally.
  * 
  * DFP1_CST [1]
  * Conflict Status of PD.10
  * 
  * 1 = PD.10 is conflicted.
  * 0 = PD.10 worked normally.
  * 
  * DFP2_CST [2]
  * Conflict Status of PD.11
  * 
  * 1 = PD.11 is conflicted.
  * 0 = PD.11 worked normally.
  * 
  * DFP3_CST [3]
  * Conflict Status of PB.4
  * 
  * 1 = PB.4 is conflicted.
  * 0 = PB.4 worked normally.
  * 
  * DFP4_CST [4]
  * Conflict Status of PB.5
  * 
  * 1 = PB.5 is conflicted.
  * 0 = PB.5 worked normally.
  * 
  * DFP5_CST [5]
  * Conflict Status of PB.6
  * 
  * 1 = PB.6 is conflicted.
  * 0 = PB.6 worked normally.
  * 
  * DFP6_CST [6]
  * Conflict Status of PB.7
  * 
  * 1 = PB.7 is conflicted.
  * 0 = PB.7 worked normally.
  * 
  */

#define SYS_DFP_CSR_DFP0_CST_Pos                          0
#define SYS_DFP_CSR_DFP0_CST_Msk                          (0x01ul << SYS_DFP_CSR_DFP0_CST_Pos)
#define SYS_DFP_CSR_DFP1_CST_Pos                          1
#define SYS_DFP_CSR_DFP1_CST_Msk                          (0x01ul << SYS_DFP_CSR_DFP1_CST_Pos)
#define SYS_DFP_CSR_DFP2_CST_Pos                          2
#define SYS_DFP_CSR_DFP2_CST_Msk                          (0x01ul << SYS_DFP_CSR_DFP2_CST_Pos)
#define SYS_DFP_CSR_DFP3_CST_Pos                          3
#define SYS_DFP_CSR_DFP3_CST_Msk                          (0x01ul << SYS_DFP_CSR_DFP3_CST_Pos)
#define SYS_DFP_CSR_DFP4_CST_Pos                          4
#define SYS_DFP_CSR_DFP4_CST_Msk                          (0x01ul << SYS_DFP_CSR_DFP4_CST_Pos)
#define SYS_DFP_CSR_DFP5_CST_Pos                          5
#define SYS_DFP_CSR_DFP5_CST_Msk                          (0x01ul << SYS_DFP_CSR_DFP5_CST_Pos)
#define SYS_DFP_CSR_DFP6_CST_Pos                          6
#define SYS_DFP_CSR_DFP6_CST_Msk                          (0x01ul << SYS_DFP_CSR_DFP6_CST_Pos)
// Bits 7-31 are Reserved.


/**
  * @brief System Manager Controller (SYS) - Register GPA_IOCR
  * 
  * @description Peripheral GPIOA IO Control Register (GPA_IOCR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 95
  * 
  * GPA_IOCR GCR_BA+0xC0
  * 
  * 
  * GPA10_DS [10]
  * PA.10 Pin Driving Strength Selection
  * 
  * 1 = PA.10 strong driving strength mode Enabled.
  * 0 = PA.10 strong driving strength mode Disabled.
  * 
  * GPA11_DS [11]
  * PA.11 Pin Driving Strength Selection
  * 
  * 1 = PA.11 strong driving strength mode Enabled.
  * 0 = PA.11 strong driving strength mode Disabled.
  * 
  */

