ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
// Bits 0-9 are Reserved.
#define SYS_GPA_IOCR_GPA10_DS_Pos                         10
#define SYS_GPA_IOCR_GPA10_DS_Msk                         (0x01ul << SYS_GPA_IOCR_GPA10_DS_Pos)
#define SYS_GPA_IOCR_GPA11_DS_Pos                         11
#define SYS_GPA_IOCR_GPA11_DS_Msk                         (0x01ul << SYS_GPA_IOCR_GPA11_DS_Pos)
// Bits 12-31 are Reserved.


/**
  * @brief System Manager Controller (SYS) - Register GPB_IOCR
  * 
  * @description Peripheral GPIOB IO Control Register (GPB_IOCR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 96-97
  * 
  * GPB_IOCR GCR_BA+0xC4
  * 
  * 
  * GPB4_DS [4]
  * PB.4 Pin Driving Strength Selection
  * 
  * 1 = PB.4 strong driving strength mode Enabled.
  * 0 = PB.4 strong driving strength mode Disabled.
  * 
  * GPB5_DS [5]
  * PB.5 Pin Driving Strength Selection
  * 
  * 1 = PB.5 strong driving strength mode Enabled.
  * 0 = PB.5 strong driving strength mode Disabled.
  * 
  * GPB6_DS [6]
  * PB.6 Pin Driving Strength Selection
  * 
  * 1 = PB.6 strong driving strength mode Enabled.
  * 0 = PB.6 strong driving strength mode Disabled.
  * 
  * GPB7_DS [7]
  * PB.7 Pin Driving Strength Selection
  * 
  * 1 = PB.7 strong driving strength mode Enabled.
  * 0 = PB.7 strong driving strength mode Disabled.
  * 
  * GPB8_DS [8]
  * PB.8 Pin Driving Strength Selection
  * 
  * 1 = PB.8 strong driving strength mode Enabled.
  * 0 = PB.8 strong driving strength mode Disabled.
  * 
  * GPB12_DS [12]
  * PB.12 Pin Driving Strength Selection
  * 
  * 1 = PB.12 strong driving strength mode Enabled.
  * 0 = PB.12 strong driving strength mode Disabled.
  * 
  * GPB13_DS [13]
  * PB.13 Pin Driving Strength Selection
  * 
  * 1 = PB.13 strong driving strength mode Enabled.
  * 0 = PB.13 strong driving strength mode Disabled.
  * 
  * GPB14_DS [14]
  * PB.14 Pin Driving Strength Selection
  * 
  * 1 = PB.14 strong driving strength mode Enabled.
  * 0 = PB.14 strong driving strength mode Disabled.
  * 
  */

// Bits 0-3 are Reserved.
#define SYS_GPB_IOCR_GPB4_DS_Pos                          4
#define SYS_GPB_IOCR_GPB4_DS_Msk                          (0x01ul << SYS_GPB_IOCR_GPB4_DS_Pos)
#define SYS_GPB_IOCR_GPB5_DS_Pos                          5
#define SYS_GPB_IOCR_GPB5_DS_Msk                          (0x01ul << SYS_GPB_IOCR_GPB5_DS_Pos)
#define SYS_GPB_IOCR_GPB6_DS_Pos                          6
#define SYS_GPB_IOCR_GPB6_DS_Msk                          (0x01ul << SYS_GPB_IOCR_GPB6_DS_Pos)
#define SYS_GPB_IOCR_GPB7_DS_Pos                          7
#define SYS_GPB_IOCR_GPB7_DS_Msk                          (0x01ul << SYS_GPB_IOCR_GPB7_DS_Pos)
#define SYS_GPB_IOCR_GPB8_DS_Pos                          8
#define SYS_GPB_IOCR_GPB8_DS_Msk                          (0x01ul << SYS_GPB_IOCR_GPB8_DS_Pos)
// Bits 9-11 are Reserved.
#define SYS_GPB_IOCR_GPB12_DS_Pos                         12
#define SYS_GPB_IOCR_GPB12_DS_Msk                         (0x01ul << SYS_GPB_IOCR_GPB12_DS_Pos)
#define SYS_GPB_IOCR_GPB13_DS_Pos                         13
#define SYS_GPB_IOCR_GPB13_DS_Msk                         (0x01ul << SYS_GPB_IOCR_GPB13_DS_Pos)
#define SYS_GPB_IOCR_GPB14_DS_Pos                         14
#define SYS_GPB_IOCR_GPB14_DS_Msk                         (0x01ul << SYS_GPB_IOCR_GPB14_DS_Pos)
// Bits 15-31 are Reserved.


/**
  * @brief System Manager Controller (SYS) - Register GPD_IOCR
  * 
  * @description Peripheral GPIOD IO Control Register (GPD_IOCR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 98
  * 
  * GPD_IOCR GCR_BA+0xCC
  * 
  * 
  * GPD8_DS [8]
  * PD.8 Pin Driving Strength Selection
  * 
  * 1 = PD.8 strong driving strength mode Enabled.
  * 0 = PD.8 strong driving strength mode Disabled.
  * 
  * GPD9_DS [9]
  * PD.9 Pin Driving Strength Selection
  * 
  * 1 = PD.9 strong driving strength mode Enabled.
  * 0 = PD.9 strong driving strength mode Disabled.
  * 
  * GPD10_DS [10]
  * PD.10 Pin Driving Strength Selection
  * 
  * 1 = PD.10 strong driving strength mode Enabled.
  * 0 = PD.10 strong driving strength mode Disabled.
  * 
  * GPD11_DS [11]
  * PD.11 Pin Driving Strength Selection
  * 
  * 1 = PD.11 strong driving strength mode Enabled.
  * 0 = PD.11 strong driving strength mode Disabled.
  * 
  */

// Bits 0-7 are Reserved.
#define SYS_GPD_IOCR_GPD8_DS_Pos                          8
#define SYS_GPD_IOCR_GPD8_DS_Msk                          (0x01ul << SYS_GPD_IOCR_GPD8_DS_Pos)
#define SYS_GPD_IOCR_GPD9_DS_Pos                          9
#define SYS_GPD_IOCR_GPD9_DS_Msk                          (0x01ul << SYS_GPD_IOCR_GPD9_DS_Pos)
#define SYS_GPD_IOCR_GPD10_DS_Pos                         10
#define SYS_GPD_IOCR_GPD10_DS_Msk                         (0x01ul << SYS_GPD_IOCR_GPD10_DS_Pos)
#define SYS_GPD_IOCR_GPD11_DS_Pos                         11
#define SYS_GPD_IOCR_GPD11_DS_Msk                         (0x01ul << SYS_GPD_IOCR_GPD11_DS_Pos)
// Bits 12-31 are Reserved.


/**
  * @brief System Manager Controller (SYS) - Register REGWRPROT
  * 
  * @description Register Write-Protection Control Register (REGWRPROT) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.3.4 Register Description, page 99
  * 
  * REGWRPROT GCR_BA+0x100
  * 
  * Some of the system control registers need to be protected to avoid inadvertent write and disturb
  * the chip operation. These system control registers are protected after the power-on reset till user
  * to disable register protection. For user to program these protected registers, a register protection
  * disable sequence needs to be followed by a special programming. The register protection disable
  * sequence is writing the data "59h", "16h" "88h" to the register REGWRPROT address at
  * 0x5000_0100 continuously. Any different data value, different sequence or any other write to
  * other address during these three data writing will abort the whole sequence.
  * 
  * After the protection is disabled, user can check the protection disable bit at address 0x5000_0100
  * bit0, 1 is protection disable, and 0 is protection enable. Then user can update the target protected
  * register value and then write any data to the address "0x5000_0100" to enable register protection.
  * 
  * This register is write for disable/enable register protection and read for the REGPROTDIS status
  * 
  * 
  * REGPROTDIS [0]
  * Register Write-Protection Disable index (Read Only)
  * 
  * 1 = Write-protection Disabled for writing protected registers.
  * 0 = Write-protection Enabled for writing protected registers. Any write to the protected
  *     register is ignored.
  * 
  * The Protected registers are:
  *     IPRSTC1: address 0x5000_0008
  *     BODCR: address 0x5000_0018
  *     PORCR: address 0x5000_0024
  *     PWRCON: address 0x5000_0200 (bit[6] is not protected for power wake-up interrupt clear)
  *     APBCLK bit[0]: address 0x5000_0208 (bit[0] is watchdog clock enabled)
  *     CLKSEL0: address 0x5000_0210 (for HCLK and CPU STCLK clock source select)
  *     CLKSEL1 bit[1:0]: address 0x5000_0214 (for watchdog clock source select)
  *     ISPCON: address 0x5000_C000 (Flash ISP Control register)
  *     WTCR: address 0x4000_4000
  *     FATCON: address 0x5000_C018
  * 
  * 
  * REGWRPROT [0:7]
  * Register Write-Protection Code (Write Only)
  * 
  * Some registers have write-protection function. Writing these registers has to disable
  * the protected function by writing the sequence value "59h", "16h", "88h" to this field.
  * After this sequence is completed, the REGPROTDIS bit will be set to 1 and write-
  * protection registers can be normal write.
  * 
  */

#define SYS_REGWRPROT_REGPROTDIS_Pos                      0
#define SYS_REGWRPROT_REGPROTDIS_Msk                      (0x01ul << SYS_REGWRPROT_REGPROTDIS_Pos)
#define SYS_REGWRPROT_REGWRPROT_Pos                       0
#define SYS_REGWRPROT_REGWRPROT_Msk                       (0xFFul << SYS_REGWRPROT_REGWRPROT_Pos)
// Bits 8-31 are Reserved.


/* =========================================================================================================================== */
/* ================                                     USBD Controller                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief USBD Controller (USBD)
  * 
  * @description See NUC123 Technical Reference Manual 5.6.5 Register Map, page 158-160
  * 
  * USB_BA = 0x4006_0000
  * 
  * 
  * There are large swathes of registers included in the NUC123 Technical Reference Manual
  * that are NOT NEEDED by this implementation - so are not included in this header. They
  * are marked in this struct as RESERVED sections - to allow for future updates as needed.
  * 
  * The main USBD_T struct contains a set of EndPoint structs (USBD_EP_T) - maximum of 8
  * for the NUC123SD4AN0 MCU.
  * 
  * USBD EndPoint Registers [EndPoint 0~7]
  * 
  * EP0 Registers = USB_BA+0x500
  * EP1 Registers = USB_BA+0x510
  * EP2 Registers = USB_BA+0x520
  * EP3 Registers = USB_BA+0x530
  * EP4 Registers = USB_BA+0x540
  * EP5 Registers = USB_BA+0x550
  * EP6 Registers = USB_BA+0x560
  * EP7 Registers = USB_BA+0x570
  * 
  * 
  * SRAM = USB_BA+0x100 -> USB_BA+0x2FF [512 Bytes]
  * 
  * The SRAM is used for the endpoints buffers for all 8 endpoints.
  * 
  * Refer to section 5.4.4.7 for the endpoint SRAM structure and its description.
  * 
  */

