ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
typedef struct {

    __IO uint32_t BUFSEG;                  // Endpoint 0~7 Buffer Segmentation Register
    __IO uint32_t MXPLD;                   // Endpoint 0~7 Maximal Payload Register
    __IO uint32_t CFG;                     // Endpoint 0~7 Configuration Register
    __IO uint32_t CFGP;                    // Endpoint 0~7 Set Stall and Clear In/Out Ready Control Register

} USBD_EP_T;

typedef struct {

    __IO uint32_t INTEN;                   // USB_BA + 0x00  USB Interrupt Enable Register
    __IO uint32_t INTSTS;                  // USB_BA + 0x04  USB Interrupt Event Status Register
    __IO uint32_t FADDR;                   // USB_BA + 0x08  USB Device Function Address Register
    __I  uint32_t EPSTS;                   // USB_BA + 0x0C  USB Endpoint Status Register
    __IO uint32_t ATTR;                    // USB_BA + 0x10  USB Bus Status and Attribution Register
    __I  uint32_t FLDET;                   // USB_BA + 0x14  USB Floating Detection Register
    __IO uint32_t STBUFSEG;                // USB_BA + 0x18  Setup Token Buffer Segmentation Register
    __I  uint32_t RESERVED0[29]; 
    __IO uint32_t DRVSE0;                  // USB_BA + 0x90  USB Drive SE0 Control Register
    __I  uint32_t RESERVED2[283];
        USBD_EP_T EP[8];                   // USB_BA + 0x500 Endpoint 0~7 Control Registers

} USBD_T;


/**
  * @brief USB Device Controller (USBD) - Register USBD_INTEN
  * 
  * @description USB Interrupt Enable Register (USBD_INTEN) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 161-162
  * 
  * USBD_INTEN = USB_BA+0x000
  * 
  * 
  * BUS_IE [0]
  * Bus Event Interrupt Enable
  * 
  * 1 = BUS event interrupt Enabled.
  * 0 = BUS event interrupt Disabled.
  * 
  * 
  * USB_IE [1]
  * USB Event Interrupt Enable
  * 
  * 1 = USB event interrupt Enabled.
  * 0 = USB event interrupt Disabled.
  * 
  * 
  * FLDET_IE [2]
  * Floating Detected Interrupt Enable
  * 
  * 1 = Floating detect Interrupt Enabled.
  * 0 = Floating detect Interrupt Disabled.
  * 
  * 
  * WAKEUP_IE [3]
  * USB Wake-up Interrupt Enable
  * 
  * 1 = Wake-up Interrupt Enabled.
  * 0 = Wake-up Interrupt Disabled.
  * 
  * 
  * WAKEUP_EN [8]
  * Wake-up Function Enable
  * 
  * 1 = USB wake-up function Enabled.
  * 0 = USB wake-up function Disabled.
  * 
  * 
  * INNAK_EN [15]
  * Active NAK Function and its Status in IN Token
  * 
  * 1 = NAK status is updated into the endpoint status register, USB_EPSTS, when it is
  *     set to 1 and there is NAK response in IN token. It also enables the interrupt event
  *     when the device responds NAK after receiving IN token
  * 0 = NAK status wasn‟t updated into the endpoint status register when it was set to 0.
  *     It also disables the interrupt event when device responds NAK after receiving IN
  *     token
  * 
  * 
  */

#define USBD_INTEN_BUS_IE_Pos                             0
#define USBD_INTEN_BUS_IE_Msk                             (0x01ul << USBD_INTEN_BUS_IE_Pos)
#define USBD_INTEN_USB_IE_Pos                             1
#define USBD_INTEN_USB_IE_Msk                             (0x01ul << USBD_INTEN_USB_IE_Pos)
#define USBD_INTEN_FLDET_IE_Pos                           2
#define USBD_INTEN_FLDET_IE_Msk                           (0x01ul << USBD_INTEN_FLDET_IE_Pos)
#define USBD_INTEN_WAKEUP_IE_Pos                          3
#define USBD_INTEN_WAKEUP_IE_Msk                          (0x01ul << USBD_INTEN_WAKEUP_IE_Pos)
// Bits 4-7 are Reserved.
#define USBD_INTEN_WAKEUP_EN_Pos                          8
#define USBD_INTEN_WAKEUP_EN_Msk                          (0x01ul << USBD_INTEN_WAKEUP_EN_Pos)
// Bits 9-14 are Reserved.
#define USBD_INTEN_INNAK_EN_Pos                           15
#define USBD_INTEN_INNAK_EN_Msk                           (0x01ul << USBD_INTEN_INNAK_EN_Pos)
// Bits 16-31 are Reserved.


/**
  * @brief USB Device Controller (USBD) - Register USBD_INTSTS
  * 
  * @description USB Interrupt Event Status Register (USBD_INTSTS) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 163-165
  * 
  * USBD_INTSTS = USB_BA+0x004
  * 
  * 
  * BUS_STS [0]
  * BUS Interrupt Status
  * 
  * The BUS event means that there is one of the suspense or the resume function in the bus.
  * 
  * 1 = Bus event occurred.
  *     Check USBD_ATTR[3:0] to know which kind of bus event has occurred.
  *     Clear event by writing 1 to USBD_INTSTS[0].
  * 0 = No BUS event occurred.
  * 
  * 
  * USB_STS [1]
  * USB event Interrupt Status
  * 
  * The USB event includes the Setup Token, IN Token, OUT ACK, ISO IN, or ISO OUT
  * events in the bus.
  * 
  * 1 = USB event occurred
  *     Check EPSTS0~7[2:0] to know which kind of USB event has occured.
  *     Clear event by writing 1 to USBD_INTSTS[1] or EPSTS0~7 and SETUP (USBD_INTSTS[31])
  * 0 = No USB event occurred.
  * 
  * 
  * FLDET_STS [2]
  * Floating Detected Interrupt Status
  * 
  * 1 = There is attached/detached event in the USB bus.
  *     Cleared by writing 1 to USBD_INTSTS[2].
  * 0 = There is not attached/detached event in the USB.
  * 
  * 
  * WAKEUP_STS [3]
  * Wake-up Interrupt Status
  * 
  * 1 = Wake-up event occurred, cleared by writing 1 to USBD_INTSTS[3]
  * 0 = No Wake-up event occurred.
  * 
  * 
  * EPEVT0 [16]
  * Endpoint 0's USB Event Status
  * 
  * 1 = USB event occurred on Endpoint 0, check USBD_EPSTS[10:8] to know which kind
  *     of USB event has occurred.
  *     Cleared by writing 1 to USBD_INTSTS[16] or USBD_INTSTS[1]
  * 0 = No event occurred on Endpoint 0.
  * 
  * 
  * EPEVT1 [17]
  * Endpoint 1's USB Event Status
  * 
  * 1 = USB event occurred on Endpoint 1, check USBD_EPSTS[13:11] to know which kind
  *     of USB event has occurred.
  *     Cleared by writing 1 to USBD_INTSTS[17] or USBD_INTSTS[1]
  * 0 = No event occurred on Endpoint 1.
  * 
  * 
  * EPEVT2 [18]
  * Endpoint 2's USB Event Status
  * 
  * 1 = USB event occurred on Endpoint 2, check USBD_EPSTS[14:16] to know which kind
  *     of USB event has occurred.
  *     Cleared by writing 1 to USBD_INTSTS[18] or USBD_INTSTS[1]
  * 0 = No event occurred on Endpoint 2.
  * 
  * 
  * EPEVT3 [19]
  * Endpoint 3's USB Event Status
  * 
  * 1 = USB event occurred on Endpoint 3, check USBD_EPSTS[17:19] to know which kind
  *     of USB event has occurred.
  *     Cleared by writing 1 to USBD_INTSTS[19] or USBD_INTSTS[1]
  * 0 = No event occurred on Endpoint 3.
  * 
  * 
  * EPEVT4 [20]
  * Endpoint 4's USB Event Status
  * 
  * 1 = USB event occurred on Endpoint 4, check USBD_EPSTS[20:22] to know which kind
  *     of USB event has occurred.
  *     Cleared by writing 1 to USBD_INTSTS[20] or USBD_INTSTS[1]
  * 0 = No event occurred on Endpoint 4.
  * 
  * 
  * EPEVT5 [21]
  * Endpoint 5's USB Event Status
  * 
  * 1 = USB event occurred on Endpoint 5, check USBD_EPSTS[23:25] to know which kind
  *     of USB event has occurred.
  *     Cleared by writing 1 to USBD_INTSTS[21] or USBD_INTSTS[1]
  * 0 = No event occurred on Endpoint 5.
  * 
  * 
  * EPEVT6 [22]
  * Endpoint 6's USB Event Status
  * 
  * 1 = USB event occurred on Endpoint 6, check USBD_EPSTS[26:28] to know which kind
  *     of USB event has occurred.
  *     Cleared by writing 1 to USBD_INTSTS[22] or USBD_INTSTS[1]
  * 0 = No event occurred on Endpoint 6.
  * 
  * 
  * EPEVT7 [23]
  * Endpoint 7's USB Event Status
  * 
  * 1 = USB event occurred on Endpoint 7, check USBD_EPSTS[29:31] to know which kind
  *     of USB event has occurred.
  *     Cleared by writing 1 to USBD_INTSTS[23] or USBD_INTSTS[1]
  * 0 = No event occurred on Endpoint 7.
  * 
  * 
  * SETUP [31]
  * Setup Event Status
  * 
  * 1 = Setup event occurred. Cleared by writing 1 to USBD_INTSTS[31].
  * 0 = No Setup event.
  * 
  */

#define USBD_INTSTS_BUS_STS_Pos                           0
#define USBD_INTSTS_BUS_STS_Msk                           (0x01ul << USBD_INTSTS_BUS_STS_Pos)
#define USBD_INTSTS_USB_STS_Pos                           1
#define USBD_INTSTS_USB_STS_Msk                           (0x01ul << USBD_INTSTS_USB_STS_Pos)
#define USBD_INTSTS_FLDET_STS_Pos                         2
#define USBD_INTSTS_FLDET_STS_Msk                         (0x01ul << USBD_INTSTS_FLDET_STS_Pos)
#define USBD_INTSTS_WAKEUP_STS_Pos                        3
#define USBD_INTSTS_WAKEUP_STS_Msk                        (0x01ul << USBD_INTSTS_WAKEUP_STS_Pos)
// Bits 4-15 are Reserved.
#define USBD_INTSTS_EPEVT0_Pos                            16
#define USBD_INTSTS_EPEVT0_Msk                            (0x1ul << USBD_INTSTS_EPEVT0_Pos)
#define USBD_INTSTS_EPEVT1_Pos                            17
#define USBD_INTSTS_EPEVT1_Msk                            (0x1ul << USBD_INTSTS_EPEVT1_Pos)
#define USBD_INTSTS_EPEVT2_Pos                            18
#define USBD_INTSTS_EPEVT2_Msk                            (0x1ul << USBD_INTSTS_EPEVT2_Pos)
#define USBD_INTSTS_EPEVT3_Pos                            19
#define USBD_INTSTS_EPEVT3_Msk                            (0x1ul << USBD_INTSTS_EPEVT3_Pos)
#define USBD_INTSTS_EPEVT4_Pos                            20
#define USBD_INTSTS_EPEVT4_Msk                            (0x1ul << USBD_INTSTS_EPEVT4_Pos)
#define USBD_INTSTS_EPEVT5_Pos                            21
#define USBD_INTSTS_EPEVT5_Msk                            (0x1ul << USBD_INTSTS_EPEVT5_Pos)
#define USBD_INTSTS_EPEVT6_Pos                            22
#define USBD_INTSTS_EPEVT6_Msk                            (0x1ul << USBD_INTSTS_EPEVT6_Pos)
#define USBD_INTSTS_EPEVT7_Pos                            23
#define USBD_INTSTS_EPEVT7_Msk                            (0x1ul << USBD_INTSTS_EPEVT7_Pos)
// Bits 24-30 are Reserved.
#define USBD_INTSTS_SETUP_Pos                             31
#define USBD_INTSTS_SETUP_Msk                             (0x01ul << USBD_INTSTS_SETUP_Pos)


/**
  * @brief USB Device Controller (USBD) - Register USBD_FADDR
  * 
  * @description USB Interrupt Event Status Register (USBD_FADDR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 166
  * 
  * USBD_FADDR = USB_BA+0x008
  * 
  * 
  * FADDR [0:6]
  * USB Device Function Address
  * 
  * A seven-bit value used as the address of the device on the USB BUS
  * 
  */

