ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define USBD_FADDR_FADDR_Pos                              0
#define USBD_FADDR_FADDR_Msk                              (0x07Ful << USBD_FADDR_FADDR_Pos)
// Bits 7-31 are Reserved.


/**
  * @brief USB Device Controller (USBD) - Register USBD_EPSTS
  * 
  * @description USB Endpoint Status Register (USBD_EPSTS) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 167-169
  * 
  * USBD_EPSTS = USB_BA+0x00C
  * 
  * 
  * OVERRUN [7]
  * Overrun
  * 
  * Indicates that the received data is larger than the maximum payload number.
  * 
  * 1 = Out data is more than the Max Payload in MXPLD register or the Setup data is
  *     more than 8 bytes.
  * 0 = No overrun.
  * 
  * 
  * EPSTS0~7 [8:10]/[11:13]/[14:16]/[17:19]/[20:22]/[23:25]/[26:28]/[29:31]
  * Endpoint 0~7 Bus Status
  * 
  * These bits are used to indicate the current status of this endpoint.
  * 
  * 000 = In ACK
  * 001 = In NAK
  * 010 = Out Packet Data0 ACK
  * 110 = Out Packet Data1 ACK
  * 011 = Setup ACK
  * 111 = Isochronous transfer end
  * 
  */

// Bits 0-6 are Reserved.
#define USBD_EPSTS_OVERRUN_Pos                            7
#define USBD_EPSTS_OVERRUN_Msk                            (0b01ul << USBD_EPSTS_OVERRUN_Pos)
#define USBD_EPSTS_EPSTS0_Pos                             8
#define USBD_EPSTS_EPSTS0_Msk                             (0b0111ul << USBD_EPSTS_EPSTS0_Pos)
#define USBD_EPSTS_EPSTS1_Pos                             11
#define USBD_EPSTS_EPSTS1_Msk                             (0b0111ul << USBD_EPSTS_EPSTS1_Pos)
#define USBD_EPSTS_EPSTS2_Pos                             14
#define USBD_EPSTS_EPSTS2_Msk                             (0b0111ul << USBD_EPSTS_EPSTS2_Pos)
#define USBD_EPSTS_EPSTS3_Pos                             17
#define USBD_EPSTS_EPSTS3_Msk                             (0b0111ul << USBD_EPSTS_EPSTS3_Pos)
#define USBD_EPSTS_EPSTS4_Pos                             20
#define USBD_EPSTS_EPSTS4_Msk                             (0b0111ul << USBD_EPSTS_EPSTS4_Pos)
#define USBD_EPSTS_EPSTS5_Pos                             23
#define USBD_EPSTS_EPSTS5_Msk                             (0b0111ul << USBD_EPSTS_EPSTS5_Pos)
#define USBD_EPSTS_EPSTS6_Pos                             26
#define USBD_EPSTS_EPSTS6_Msk                             (0b0111ul << USBD_EPSTS_EPSTS6_Pos)
#define USBD_EPSTS_EPSTS7_Pos                             29
#define USBD_EPSTS_EPSTS7_Msk                             (0b0111ul << USBD_EPSTS_EPSTS7_Pos)


/**
  * @brief USB Device Controller (USBD) - Register USBD_ATTR
  * 
  * @description USB Bus Status and Attribution Register (USBD_ATTR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 170-171
  * 
  * USBD_ATTR = USB_BA+0x010
  * 
  * 
  * USBRST [0]
  * USB Reset Status (Read Only)
  * 
  * 1 = Bus reset when SE0 (single-ended 0) more than 2.5 us.
  * 0 = No bus reset.
  * 
  * 
  * SUSPEND [1]
  * Suspend Status (Read Only)
  * 
  * 1 = Bus idle more than 3ms, either cable is unplugged or host is sleeping
  * 0 = No bus suspend.
  * 
  * 
  * RESUME [2]
  * Resume Status (Read Only)
  * 
  * 1 = Resume from suspend.
  * 0 = No bus resume.
  * 
  * 
  * TIME-OUT [3]
  * Time Out Status (Read Only)
  * 
  * 1 = No Bus response for more than 18 bits/units time.
  * 0 = No time-out.
  * 
  * 
  * PHY_EN [4]
  * PHY Transceiver Function Enable
  * 
  * 1 = PHY transceiver function Enabled.
  * 0 = PHY transceiver function Disabled.
  * 
  * 
  * RWAKEUP [5]
  * Remote Wake-up
  * 
  * 1 = Force USB bus to K (USB_DP low, USB_DM: high) state, used for remote wake-up.
  * 0 = Release the USB bus from K state.
  * 
  * 
  * USB_EN [7]
  * USB Controller Enable
  * 
  * 1 = USB Controller Enabled.
  * 0 = USB Controller Disabled.
  * 
  * 
  * DPPU_EN [8]
  * Pull-up resistor on USB_DP enable
  * 
  * 1 = Pull-up resistor in USB_DP bus Enabled.
  * 0 = Pull-up resistor in USB_DP bus Disabled.
  * 
  * 
  * PWRDN [9]
  * Power-down PHY Transceiver, Low Active
  * 
  * 1 = Power-up related circuit of PHY transceiver.
  * 0 = Power-down related circuit of PHY transceiver.
  * 
  * 
  * BYTEM [10]
  * CPU access USB SRAM Size Mode Selection
  * 
  * 1 = Byte Mode: The size of the transfer from CPU to USB SRAM must be Byte-wide.
  * 0 = Word Mode: The size of the transfer from CPU to USB SRAM must be Word-wide.
  * 
  */

#define USBD_ATTR_USBRST_Pos                              0
#define USBD_ATTR_USBRST_Msk                              (0x01ul << USBD_ATTR_USBRST_Pos)
#define USBD_ATTR_SUSPEND_Pos                             1
#define USBD_ATTR_SUSPEND_Msk                             (0x01ul << USBD_ATTR_SUSPEND_Pos)
#define USBD_ATTR_RESUME_Pos                              2
#define USBD_ATTR_RESUME_Msk                              (0x01ul << USBD_ATTR_RESUME_Pos)
#define USBD_ATTR_TIMEOUT_Pos                             3
#define USBD_ATTR_TIMEOUT_Msk                             (0x01ul << USBD_ATTR_TIMEOUT_Pos)
#define USBD_ATTR_PHY_EN_Pos                              4
#define USBD_ATTR_PHY_EN_Msk                              (0x01ul << USBD_ATTR_PHY_EN_Pos)
#define USBD_ATTR_RWAKEUP_Pos                             5
#define USBD_ATTR_RWAKEUP_Msk                             (0x01ul << USBD_ATTR_RWAKEUP_Pos)
// Bit 6 is Reserved.
#define USBD_ATTR_USB_EN_Pos                              7
#define USBD_ATTR_USB_EN_Msk                              (0x01ul << USBD_ATTR_USB_EN_Pos)
#define USBD_ATTR_DPPU_EN_Pos                             8
#define USBD_ATTR_DPPU_EN_Msk                             (0x01ul << USBD_ATTR_DPPU_EN_Pos)
#define USBD_ATTR_PWRDN_Pos                               9
#define USBD_ATTR_PWRDN_Msk                               (0x01ul << USBD_ATTR_PWRDN_Pos)
#define USBD_ATTR_BYTEM_Pos                               10
#define USBD_ATTR_BYTEM_Msk                               (0x01ul << USBD_ATTR_BYTEM_Pos)
// Bits 11-31 are Reserved.


/**
  * @brief USB Device Controller (USBD) - Register USBD_FLDET
  * 
  * @description USB Device Floating Detection Register (USBD_FLDET) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 172
  * 
  * USBD_FLDET = USB_BA+0x014
  * 
  * 
  * FLDET [0]
  * Device Floating Detected
  * 
  * 1 = Controller is attached to the BUS.
  * 0 = Controller isn't attached to the USB host.
  * 
  */

#define USBD_FLDET_FLDET_Pos                              0
#define USBD_FLDET_FLDET_Msk                              (0x01ul << USBD_FLDET_FLDET_Pos)
// Bits 1-31 are Reserved.


/**
  * @brief USB Device Controller (USBD) - Register USBD_BUFSEG
  * 
  * @description Setup Token Buffer Segmentation Register (USBD_BUFSEG) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 173
  * 
  * USBD_BUFSEG = USB_BA+0x018
  * 
  * 
  * BUFSEG [3:8]
  * Used to indicate the offset address for the Setup token with the USB SRAM
  * starting address.
  * 
  * The effective starting address is:
  *     USBD_SRAM address + { BUFSEG[8:3], 3‟b000}
  * Where the USBD_SRAM address = USB_BA+0x100h.
  * 
  * Note: This is ONLY used for Setup token.
  * 
  */

// Bits 0-2 are Reserved.
#define USBD_STBUFSEG_STBUFSEG_Pos                        3
#define USBD_STBUFSEG_STBUFSEG_Msk                        (0x03Ful << USBD_STBUFSEG_STBUFSEG_Pos)
// Bits 9-31 are Reserved.


/**
  * @brief USB Device Controller (USBD) - Register USBD_BUFSEG0~7
  * 
  * @description Buffer Segmentation Register (USBD_BUFSEG0~7) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 174-175
  * 
  * USBD_BUFSEG0 = USB_BA+0x500
  * USBD_BUFSEG1 = USB_BA+0x510
  * USBD_BUFSEG2 = USB_BA+0x520
  * USBD_BUFSEG3 = USB_BA+0x530
  * USBD_BUFSEG4 = USB_BA+0x540
  * USBD_BUFSEG5 = USB_BA+0x550
  * USBD_BUFSEG6 = USB_BA+0x560
  * USBD_BUFSEG7 = USB_BA+0x570
  * 
  * 
  * BUFSEG [3:8]
  * Used to indicate the offset address for each endpoint with the USB SRAM
  * starting address.
  * 
  * The effective starting address is:
  *     USBD_SRAM address + { BUFSEG[8:3], 3‟b000}
  * Where the USBD_SRAM address = USB_BA+0x100h.
  * 
  */

// Bits 0-2 are Reserved.
#define USBD_BUFSEG_BUFSEG_Pos                            3
#define USBD_BUFSEG_BUFSEG_Msk                            (0x03Ful << USBD_BUFSEG_BUFSEG_Pos)
// Bits 9-31 are Reserved.


/**
  * @brief USB Device Controller (USBD) - Register USBD_MXPLD0~7
  * 
  * @description Maximal Payload Register (USBD_MXPLD0~7) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 176-177
  * 
  * USBD_MXPLD0 = USB_BA+0x504
  * USBD_MXPLD1 = USB_BA+0x514
  * USBD_MXPLD2 = USB_BA+0x524
  * USBD_MXPLD3 = USB_BA+0x534
  * USBD_MXPLD4 = USB_BA+0x544
  * USBD_MXPLD5 = USB_BA+0x554
  * USBD_MXPLD6 = USB_BA+0x564
  * USBD_MXPLD7 = USB_BA+0x574
  * 
  * MXPLD [0:8]
  * Maximal Payload
  * 
  * It is used to define the data length which is transmitted to host (IN token) or the actual
  * data length which is received from the host (OUT token). It is also used to indicate
  * that the endpoint is ready to be transmitted in IN token or received in OUT token.
  * 
  * (1) When the register is written by CPU,
  *     For IN token, the value of MXPLD is used to define the data length to be transmitted
  *     and indicate the data buffer is ready.
  *     For OUT token, it means that the controller is ready to receive data from the host and
  *     the value of MXPLD is the maximal data length comes from host.
  * (2) When the register is read by CPU,
  *     For IN token, the value of MXPLD indicates the data length be transmitted to host
  *     For OUT token, the value of MXPLD indicates the actual data length receiving from host.
  * 
  * Note: Once MXPLD is written, the data packets will be transmitted/received
  * immediately after IN/OUT token arrived.
  * 
  */

#define USBD_MXPLD_MXPLD_Pos                              0
#define USBD_MXPLD_MXPLD_Msk                              (0x1FFul << USBD_MXPLD_MXPLD_Pos)
// Bits 9-31 are Reserved.


/**
  * @brief USB Device Controller (USBD) - Register USBD_CFG0~7
  * 
  * @description Endpoint Configuration Register (USBD_CFG0~7) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 178-179
  * 
  * USBD_CFG0 = USB_BA+0x508
  * USBD_CFG1 = USB_BA+0x518
  * USBD_CFG2 = USB_BA+0x528
  * USBD_CFG3 = USB_BA+0x538
  * USBD_CFG4 = USB_BA+0x548
  * USBD_CFG5 = USB_BA+0x558
  * USBD_CFG6 = USB_BA+0x568
  * USBD_CFG7 = USB_BA+0x578
  * 
  * 
  * EP_NUM [0:3]
  * Endpoint Number
  * 
  * These bits are used to define the endpoint number of the current endpoint.
  * 
  * 
  * ISOCH [4]
  * Isochronous Endpoint
  * 
  * This bit is used to set the endpoint as Isochronous endpoint - no handshake.
  * 
  * 1 = Isochronous endpoint
  * 0 = No Isochronous endpoint
  * 
  * 
  * STATE [5:6]
  * Endpoint STATE
  * 
  * 00 = Endpoint Disabled
  * 01 = Out endpoint
  * 10 = IN endpoint
  * 11 = Undefined
  * 
  * 
  * DSQ_SYNC [7]
  * Data Sequence Synchronization
  * 
  * 1 = DATA1 PID
  * 0 = DATA0 PID
  * 
  * It is used to specify the DATA0 or DATA1 PID in the following IN token transaction.
  * H/W will toggle automatically in IN token - based on this bit.
  * 
  * 
  * CSTALL [9]
  * Clear STALL Response
  * 
  * 1 = Clear the device to respond STALL handshake in the setup stage.
  * 0 = Device Disabled to clear the STALL handshake in the setup stage.
  * 
  */

