ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define USBD_CFG_EP_NUM_Pos                               0
#define USBD_CFG_EP_NUM_Msk                               (0xFul << USBD_CFG_EP_NUM_Pos)
#define USBD_CFG_ISOCH_Pos                                4
#define USBD_CFG_ISOCH_Msk                                (0x01ul << USBD_CFG_ISOCH_Pos)
#define USBD_CFG_STATE_Pos                                5
#define USBD_CFG_STATE_Msk                                (0x03ul << USBD_CFG_STATE_Pos)
#define USBD_CFG_DSQ_SYNC_Pos                             7
#define USBD_CFG_DSQ_SYNC_Msk                             (0x01ul << USBD_CFG_DSQ_SYNC_Pos)
// Bit 8 is Reserved.
#define USBD_CFG_CSTALL_Pos                               9
#define USBD_CFG_CSTALL_Msk                               (0x01ul << USBD_CFG_CSTALL_Pos)
// Bits 10-31 are Reserved.


/**
  * @brief USB Device Controller (USBD) - Register USBD_CFGP0~7
  * 
  * @description Extra Configuration Register (USBD_CFGP0~7) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 180-181
  * 
  * USBD_CFGP0 = USB_BA+0x50C
  * USBD_CFGP1 = USB_BA+0x51C
  * USBD_CFGP2 = USB_BA+0x52C
  * USBD_CFGP3 = USB_BA+0x53C
  * USBD_CFGP4 = USB_BA+0x54C
  * USBD_CFGP5 = USB_BA+0x55C
  * USBD_CFGP6 = USB_BA+0x56C
  * USBD_CFGP7 = USB_BA+0x57C
  * 
  * 
  * CLRRDY [0]
  * Clear Ready
  * 
  * When the MXPLD register is set by user, it means that the endpoint is ready to
  * transmit or receive data. If the user wants to turn off this transaction before the
  * transaction start, user can set this bit to 1 to turn it off, which is then automatically
  * cleared to 0.
  * 
  * For IN token, writing 1 is used to clear the IN token - ready to transmit data to USB.
  * For OUT token, writing 1 is used to clear the OUT token - ready to receive data from USB.
  * 
  * This bit is written 1 only and is always 0 when it is read back.
  * 
  * 
  * SSTALL [1]
  * Set STALL
  * 
  * 1 = Set the device to respond STALL automatically.
  * 0 = Device Disabled from responding to STALL.
  * 
  */

#define USBD_CFGP_CLRRDY_Pos                              0
#define USBD_CFGP_CLRRDY_Msk                              (0x01ul << USBD_CFGP_CLRRDY_Pos)
#define USBD_CFGP_SSTALL_Pos                              1
#define USBD_CFGP_SSTALL_Msk                              (0x01ul << USBD_CFGP_SSTALL_Pos)
// Bits 2-31 are Reserved.


/**
  * @brief USB Device Controller (USBD) - Register USBD_DRVSE0
  * 
  * @description USB Drive SE0 Register (USBD_DRVSE0) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 182
  * 
  * USBD_DRVSE0 = USB_BA+0x090
  * 
  * 
  * DRVSE0 [0]
  * Drive Single Ended Zero in USB Bus
  * 
  * The Single Ended Zero (SE0) is when both lines (USB_DP and USB_DM) are being
  * pulled low.
  * 
  * 1 = Force USB PHY transceiver to drive SE0
  * 0 = None
  * 
  * 
  */

#define USBD_DRVSE0_DRVSE0_Pos                            0
#define USBD_DRVSE0_DRVSE0_Msk                            (0x01ul << USBD_DRVSE0_DRVSE0_Pos)
// Bits 1-31 are Reserved.


/**
  * @brief USB Device Controller (USBD) - Register USBD_PDMA
  * 
  * @description USB PDMA Controller Register (USBD_PDMA) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.6.6 Register Description, page 183
  * 
  * USBD_PDMA = USB_BA+0x0A4
  * 
  * 
  * PDMA_RW [0]
  * PDMA Read/Write
  * 
  * 1 = The PDMA will read data from USB buffer to memory
  * 0 = The PDMA will read data from memory to USB buffer
  * 
  * 
  * PDMA_EN [1]
  * PDMA Function Enable
  * 
  * 1 = The PDMA function in USB is active
  * 0 = The PDMA function is not active
  * 
  * This bit will be automatically cleared after the PDMA transfer completes.
  * 
  */


#define USBD_PDMA_PDMA_RW_Pos                             0
#define USBD_PDMA_PDMA_RW_Msk                             (0x01ul << USBD_PDMA_PDMA_RW_Pos)
#define USBD_PDMA_PDMA_EN_Pos                             1
#define USBD_PDMA_PDMA_EN_Msk                             (0x01ul << USBD_PDMA_PDMA_EN_Pos)
// Bits 2-31 are Reserved.



/* =========================================================================================================================== */
/* ================                                     GPIO Controller                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief GPIO Controller (GPIO)
  * 
  * @description See NUC123 Technical Reference Manual 5.7.4 Register Map, page 187-190
  * 
  * GP_BA = 0x5000_4000
  * 
  * Struct rearranged from table to track actual locations (without having to specify offsets)
  * 
  * GPIO_T Struct is per-GPIO port, with offsets of:
  * 
  * GPIOA = GP_BA+0x000
  * GPIOB = GP_BA+0x040
  * GPIOC = GP_BA+0x080
  * GPIOD = GP_BA+0x0C0
  * GPIOF = GP_BA+0x140
  * 
  * DBNCECON = GP_BA+0x180
  * 
  * Note: DBNCECON in separate struct due to unary nature of register, compared to multiple nature of GPIO_T-based GPIO ports
  * 
  * There are separate DOUTs for each GPIO Port Pin (A10-A15, B0-B15, C0-C5:C8-C13, D0-D5:D8-D11, F0-F3) but these are NOT
  * NOT represented here as defines, other than the GPIO_PIN_DATA_BASE defining their start location.
  */
typedef struct {

    __IO uint32_t PMD;           // GP_BA + GPIO<x> + 0x00        GPIO Port [A/B/C/D/F] Pin I/O Mode Control
    __IO uint32_t OFFD;          // GP_BA + GPIO<x> + 0x04        GPIO Port [A/B/C/D/F] Pin Digital Input Path Disable Control
    __IO uint32_t DOUT;          // GP_BA + GPIO<x> + 0x08        GPIO Port [A/B/C/D/F] Data Output Value
    __IO uint32_t DMASK;         // GP_BA + GPIO<x> + 0x0C        GPIO Port [A/B/C/D/F] Data Output Write Mask
    __I  uint32_t PIN;           // GP_BA + GPIO<x> + 0x10        GPIO Port [A/B/C/D/F] Pin Value
    __IO uint32_t DBEN;          // GP_BA + GPIO<x> + 0x14        GPIO Port [A/B/C/D/F] De-bounce Enable
    __IO uint32_t IMD;           // GP_BA + GPIO<x> + 0x18        GPIO Port [A/B/C/D/F] Interrupt Mode Control
    __IO uint32_t IEN;           // GP_BA + GPIO<x> + 0x1C        GPIO Port [A/B/C/D/F] Interrupt Enable
    __IO uint32_t ISRC;          // GP_BA + GPIO<x> + 0x20        GPIO Port [A/B/C/D/F] Interrupt Source Flag

