ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
} GPIO_T;


typedef struct {

    __IO uint32_t DBNCECON;      // GP_BA + 0x180                 External Interrupt De-bounce Control

} GPIO_DBNCECON_T;

/**
  * @brief GPIO Controller (GPIO) - Register PMD
  * 
  * @description GPIO Port [A/B/C/D/F] I/O Mode Control (PMD) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.7.5 Register Description, page 191
  * 
  * 
  * GPIOx I/O Pin[n] Mode Control
  * 
  * 00 = GPIO port [n] pin is in INPUT mode
  * 01 = GPIO port [n] pin is in OUTPUT mode
  * 10 = GPIO port [n] pin is in Open-Drain mode
  * 11 = GPIO port [n] pin is in Quasi-bidirectional mode
  * 
  * GPIOA: valid n are 15~10. Others are reserved.
  * GPIOB: valid n are 15~12, 10~0. Others are reserved.
  * GPIOC: valid n are 13~8, 5~0. Others are reserved.
  * GPIOD: valid n are 11~8, 5~0. Others are reserved.
  * GPIOF: valid n are 3~0. Others are reserved.
  * 
  */

#define GPIO_PMD_PMD0_Pos                                 0
#define GPIO_PMD_PMD0_Msk                                 (0b011ul << GPIO_PMD_PMD0_Pos)
#define GPIO_PMD_PMD1_Pos                                 2
#define GPIO_PMD_PMD1_Msk                                 (0b011ul << GPIO_PMD_PMD1_Pos)
#define GPIO_PMD_PMD2_Pos                                 4
#define GPIO_PMD_PMD2_Msk                                 (0b011ul << GPIO_PMD_PMD2_Pos)
#define GPIO_PMD_PMD3_Pos                                 6
#define GPIO_PMD_PMD3_Msk                                 (0b011ul << GPIO_PMD_PMD3_Pos)
#define GPIO_PMD_PMD4_Pos                                 8
#define GPIO_PMD_PMD4_Msk                                 (0b011ul << GPIO_PMD_PMD4_Pos)
#define GPIO_PMD_PMD5_Pos                                 10
#define GPIO_PMD_PMD5_Msk                                 (0b011ul << GPIO_PMD_PMD5_Pos)
#define GPIO_PMD_PMD6_Pos                                 12
#define GPIO_PMD_PMD6_Msk                                 (0b011ul << GPIO_PMD_PMD6_Pos)
#define GPIO_PMD_PMD7_Pos                                 14
#define GPIO_PMD_PMD7_Msk                                 (0b011ul << GPIO_PMD_PMD7_Pos)
#define GPIO_PMD_PMD8_Pos                                 16
#define GPIO_PMD_PMD8_Msk                                 (0b011ul << GPIO_PMD_PMD8_Pos)
#define GPIO_PMD_PMD9_Pos                                 18
#define GPIO_PMD_PMD9_Msk                                 (0b011ul << GPIO_PMD_PMD9_Pos)
#define GPIO_PMD_PMD10_Pos                                20
#define GPIO_PMD_PMD10_Msk                                (0b011ul << GPIO_PMD_PMD10_Pos)
#define GPIO_PMD_PMD11_Pos                                22
#define GPIO_PMD_PMD11_Msk                                (0b011ul << GPIO_PMD_PMD11_Pos)
#define GPIO_PMD_PMD12_Pos                                24
#define GPIO_PMD_PMD12_Msk                                (0b011ul << GPIO_PMD_PMD12_Pos)
#define GPIO_PMD_PMD13_Pos                                26
#define GPIO_PMD_PMD13_Msk                                (0b011ul << GPIO_PMD_PMD13_Pos)
#define GPIO_PMD_PMD14_Pos                                28
#define GPIO_PMD_PMD14_Msk                                (0b011ul << GPIO_PMD_PMD14_Pos)
#define GPIO_PMD_PMD15_Pos                                30
#define GPIO_PMD_PMD15_Msk                                (0b011ul << GPIO_PMD_PMD15_Pos)

/**
  * @brief GPIO Controller (GPIO) - Register OFFD
  * 
  * @description GPIO Port [A/B/C/D/F] OFF Digital Input Path Enable (OFFD) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.7.5 Register Description, page 192
  * 
  * GPIOx I/O Pin[n] OFF Digital Input Path Enable
  * 
  * Each of these bits is used to control if the input path of corresponding GPIO pin is
  * disabled. If input is analog signal, user can OFF digital input path to avoid creepage
  * 
  * 1 = IO digital input path Disabled (digital input tied to low).
  * 0 = IO digital input path Enabled.
  * 
  * GPIOA: valid n are 15~10. Others are reserved.
  * GPIOB: valid n are 15~12, 10~0. Others are reserved.
  * GPIOC: valid n are 13~8, 5~0. Others are reserved.
  * GPIOD: valid n are 11~8, 5~0. Others are reserved.
  * GPIOF: valid n are 3~0. Others are reserved.
  * 
  */

// Bits 0-15 are Reserved
// Bits 16-31
#define GPIO_OFFD_OFFD_Pos                                16
#define GPIO_OFFD_OFFD_Msk                                (0xFFFFul << GPIO_OFFD_OFFD_Pos)

/**
  * @brief GPIO Controller (GPIO) - Register DOUT
  * 
  * @description GPIO Port [A/B/C/D/F] Output Value (DOUT) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.7.5 Register Description, page 193
  * 
  * GPIOx Pin[n] Output Value
  * 
  * Each of these bits control the status of a GPIO pin when the GPIO pin is configures
  * as output, open-drain and quasi-mode.
  * 
  * 1 = GPIO port [A/B/C/DF] Pin[n] will drive High if the GPIO pin is configures as output,
  *     open-drain and quasi-mode.
  * 0 = GPIO port [A/B/C/D/ F] Pin[n] will drive Low if the GPIO pin is configures as
  *     output, open-drain and quasi-mode.
  * 
  * GPIOA: valid n are 15~10. Others are reserved.
  * GPIOB: valid n are 15~12, 10~0. Others are reserved.
  * GPIOC: valid n are 13~8, 5~0. Others are reserved.
  * GPIOD: valid n are 11~8, 5~0. Others are reserved.
  * GPIOF: valid n are 3~0. Others are reserved.
  * 
  */

// Bits 0-15
#define GPIO_DOUT_DOUT_Pos                                0
#define GPIO_DOUT_DOUT_Msk                                (0xFFFFul << GPIO_DOUT_DOUT_Pos)
// Bits 16-31 are Reserved


/**
  * @brief GPIO Controller (GPIO) - Register DMASK
  * 
  * @description GPIO Port [A/B/C/D/F] Data Output Write Mask (DMASK) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.7.5 Register Description, page 194
  * 
  * GPIO Port [A/B/C/D/F] Data Output Write Mask
  * 
  * These bits are used to protect the corresponding register of GPIOx_DOUT bit[n].
  * When set the DMASK bit[n] to 1, the corresponding GPIOx_DOUT[n] bit is protected.
  * The write signal is masked, write data to the protect bit is ignored
  * 
  * 1 = The corresponding GPIOx_DOUT[n] bit is protected
  * 0 = The corresponding GPIOx_DOUT[n] bit can be updated
  * 
  * IMPORTANT
  * =========
  * This function only protect corresponding GPIOx_DOUT[n] bit, and WILL NOT
  * protect corresponding bit control registers (GPIOAx_DOUT, GPIOBx_DOUT,
  * GPIOCx_DOUT, GPIODx_DOUT and GPIOFx_DOUT) found later in the memory map.
  * 
  * GPIOA: valid n are 15~10. Others are reserved.
  * GPIOB: valid n are 15~12, 10~0. Others are reserved.
  * GPIOC: valid n are 13~8, 5~0. Others are reserved.
  * GPIOD: valid n are 11~8, 5~0. Others are reserved.
  * GPIOF: valid n are 3~0. Others are reserved.
  * 
  */

// Bits 0-15
#define GPIO_DMASK_DMASK_Pos                              0
#define GPIO_DMASK_DMASK_Msk                              (0xFFFFul << GPIO_DMASK_DMASK_Pos)
// Bits 16-31 are Reserved.

/**
  * @brief GPIO Controller (GPIO) - Register PIN
  * 
  * @description GPIO Port [A/B/C/D/F] Pin Value (PIN) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.7.5 Register Description, page 195
  * 
  * GPIO Port [A/B/C/D/F] Pin Values
  * 
  * Each bit of the register reflects the actual status of the respective GPIO pin If bit is 1,
  * it indicates the corresponding pin status is high, else the pin status is low
  * 
  * GPIOA: valid n are 15~10. Others are reserved.
  * GPIOB: valid n are 15~12, 10~0. Others are reserved.
  * GPIOC: valid n are 13~8, 5~0. Others are reserved.
  * GPIOD: valid n are 11~8, 5~0. Others are reserved.
  * GPIOF: valid n are 3~0. Others are reserved.
  * 
  */

// Bits 0-15
#define GPIO_PIN_PIN_Pos                                  0
#define GPIO_PIN_PIN_Msk                                  (0xFFFFul << GPIO_PIN_PIN_Pos)
// Bits 16-31 are Reserved.

/**
  * @brief GPIO Controller (GPIO) - Register DBEN
  * 
  * @description GPIO Port [A/B/C/D/F] De-bounce Enable (DBEN) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.7.5 Register Description, page 196
  * 
  * GPIO Port [A/B/C/D/F] Input Signal De-bounce Enable
  * 
  * DBEN[n] is used to enable the de-bounce function for each corresponding bit.
  * If the input signal pulse width can't be sampled by continuous two de-bounce
  * sample cycle The input signal transition is seen as the signal bounce and
  * will not trigger the interrupt.
  * 
  * The de-bounce clock source is controlled by DBNCECON[4], one de-bounce sample
  * cycle is controlled by DBNCECON[3:0]
  * 
  * The DBEN[n] is used for "edge-trigger" interrupt only, and ignored for "level trigger"
  * interrupt
  * 
  * 1 = The bit[n] de-bounce function is enabled
  * 0 = The bit[n] de-bounce function is disabled
  * 
  * The de-bounce function is ONLY valid for edge triggered interrupt. If the interrupt mode
  * is level triggered, the de-bounce enable bit is ignored.
  * 
  * GPIOA: valid n are 15~10. Others are reserved.
  * GPIOB: valid n are 15~12, 10~0. Others are reserved.
  * GPIOC: valid n are 13~8, 5~0. Others are reserved.
  * GPIOD: valid n are 11~8, 5~0. Others are reserved.
  * GPIOF: valid n are 3~0. Others are reserved.
  * 
  */

// Bits 0-15
#define GPIO_DBEN_DBEN_Pos                                0
#define GPIO_DBEN_DBEN_Msk                                (0xFFFFul << GPIO_DBEN_DBEN_Pos)
// Bits 16-31 are Reserved.

/**
  * @brief GPIO Controller (GPIO) - Register IMD
  * 
  * @description GPIO Port [A/B/C/D/F] Interrupt Mode Control (IMD) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.7.5 Register Description, page 197
  * 
  * GPIO Port [A/B/C/D/F] Edge or Level Detection Interrupt Control
  * 
  * IMD[n] is used to choose between a level trigger or an edge trigger intterupt.
  * 
  * If the interrupt is by edge trigger, the trigger source can be controlled by de-bounce.
  * If the interrupt is by level trigger, the input source is sampled during one HCLK clock
  * and then generates the interrupt.
  * 
  * 1 = Level trigger interrupt.
  * 0 = Edge trigger interrupt.
  * 
  * If pin is set as a level trigger interrupt, only one level can be set on the registers
  * GPIOx_IEN. If both levels are set to trigger an interrupt, the setting is ignored and no
  * interrupt will occur.
  * 
  * The de-bounce function is ONLY valid for edge triggered interrupt. If the interrupt mode
  * is level triggered, the de-bounce enable bit is ignored.
  * 
  * GPIOA: Valid n are 15~10. Others are reserved.
  * GPIOB: Valid n are 15~12, 10~0. Others are reserved.
  * GPIOC: Valid n are 13~8, 5~0. Others are reserved.
  * GPIOD: Valid n are 11~8, 5~0. Others are reserved.
  * GPIOF: valid n are 3~0. Others are reserved.
  * 
  */

// Bits 0-15
#define GPIO_IMD_IMD_Pos                                  0
#define GPIO_IMD_IMD_Msk                                  (0xFFFFul << GPIO_IMD_IMD_Pos)
// Bits 16-31 are Reserved.

/**
  * @brief GPIO Controller (GPIO) - Register IEN
  * 
  * @description GPIO Port [A/B/C/D/F] Interrupt Enable Control (IEN) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.7.5 Register Description, page 199-200
  *
  * IR_EN[n]
  * ========
  * GPIO Port [A/B/C/D/F] Interrupt Enable by Input Rising Edge or Input Level High
  * 
  * IR_EN[n] is used to enable the interrupt for each of the corresponding input
  * GPIO_PIN[n]. Set bit to 1 also enable the pin wake-up function
  * 
  * When the IR_EN[n] bit is set to 1:
  * 
  * If the interrupt is level triggered, the input PIN[n] state at level "high" will generate the
  * interrupt.
  * If the interrupt is edge triggered, the input PIN[n] state changes from "low-to-high" will
  * generate the interrupt.
  * 
  * 1 = PIN[n] level-high or low-to-high interrupt Enabled.
  * 0 = PIN[n] level-high or low-to-high interrupt Disabled.
  * 
  * 
  * IF_EN[n]
  * ========
  * GPIO Port [A/B/C/D/F] Interrupt Enable by Input Falling Edge or Input Level Low
  * 
  * IF_EN[n] is used to enable the interrupt for each of the corresponding input
  * GPIO_PIN[n]. Set bit to 1 also enable the pin wake-up function
  * 
  * When set the IF_EN[n] bit to 1:
  * 
  * If the interrupt is level triggered, the input PIN[n] state at level "low" will generate the
  * interrupt.
  * If the interrupt is edge triggered, the input PIN[n] state changes from "high-to-low" will
  * generate the interrupt.
  * 
  * 1 = PIN[n] state low-level or high-to-low change interrupt Enabled.
  * 0 = PIN[n] state low-level or high-to-low change interrupt Disabled.
  * 
  * 
  * GPIOA: Valid n are 15~10. Others are reserved.
  * GPIOB: Valid n are 15~12, 10~0. Others are reserved.
  * GPIOC: Valid n are 13~8, 5~0. Others are reserved.
  * GPIOD: Valid n are 11~8, 5~0. Others are reserved.
  * GPIOF: Valid n are 3~0. Others are reserved.
  * 
  */

// IF_EN[n]
// Bits 0-15
#define GPIO_IEN_IF_EN_Pos                                0
#define GPIO_IEN_IF_EN_Msk                                (0xFFFFul << GPIO_IEN_IF_EN_Pos)
// IR_EN[n]
// Bits 16-31
#define GPIO_IEN_IR_EN_Pos                                16
#define GPIO_IEN_IR_EN_Msk                                (0xFFFFul << GPIO_IEN_IR_EN_Pos)

/**
  * @brief GPIO Controller (GPIO) - Register ISRC
  * 
  * @description GPIO Port [A/B/C/D/F] Interrupt Trigger Source (ISRC) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.7.5 Register Description, page 201
  * 
  * GPIO Port [A/B/C/D/F] Interrupt Trigger Source Indicator
  * 
  * On Read:
  * 1 = Indicates GPIOx[n] generate an interrupt.
  * 0 = No interrupt at GPIOx[n].
  * 
  * On Write :
  * 1= Clear the corresponding pending interrupt.
  * 0= No action.
  * 
  * GPIOA: Valid n are 15~10. Others are reserved.
  * GPIOB: Valid n are 15~12, 10~0. Others are reserved.
  * GPIOC: Valid n are 13~8, 5~0. Others are reserved.
  * GPIOD: Valid n are 11~8, 5~0. Others are reserved.
  * GPIOF: Valid n are 3~0. Others are reserved.
  * 
  */
// Bits 0-15
#define GPIO_ISRC_ISRC_Pos                                0
#define GPIO_ISRC_ISRC_Msk                                (0xFFFFul << GPIO_ISRC_ISRC_Pos)
// Bits 16-31 are Reserved.

/**
  * @brief GPIO Controller (GPIO) - Register DBNCECON
  * 
  * @description GPIO Port [A/B/C/D/F] Interrupt De-bounce Cycle Control (DBNCECON) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.7.5 Register Description, page 202-203
  * 
  * DBNCECON = GP_BA+0x180
  * 
  * 
  * ICLK_ON
  * =======
  * 
  * Interrupt clock On mode
  * Setting this bit to 0 will disable the interrupt generate circuit clock if the pin[n] interrupt
  * is disabled
  * 
  * 1 = Interrupt generated circuit clock always Enabled.
  * 0 = Clock Disabled if the GPIOA/B/C/D/F[n] interrupt is disabled.
  * 
  * DBCLKSRC
  * ========
  * De-bounce counter clock source select
  * 
  * 1 = De-bounce counter clock source is the internal 10 kHz low speed oscillator.
  * 0 = De-bounce counter clock source is the HCLK.
  * 
  * DBCLKSEL
  * ========
  * De-bounce sampling cycle selection
  * 
  * 0 Sample interrupt input once per 1 clocks
  * 1 Sample interrupt input once per 2 clocks
  * 2 Sample interrupt input once per 4 clocks
  * 3 Sample interrupt input once per 8 clocks
  * 4 Sample interrupt input once per 16 clocks
  * 5 Sample interrupt input once per 32 clocks
  * 6 Sample interrupt input once per 64 clocks
  * 7 Sample interrupt input once per 128 clocks
  * 8 Sample interrupt input once per 256 clocks
  * 9 Sample interrupt input once per 2*256 clocks
  * 10 Sample interrupt input once per 4*256clocks
  * 11 Sample interrupt input once per 8*256 clocks
  * 12 Sample interrupt input once per 16*256 clocks
  * 13 Sample interrupt input once per 32*256 clocks
  * 14 Sample interrupt input once per 64*256 clocks
  * 15 Sample interrupt input once per 128*256 clocks
  * 
  */

// DBCLKSEL [0:3]
#define GPIO_DBNCECON_DBCLKSEL_Pos                        0
#define GPIO_DBNCECON_DBCLKSEL_Msk                        (0x0Ful << GPIO_DBNCECON_DBCLKSEL_Pos)
// DBCLKSRC [4]
#define GPIO_DBNCECON_DBCLKSRC_Pos                        4
#define GPIO_DBNCECON_DBCLKSRC_Msk                        (0x01ul << GPIO_DBNCECON_DBCLKSRC_Pos)
// ICLK_ON [5]
#define GPIO_DBNCECON_ICLK_ON_Pos                         5
#define GPIO_DBNCECON_ICLK_ON_Msk                         (0x01ul << GPIO_DBNCECON_ICLK_ON_Pos)
// Bits 6-31 are Reserved.


/* =========================================================================================================================== */
/* ================                                      PWM Controller                                       ================ */
/* =========================================================================================================================== */

/**
  * @brief PWM Controller (PWM)
  * 
  * @description See NUC123 Technical Reference Manual 5.9.5 Register Map, page 243-244
  * 
  * PWMA_BA = 0x4004_0000 (PWM group A)
  * 
  * Struct has several reserved sections for future expansion (the memory-mapped peripherals have these gaps)
  * 
  * PWM_T Struct is for PWM Group A on the NUC123SD4AN0 - other NUMICRO family processors have more than one group.
  * 
  */

