ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
typedef struct {

    __IO uint32_t PPR;           // PWMA_BA + 0x00                        PWM Group A Prescaler Register
    __IO uint32_t CSR;           // PWMA_BA + 0x04                        PWM Group A Clock Source Divider Select Register
    __IO uint32_t PCR;           // PWMA_BA + 0x08                        PWM Group A Control Register
    __IO uint32_t CNR0;          // PWMA_BA + 0x0C                        PWM Group A Counter Register 0
    __IO uint32_t CMR0;          // PWMA_BA + 0x10                        PWM Group A Comparator Register 0
    __I  uint32_t PDR0;          // PWMA_BA + 0x14                        PWM Group A Data Register 0
    __IO uint32_t CNR1;          // PWMA_BA + 0x18                        PWM Group A Counter Register 1
    __IO uint32_t CMR1;          // PWMA_BA + 0x1C                        PWM Group A Comparator Register 1
    __I  uint32_t PDR1;          // PWMA_BA + 0x20                        PWM Group A Data Register 1
    __IO uint32_t CNR2;          // PWMA_BA + 0x24                        PWM Group A Counter Register 2
    __IO uint32_t CMR2;          // PWMA_BA + 0x28                        PWM Group A Comparator Register 2
    __I  uint32_t PDR2;          // PWMA_BA + 0x2C                        PWM Group A Data Register 2
    __IO uint32_t CNR3;          // PWMA_BA + 0x30                        PWM Group A Counter Register 3
    __IO uint32_t CMR3;          // PWMA_BA + 0x34                        PWM Group A Comparator Register 3
    __I  uint32_t PDR3;          // PWMA_BA + 0x38                        PWM Group A Data Register 3
    __I  uint32_t RESERVED0[1]; 
    __IO uint32_t PIER;          // PWMA_BA + 0x40                        PWM Group A Interrupt Enable Register
    __IO uint32_t PIIR;          // PWMA_BA + 0x44                        PWM Group A Interrupt Indication Register
    __I  uint32_t RESERVED1[2];  
    __IO uint32_t CCR0;          // PWMA_BA + 0x50                        PWM Group A Capture Control Register 0
    __IO uint32_t CCR2;          // PWMA_BA + 0x54                        PWM Group A Capture Control Register 2
    __IO uint32_t CRLR0;         // PWMA_BA + 0x58                        PWM Group A Capture Rising Latch Register (Channel 0)
    __IO uint32_t CFLR0;         // PWMA_BA + 0x5C                        PWM Group A Capture Falling Latch Register (Channel 0)
    __IO uint32_t CRLR1;         // PWMA_BA + 0x60                        PWM Group A Capture Rising Latch Register (Channel 1)
    __IO uint32_t CFLR1;         // PWMA_BA + 0x64                        PWM Group A Capture Falling Latch Register (Channel 1)
    __IO uint32_t CRLR2;         // PWMA_BA + 0x68                        PWM Group A Capture Rising Latch Register (Channel 2)
    __IO uint32_t CFLR2;         // PWMA_BA + 0x6C                        PWM Group A Capture Falling Latch Register (Channel 2)
    __IO uint32_t CRLR3;         // PWMA_BA + 0x70                        PWM Group A Capture Rising Latch Register (Channel 3)
    __IO uint32_t CFLR3;         // PWMA_BA + 0x74                        PWM Group A Capture Falling Latch Register (Channel 3)
    __IO uint32_t CAPENR;        // PWMA_BA + 0x78                        PWM Group A Capture Input 0~3 Enable Register
    __IO uint32_t POE;           // PWMA_BA + 0x7C                        PWM Group A Output Enable for Channel 0~3
    __IO uint32_t TCON;          // PWMA_BA + 0x80                        PWM Group A Trigger Control for Channel 0~3
    __IO uint32_t TSTATUS;       // PWMA_BA + 0x84                        PWM Group A Trigger Status Register
    __IO uint32_t SYNCBUSY0;     // PWMA_BA + 0x88                        PWM Group A [PWM0] Synchronous Busy Status Register
    __IO uint32_t SYNCBUSY1;     // PWMA_BA + 0x8C                        PWM Group A [PWM1] Synchronous Busy Status Register
    __IO uint32_t SYNCBUSY2;     // PWMA_BA + 0x90                        PWM Group A [PWM2] Synchronous Busy Status Register
    __IO uint32_t SYNCBUSY3;     // PWMA_BA + 0x94                        PWM Group A [PWM3] Synchronous Busy Status Register
    __I  uint32_t RESERVE2[10]; 
    __IO uint32_t CAPPDMACTL;    // PWMA_BA + 0xC0                        PWM Group A Trigger Status Register
    __IO uint32_t CAP0PDMA;      // PWMA_BA + 0xC4                        PWM Group A PDMA channel 0 DATA Register
    __IO uint32_t CAP1PDMA;      // PWMA_BA + 0xC8                        PWM Group A PDMA channel 1 DATA Register
    __IO uint32_t CAP2PDMA;      // PWMA_BA + 0xCC                        PWM Group A PDMA channel 2 DATA Register
    __IO uint32_t CAP3PDMA;      // PWMA_BA + 0xD0                        PWM Group A PDMA channel 3 DATA Register

} PWM_T;


/**
  * @brief PWM Controller (PWM) - Register PPR
  * 
  * @description PWM Group A Prescalar Register (PPR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 245
  * 
  * PPR = PWMA_BA+0x00
  * 
  * 
  * CP01 [0:7]
  * Clock Prescaler 0 (PWM-timer 0 / 1 for Group A)
  * 
  * Clock input is divided by (CP01 + 1) before it is fed to the corresponding PWM-timer.
  * If CP01 = 0, the clock prescaler 0 output clock will be stopped. Thus the corresponding
  * PWM timer will also be stopped.
  * 
  * 
  * CP23 [8:15]
  * Clock Prescaler 2 (PWM Timer2 / 3 for Group A)
  * 
  * Clock input is divided by (CP23 + 1) before it is fed to the corresponding PWM-timer.
  * If CP23 = 0, the clock prescaler 2 output clock will be stopped. Thus the corresponding
  * PWM timer will also be stopped.
  * 
  * 
  * DZI01 [16:23]
  * Dead-zone Interval for Pair of Channel 0 and Channel 1 (PWM0 and PWM1 Pair
  * for PWM Group A). These 8 bits determine dead-zone length.
  * 
  * 
  * DZI23 [24:31]
  * Dead-zone Interval for Pair of Channel 2 and Channel 3 (PWM2 and PWM3 Pair
  * for PWM Group A). These 8 bits determine dead-zone length.
  * 
  * For both DZI01 and DZI23:
  * The unit time of dead-zone length is received from corresponding CSR bits.
  * 
  */

/* PWM PPR Bit Field Definitions */

#define PWM_PPR_CP01_Pos                                  0
#define PWM_PPR_CP01_Msk                                  (0xFFul << PWM_PPR_CP01_Pos)
#define PWM_PPR_CP23_Pos                                  8
#define PWM_PPR_CP23_Msk                                  (0xFFul << PWM_PPR_CP23_Pos)
#define PWM_PPR_DZI01_Pos                                 16
#define PWM_PPR_DZI01_Msk                                 (0xFFul << PWM_PPR_DZI01_Pos)
#define PWM_PPR_DZI23_Pos                                 24
#define PWM_PPR_DZI23_Msk                                 (0xFFul << PWM_PPR_DZI23_Pos)


/**
  * @brief PWM Controller (PWM) - Register CSR
  * 
  * @description PWM Group A Clock Selection Register (CSR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 246-247
  * 
  * CSR = PWMA_BA+0x04
  * 
  * 
  * CSR0 [0:2]
  * PWM Timer 0 Clock Source Selection (PWM Timer 0 for Group A and PWM Timer
  * 4 for Group B)
  * 
  * Select clock input for PWM timer.
  * 
  * CSRn [High->Low]  |  Input Clock Divided by
  * ==================|=========================
  *       100         |            1
  *       000         |            2
  *       001         |            4
  *       010         |            8
  *       011         |           16
  * 
  * 
  * CSR1 [0:2]
  * PWM Timer 0 Clock Source Selection (PWM Timer 1 for Group A)
  * 
  * Select clock input for PWM timer.
  * 
  * CSR1 [High->Low]  |  Input Clock Divided by
  * ==================|=========================
  *       100         |            1
  *       000         |            2
  *       001         |            4
  *       010         |            8
  *       011         |           16
  * 
  * 
  * CSR2 [0:2]
  * PWM Timer 2 Clock Source Selection (PWM Timer 2 for Group A)
  * 
  * Select clock input for PWM timer.
  * 
  * CSR2 [High->Low]  |  Input Clock Divided by
  * ==================|=========================
  *       100         |            1
  *       000         |            2
  *       001         |            4
  *       010         |            8
  *       011         |           16
  * 
  * 
  * CSR3 [12:14]
  * PWM Timer 0 Clock Source Selection (PWM Timer 0 for Group A)
  * 
  * Select clock input for PWM timer.
  * 
  * CSR3 [High->Low]  |  Input Clock Divided by
  * ==================|=========================
  *       100         |            1
  *       000         |            2
  *       001         |            4
  *       010         |            8
  *       011         |           16
  * 
  */

