ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define PWM_CSR_CSR0_Pos                                  0
#define PWM_CSR_CSR0_Msk                                  (0b0111ul << PWM_CSR_CSR0_Pos)
// Bit 3 is Reserved.
#define PWM_CSR_CSR1_Pos                                  4
#define PWM_CSR_CSR1_Msk                                  (0b0111ul << PWM_CSR_CSR1_Pos)
// Bit 7 is Reserved.
#define PWM_CSR_CSR2_Pos                                  8
#define PWM_CSR_CSR2_Msk                                  (0b0111ul << PWM_CSR_CSR2_Pos)
// Bit 11 is Reserved.
#define PWM_CSR_CSR3_Pos                                  12
#define PWM_CSR_CSR3_Msk                                  (0b0111ul << PWM_CSR_CSR3_Pos)
// Bits 15-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register PCR
  * 
  * @description PWM Group A Control Register (PCR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 248-250
  * 
  * PCR = PWMA_BA+0x08
  * 
  * 
  * CH0EN [0]
  * PWM-Timer 0 Enable (PWM timer 0 for group A)
  * 
  * 1 = Corresponding PWM-Timer Start Run Enabled.
  * 0 = Corresponding PWM-Timer Running Stopped.
  * 
  * 
  * CH0PINV [1]
  * PWM-Timer 0 Output Polar Inverse Enable (PWM Timer 0 for Group A)
  * 
  * 1 = PWM0 output polar inverse Enabled.
  * 0 = PWM0 output polar inverse Disabled.
  * 
  * 
  * CH0INV [2]
  * PWM-Timer 0 Output Inverter Enable (PWM Timer 0 for Group A)
  * 
  * 1 = Inverter Enabled.
  * 0 = Inverter Disabled.
  * 
  * 
  * CH0MOD [3]
  * PWM-Timer 0 Auto-reload/One-Shot Mode (PWM Timer 0 for Group A)
  * 
  * 1 = Auto-reload mode.
  * 0 = One-shot mode.
  * 
  * Note: If there is a transition at this bit, it will cause CNR0 and CMR0 be clear.
  * 
  * 
  * DZEN01 [4]
  * Dead-Zone 0 Generator Enable (PWM0 and PWM1 Pair for PWM Group A )
  * 
  * 1 = Enabled.
  * 0 = Disabled.
  * 
  * Note: When dead-zone generator is enabled, the pair of PWM0 and PWM1 becomes a
  * complementary pair for PWM group A.
  * 
  * 
  * DZEN23 [5]
  * Dead-Zone 2 Generator Enable (PWM2 and PWM3 Pair for PWM Group A)
  * 
  * 1 = Enabled.
  * 0 = Disabled.
  * 
  * Note: When dead-zone generator is enabled, the pair of PWM2 and PWM3 becomes a
  * complementary pair for PWM group A.
  * 
  * 
  * CH1EN [8]
  * PWM-Timer 1 Enable (PWM timer 1 for group A)
  * 
  * 1 = Corresponding PWM-Timer Start Run Enabled.
  * 0 = Corresponding PWM-Timer Running Stopped.
  * 
  * 
  * CH1PINV [9]
  * PWM-Timer 1 Output Polar Inverse Enable (PWM Timer 1 for Group A)
  * 
  * 1 = PWM1 output polar inverse Enabled.
  * 0 = PWM1 output polar inverse Disabled.
  * 
  * 
  * CH1INV [10]
  * PWM-Timer 1 Output Inverter Enable (PWM Timer 1 for Group A)
  * 
  * 1 = Inverter Enabled.
  * 0 = Inverter Disabled.
  * 
  * 
  * CH1MOD [11]
  * PWM-Timer 1 Auto-reload/One-Shot Mode (PWM Timer 1 for Group A)
  * 
  * 1 = Auto-reload mode.
  * 0 = One-shot mode.
  * 
  * Note: If there is a transition at this bit, it will cause CNR1 and CMR1 be clear.
  * 
  * 
  * CH2EN [16]
  * PWM-Timer 2 Enable (PWM timer 2 for group A)
  * 
  * 1 = Corresponding PWM-Timer Start Run Enabled.
  * 0 = Corresponding PWM-Timer Running Stopped.
  * 
  * 
  * CH2PINV [17]
  * PWM-Timer 2 Output Polar Inverse Enable (PWM Timer 2 for Group A)
  * 
  * 1 = PWM2 output polar inverse Enabled.
  * 0 = PWM2 output polar inverse Disabled.
  * 
  * 
  * CH2INV [18]
  * PWM-Timer 2 Output Inverter Enable (PWM Timer 2 for Group A)
  * 
  * 1 = Inverter Enabled.
  * 0 = Inverter Disabled.
  * 
  * 
  * CH2MOD [19]
  * PWM-Timer 2 Auto-reload/One-Shot Mode (PWM Timer 2 for Group A)
  * 
  * 1 = Auto-reload mode.
  * 0 = One-shot mode.
  * 
  * Note: If there is a transition at this bit, it will cause CNR2 and CMR2 be clear.
  * 
  * 
  * CH3EN [24]
  * PWM-Timer 3 Enable (PWM timer 3 for group A)
  * 
  * 1 = Corresponding PWM-Timer Start Run Enabled.
  * 0 = Corresponding PWM-Timer Running Stopped.
  * 
  * 
  * CH3PINV [25]
  * PWM-Timer 3 Output Polar Inverse Enable (PWM Timer 3 for Group A)
  * 
  * 1 = PWM3 output polar inverse Enabled.
  * 0 = PWM3 output polar inverse Disabled.
  * 
  * 
  * CH3INV [26]
  * PWM-Timer 3 Output Inverter Enable (PWM Timer 3 for Group A)
  * 
  * 1 = Inverter Enabled.
  * 0 = Inverter Disabled.
  * 
  * 
  * CH3MOD [27]
  * PWM-Timer 3 Auto-reload/One-Shot Mode (PWM Timer 3 for Group A)
  * 
  * 1 = Auto-reload mode.
  * 0 = One-shot mode.
  * 
  * Note: If there is a transition at this bit, it will cause CNR3 and CMR3 be clear.
  * 
  * 
  * PWMTYPE01 [30]
  * PWM01 Aligned Type Selection Bit (PWM0 and PWM1 Pair for PWM Group A)
  * 
  * 0 = Edge-aligned type.
  * 1 = Center-aligned type.
  * 
  * 
  * PWMTYPE23 [31]
  * PWM23 Aligned Type Selection Bit (PWM2 and PWM3 Pair for PWM Group A)
  * 
  * 0 = Edge-aligned type.
  * 1 = Center-aligned type.
  * 
  */

#define PWM_PCR_CH0EN_Pos                                 0
#define PWM_PCR_CH0EN_Msk                                 (0x01ul << PWM_PCR_CH0EN_Pos)
#define PWM_PCR_CH0PINV_Pos                               1
#define PWM_PCR_CH0PINV_Msk                               (0x01ul << PWM_PCR_CH0PINV_Pos)
#define PWM_PCR_CH0INV_Pos                                2
#define PWM_PCR_CH0INV_Msk                                (0x01ul << PWM_PCR_CH0INV_Pos)
#define PWM_PCR_CH0MOD_Pos                                3
#define PWM_PCR_CH0MOD_Msk                                (0x01ul << PWM_PCR_CH0MOD_Pos)
#define PWM_PCR_DZEN01_Pos                                4
#define PWM_PCR_DZEN01_Msk                                (0x01ul << PWM_PCR_DZEN01_Pos)
#define PWM_PCR_DZEN23_Pos                                5
#define PWM_PCR_DZEN23_Msk                                (0x01ul << PWM_PCR_DZEN23_Pos)
// Bits 6-7 are Reserved.
#define PWM_PCR_CH1EN_Pos                                 8
#define PWM_PCR_CH1EN_Msk                                 (0x01ul << PWM_PCR_CH1EN_Pos)
#define PWM_PCR_CH1PINV_Pos                               9
#define PWM_PCR_CH1PINV_Msk                               (0x01ul << PWM_PCR_CH1PINV_Pos)
#define PWM_PCR_CH1INV_Pos                                10
#define PWM_PCR_CH1INV_Msk                                (0x01ul << PWM_PCR_CH1INV_Pos)
#define PWM_PCR_CH1MOD_Pos                                11
#define PWM_PCR_CH1MOD_Msk                                (0x01ul << PWM_PCR_CH1MOD_Pos)
// Bits 12-15 are Reserved.
#define PWM_PCR_CH2EN_Pos                                 16
#define PWM_PCR_CH2EN_Msk                                 (0x01ul << PWM_PCR_CH2EN_Pos)
#define PWM_PCR_CH2PINV_Pos                               17
#define PWM_PCR_CH2PINV_Msk                               (0x01ul << PWM_PCR_CH2PINV_Pos)
#define PWM_PCR_CH2INV_Pos                                18
#define PWM_PCR_CH2INV_Msk                                (0x01ul << PWM_PCR_CH2INV_Pos)
#define PWM_PCR_CH2MOD_Pos                                19
#define PWM_PCR_CH2MOD_Msk                                (0x01ul << PWM_PCR_CH2MOD_Pos)
// Bits 20-23 are Reserved.
#define PWM_PCR_CH3EN_Pos                                 24
#define PWM_PCR_CH3EN_Msk                                 (0x01ul << PWM_PCR_CH3EN_Pos)
#define PWM_PCR_CH3PINV_Pos                               25
#define PWM_PCR_CH3PINV_Msk                               (0x01ul << PWM_PCR_CH3PINV_Pos)
#define PWM_PCR_CH3INV_Pos                                26
#define PWM_PCR_CH3INV_Msk                                (0x01ul << PWM_PCR_CH3INV_Pos)
#define PWM_PCR_CH3MOD_Pos                                27
#define PWM_PCR_CH3MOD_Msk                                (0x01ul << PWM_PCR_CH3MOD_Pos)
// Bits 28-29 are Reserved.
#define PWM_PCR_PWM01TYPE_Pos                             30
#define PWM_PCR_PWM01TYPE_Msk                             (0x01ul << PWM_PCR_PWM01TYPE_Pos)
#define PWM_PCR_PWM23TYPE_Pos                             31
#define PWM_PCR_PWM23TYPE_Msk                             (0x01ul << PWM_PCR_PWM23TYPE_Pos)


/**
  * @brief PWM Controller (PWM) - Register CNR [0/1/2/3]
  * 
  * @description PWM Group A Counter Register (CNR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 251-252
  * 
  * CNR0 = PWMA_BA+0x0C
  * CNR1 = PWMA_BA+0x18
  * CNR2 = PWMA_BA+0x24
  * CNR3 = PWMA_BA+0x30
  * 
  * 
  * PWM Timer Loaded Value
  * CNR determines the PWM period.
  * 
  * PWM frequency = PWMxy_CLK/[(prescale+1)*(clock divider)*(CNR+1)]
  * where xy could be 01, 23, depending on the selected PWM channel.
  * 
  * For Edge-aligned mode:
  *  - Duty ratio = (CMR+1)/(CNR+1).
  *  - CMR >= CNR: PWM output is always high.
  *  - CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
  *  - CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit
  * 
  * For Center-aligned mode:
  *  - Duty ratio = [(2 x CMR) + 1]/[2 x (CNR+1)].
  *  - CMR > CNR: PWM output is always high.
  *  - CMR <= CNR: PWM low width = 2 x (CNR-CMR) + 1 unit; PWM high width = (2 x CMR) + 1 unit.
  *  - CMR = 0: PWM low width = 2 x CNR + 1 unit; PWM high width = 1 unit
  * 
  * (1 Unit = one PWM clock cycle)
  * 
  * 
  * Note: Any write to CNR will take effect in the next PWM cycle.
  * Note: When CNR value is set to 0, PWM output is always high.
  * 
  * Note: When PWM operating at center-aligned type, CNR value should be set between
  * 0x0000 to 0xFFFE. If CNR equal to 0xFFFF, the PWM will work unpredictable.
  * 
  * Note: This one define should be used with the correct CNRn memory map offset from above.
  * 
  */

#define PWM_CNR_CNR_Pos                                   0
#define PWM_CNR_CNR_Msk                                   (0xFFFFul << PWM_CNR_CNR_Pos)
// Bits 16-31 are Reserved.

/**
  * @brief PWM Controller (PWM) - Register CMR [0/1/2/3]
  * 
  * @description PWM Group A Comparator Register (CMR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 253
  * 
  * CMR0 = PWMA_BA+0x10
  * CMR1 = PWMA_BA+0x1C
  * CMR2 = PWMA_BA+0x28
  * CMR3 = PWMA_BA+0x34
  * 
  * 
  * PWM Comparator Register
  * CMR determines the PWM duty.
  * 
  * PWM frequency = PWMxy_CLK/[(prescale+1)*(clock divider)*(CNR+1)]; where xy
  * could be 01, 23, 45 or 67, depending on the selected PWM channel.
  * 
  * For Edge-aligned mode:
  *  - Duty ratio = (CMR+1)/(CNR+1).
  *  - CMR >= CNR: PWM output is always high.
  *  - CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
  *  - CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit
  * 
  * For Center-aligned mode:
  *  - Duty ratio = [(2 x CMR) + 1]/[2 x (CNR+1)].
  *  - CMR > CNR: PWM output is always high.
  *  - CMR <= CNR: PWM low width = 2 x (CNR-CMR) + 1 unit; PWM high width = (2 x CMR) + 1 unit.
  *  - CMR = 0: PWM low width = 2 x CNR + 1 unit; PWM high width = 1 unit
  * 
  * (1 Unit = one PWM clock cycle)
  * 
  * Note: Any write to CMR will take effect in the next PWM cycle.
  * 
  * Note: This one define should be used with the correct CMRn memory map offset from above.
  * 
  */

