ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define PWM_CMR_CMR_Pos                                   0
#define PWM_CMR_CMR_Msk                                   (0xFFFFul << PWM_CMR_CMR_Pos)
// Bits 16-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register PDR [0/1/2/3]
  * 
  * @description PWM Group A Data Register (PDR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 254
  * 
  * PDR0 = PWMA_BA+0x14
  * PDR1 = PWMA_BA+0x20
  * PDR2 = PWMA_BA+0x2C
  * PDR3 = PWMA_BA+0x38
  * 
  * 
  * PWM Data Register
  * Software can monitor PDR to know the current value of the 16-bit down counter.
  * 
  * Note: This one define should be used with the correct PDRn memory map offset from above.
  * 
  */

#define PWM_PDR_PDR_Pos                                   0
#define PWM_PDR_PDR_Msk                                   (0xFFFFul << PWM_PDR_PDR_Pos)
// Bits 16-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register PIER
  * 
  * @description PWM Group A Interrupt Enable Register (PIER) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 255-256
  * 
  * PIER = PWMA_BA+0x40
  * 
  * 
  * PWMIE0 [0]
  * PWM Channel 0 Interrupt Enable
  * 
  * 1 = Enabled.
  * 0 = Disabled.
  * 
  * 
  * PWMIE1 [1]
  * PWM Channel 1 Interrupt Enable
  * 
  * 1 = Enabled.
  * 0 = Disabled.
  * 
  * 
  * PWMIE2 [2]
  * PWM Channel 2 Interrupt Enable
  * 
  * 1 = Enabled.
  * 0 = Disabled.
  * 
  * 
  * PWMIE3 [3]
  * PWM Channel 3 Interrupt Enable
  * 
  * 1 = Enabled.
  * 0 = Disabled.
  * 
  * 
  * PWMDIE0 [8]
  * PWM Channel 0 Duty Interrupt Enable
  * 
  * 1 = Enabled.
  * 0 = Disabled.
  * 
  * 
  * PWMDIE1 [9]
  * PWM Channel 1 Duty Interrupt Enable
  * 
  * 1 = Enabled.
  * 0 = Disabled.
  * 
  * 
  * PWMDIE2 [10]
  * PWM Channel 2 Duty Interrupt Enable
  * 
  * 1 = Enabled.
  * 0 = Disabled.
  * 
  * 
  * PWMDIE3 [11]
  * PWM Channel 3 Duty Interrupt Enable
  * 
  * 1 = Enabled.
  * 0 = Disabled.
  * 
  * 
  * INTTYPE01 [16]
  * PWM01 Interrupt Type Selection Bit (PWM0 and PWM1 Pair for PWM Group A)
  * 
  * 1 = PWMIFn will be set if PWM counter matches CNRn register.
  * 0 = PWMIFn will be set if PWM counter underflow.
  * 
  * Note: This bit is effective when PWM in central align mode only.
  * 
  * 
  * INTTYPE23 [17]
  * PWM12 Interrupt Type Selection Bit (PWM2 and PWM3 Pair for PWM Group A)
  * 
  * 1 = PWMIFn will be set if PWM counter matches CNRn register.
  * 0 = PWMIFn will be set if PWM counter underflow.
  * 
  * Note: This bit is effective when PWM in central align mode only.
  * 
  */

#define PWM_PIER_PWMIE0_Pos                               0
#define PWM_PIER_PWMIE0_Msk                               (0x01ul << PWM_PIER_PWMIE0_Pos)
#define PWM_PIER_PWMIE1_Pos                               1
#define PWM_PIER_PWMIE1_Msk                               (0x01ul << PWM_PIER_PWMIE1_Pos)
#define PWM_PIER_PWMIE2_Pos                               2
#define PWM_PIER_PWMIE2_Msk                               (0x01ul << PWM_PIER_PWMIE2_Pos)
#define PWM_PIER_PWMIE3_Pos                               3
#define PWM_PIER_PWMIE3_Msk                               (0x01ul << PWM_PIER_PWMIE3_Pos)
// Bits 4-7 are Reserved.
#define PWM_PIER_PWMDIE0_Pos                              8
#define PWM_PIER_PWMDIE0_Msk                              (0x01ul << PWM_PIER_PWMDIE0_Pos)
#define PWM_PIER_PWMDIE1_Pos                              9
#define PWM_PIER_PWMDIE1_Msk                              (0x01ul << PWM_PIER_PWMDIE1_Pos)
#define PWM_PIER_PWMDIE2_Pos                              10
#define PWM_PIER_PWMDIE2_Msk                              (0x01ul << PWM_PIER_PWMDIE2_Pos)
#define PWM_PIER_PWMDIE3_Pos                              11
#define PWM_PIER_PWMDIE3_Msk                              (0x01ul << PWM_PIER_PWMDIE3_Pos)
// Bits 12-15 are Reserved.
#define PWM_PIER_INT01TYPE_Pos                            16
#define PWM_PIER_INT01TYPE_Msk                            (0x01ul << PWM_PIER_INT01TYPE_Pos)
#define PWM_PIER_INT23TYPE_Pos                            17
#define PWM_PIER_INT23TYPE_Msk                            (0x01ul << PWM_PIER_INT23TYPE_Pos)
// Bits 18-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register PIIR
  * 
  * @description PWM Group A Interrupt Indication Register (PIIR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 257-258
  * 
  * PIIR = PWMA_BA+0x44
  * 
  * 
  * PWMIF0 [0]
  * PWM channel 0 Interrupt Status
  * 
  * This bit is set by hardware when PWM0 counter reaches the requirement of interrupt
  * (depending on INTTYPE01 bit of PIER register) if PWM0 interrupt enable bit (PWMIE0)
  * is 1, software can write 1 to clear this bit to zero.
  * 
  * 
  * PWMIF1 [1]
  * PWM channel 1 Interrupt Status
  * 
  * This bit is set by hardware when PWM1 counter reaches the requirement of interrupt
  * (depending on INTTYPE01 bit of PIER register) if PWM1 interrupt enable bit (PWMIE1)
  * is 1, software can write 1 to clear this bit to zero.
  * 
  * 
  * PWMIF2 [2]
  * PWM channel 2 Interrupt Status
  * 
  * This bit is set by hardware when PWM2 counter reaches the requirement of interrupt
  * (depending on INTTYPE23 bit of PIER register) if PWM2 interrupt enable bit (PWMIE2)
  * is 1, software can write 1 to clear this bit to zero.
  * 
  * 
  * PWMIF3 [3]
  * PWM channel 3 Interrupt Status
  * 
  * This bit is set by hardware when PWM3 counter reaches the requirement of interrupt
  * (depending on INTTYPE23 bit of PIER register) if PWM3 interrupt enable bit (PWMIE3)
  * is 1, software can write 1 to clear this bit to zero.
  * 
  * 
  * PWMDIF0 [8]
  * PWM channel 0 Duty Interrupt Flag
  * 
  * Flag is set by hardware when channel 0 PWM counter down-count and reaches CMR0.
  * Software can clear this bit by writing a 1.
  * 
  * Note: If CMR is equal to CNR, this flag will not function.
  * 
  * 
  * PWMDIF1 [9]
  * PWM channel 1 Duty Interrupt Flag
  * 
  * Flag is set by hardware when channel 1 PWM counter down-count and reaches CMR1.
  * Software can clear this bit by writing a 1.
  * 
  * Note: If CMR is equal to CNR, this flag will not function.
  * 
  * 
  * PWMDIF2 [10]
  * PWM channel 2 Duty Interrupt Flag
  * 
  * Flag is set by hardware when channel 2 PWM counter down-count and reaches CMR2.
  * Software can clear this bit by writing a 1.
  * 
  * Note: If CMR is equal to CNR, this flag will not function.
  * 
  * 
  * PWMDIF3 [11]
  * PWM channel 3 Duty Interrupt Flag
  * 
  * Flag is set by hardware when channel 3 PWM counter down-count and reaches CMR3.
  * Software can clear this bit by writing a 1.
  * 
  * Note: If CMR is equal to CNR, this flag will not function.
  * 
  */

#define PWM_PIIR_PWMIF0_Pos                               0
#define PWM_PIIR_PWMIF0_Msk                               (0x01ul << PWM_PIIR_PWMIF0_Pos)
#define PWM_PIIR_PWMIF1_Pos                               1
#define PWM_PIIR_PWMIF1_Msk                               (0x01ul << PWM_PIIR_PWMIF1_Pos)
#define PWM_PIIR_PWMIF2_Pos                               2
#define PWM_PIIR_PWMIF2_Msk                               (0x01ul << PWM_PIIR_PWMIF2_Pos)
#define PWM_PIIR_PWMIF3_Pos                               3
#define PWM_PIIR_PWMIF3_Msk                               (0x01ul << PWM_PIIR_PWMIF3_Pos)
// Bits 4-7 are Reserved.
#define PWM_PIIR_PWMDIF0_Pos                              8
#define PWM_PIIR_PWMDIF0_Msk                              (0x01ul << PWM_PIIR_PWMDIF0_Pos)
#define PWM_PIIR_PWMDIF1_Pos                              9
#define PWM_PIIR_PWMDIF1_Msk                              (0x01ul << PWM_PIIR_PWMDIF1_Pos)
#define PWM_PIIR_PWMDIF2_Pos                              10
#define PWM_PIIR_PWMDIF2_Msk                              (0x01ul << PWM_PIIR_PWMDIF2_Pos)
#define PWM_PIIR_PWMDIF3_Pos                              11
#define PWM_PIIR_PWMDIF3_Msk                              (0x01ul << PWM_PIIR_PWMDIF3_Pos)
// Bits 12-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register CCR0
  * 
  * @description PWM Group A Capture Control Register (CCR0) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 259-261
  * 
  * CCR0 = PWMA_BA+0x50
  * 
  * 
  * INV0 [0]
  * Channel 0 Inverter Enable
  * 
  * 1 = Inverter Enabled. Reverse the input signal from GPIO before fed to Capture timer
  * 0 = Inverter Disabled
  * 
  * 
  * CRL_IE0 [1]
  * Channel 0 Rising Latch Interrupt Enable
  * 
  * 1 = Rising latch interrupt Enabled.
  * 0 = Rising latch interrupt Disabled.
  * 
  * When Enabled, if capture detects PWM group channel 0 has rising transition, capture
  * issues an Interrupt.
  * 
  * 
  * CFL_IE0 [2]
  * Channel 0 Falling Latch Interrupt Enable
  * 
  * 1 = Falling latch interrupt Enabled.
  * 0 = Falling latch interrupt Disabled.
  * 
  * When Enabled, if capture detects PWM group channel 0 has falling transition, capture
  * issues an Interrupt.
  * 
  * 
  * CAPCH0EN [3]
  * Channel 0 Capture Function Enable
  * 
  * 1 = Capture function on PWM group channel 0 Enabled.
  * 0 = Capture function on PWM group channel 0 Disabled.
  * 
  * When Enabled, Capture latched the PWM-counter value and saved to CRLR (Rising
  * latch) and CFLR (Falling latch).
  * When Disabled, capture does not update CRLR and CFLR, and disable PWM group
  * channel 0 Interrupt.
  * 
  * 
  * CAPIF0 [4]
  * Channel 0 Capture Interrupt Indication Flag
  * 
  * If PWM group channel 0 rising latch interrupt is enabled (CRL_IE0=1), a rising
  * transition occurs at PWM group channel 0 will result in CAPIF0 to high.
  * A falling transition will cause CAPIF0 to be set high if PWM group channel 0 falling latch
  * interrupt is enabled (CFL_IE0=1).
  * 
  * Write 1 to clear this bit.
  * 
  * 
  * CRLRI0 [6]
  * CRLR0 Latched Indicator Bit
  * 
  * When PWM group input channel 0 has a rising transition, CRLR0 was latched with the
  * value of PWM down-counter and this bit is set by hardware.
  * Software can write 0 to clear this bit if BCn bit is 0, and can write 1 to clear this
  * bit if BCn bit is 1.
  * 
  * 
  * CFLRI0 [7]
  * CFLR0 Latched Indicator Bit
  * 
  * When PWM group input channel 0 has a falling transition, CFLR0 was latched with the
  * value of PWM down-counter and this bit is set by hardware.
  * Software can write 0 to clear this bit if BCn bit is 0, and can write 1 to clear this
  * bit if BCn bit is 1.
  * 
  * 
  * INV1 [16]
  * Channel 1 Inverter Enable
  * 
  * 1 = Inverter Enabled. Reverse the input signal from GPIO before fed to Capture timer
  * 0 = Inverter Disabled
  * 
  * 
  * CRL_IE1 [17]
  * Channel 1 Rising Latch Interrupt Enable
  * 
  * 1 = Rising latch interrupt Enabled.
  * 0 = Rising latch interrupt Disabled.
  * 
  * When Enabled, if capture detects PWM group channel 1 has rising transition, capture
  * issues an Interrupt.
  * 
  * 
  * CFL_IE1 [18]
  * Channel 1 Falling Latch Interrupt Enable
  * 
  * 1 = Falling latch interrupt Enabled.
  * 0 = Falling latch interrupt Disabled.
  * 
  * When Enabled, if capture detects PWM group channel 1 has falling transition, capture
  * issues an Interrupt.
  * 
  * 
  * CAPCH1EN [19]
  * Channel 1 Capture Function Enable
  * 
  * 1 = Capture function on PWM group channel 1 Enabled.
  * 0 = Capture function on PWM group channel 1 Disabled.
  * 
  * When Enabled, Capture latched the PWM-counter value and saved to CRLR (Rising
  * latch) and CFLR (Falling latch).
  * When Disabled, capture does not update CRLR and CFLR, and disable PWM group
  * channel 1 Interrupt.
  * 
  * 
  * CAPIF1 [20]
  * Channel 1 Capture Interrupt Indication Flag
  * 
  * If PWM group channel 1 rising latch interrupt is enabled (CRL_IE1=1), a rising
  * transition occurs at PWM group channel 1 will result in CAPIF1 to high.
  * A falling transition will cause CAPIF1 to be set high if PWM group channel 1 falling latch
  * interrupt is enabled (CFL_IE1=1).
  * 
  * Write 1 to clear this bit.
  * 
  * 
  * CRLRI1 [22]
  * CRLR1 Latched Indicator Bit
  * 
  * When PWM group input channel 1 has a rising transition, CRLR1 was latched with the
  * value of PWM down-counter and this bit is set by hardware.
  * Software can write 0 to clear this bit if BCn bit is 0, and can write 1 to clear this
  * bit if BCn bit is 1.
  * 
  * 
  * CFLRI1 [23]
  * CFLR1 Latched Indicator Bit
  * 
  * When PWM group input channel 1 has a falling transition, CFLR1 was latched with the
  * value of PWM down-counter and this bit is set by hardware.
  * Software can write 0 to clear this bit if BCn bit is 0, and can write 1 to clear this
  * bit if BCn bit is 1.
  * 
  */

