ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define PWM_CCR0_INV0_Pos                                 0
#define PWM_CCR0_INV0_Msk                                 (0x01ul << PWM_CCR0_INV0_Pos)
#define PWM_CCR0_CRL_IE0_Pos                              1
#define PWM_CCR0_CRL_IE0_Msk                              (0x01ul << PWM_CCR0_CRL_IE0_Pos)
#define PWM_CCR0_CFL_IE0_Pos                              2
#define PWM_CCR0_CFL_IE0_Msk                              (0x01ul << PWM_CCR0_CFL_IE0_Pos)
#define PWM_CCR0_CAPCH0EN_Pos                             3
#define PWM_CCR0_CAPCH0EN_Msk                             (0x01ul << PWM_CCR0_CAPCH0EN_Pos)
#define PWM_CCR0_CAPIF0_Pos                               4
#define PWM_CCR0_CAPIF0_Msk                               (0x01ul << PWM_CCR0_CAPIF0_Pos)
// Bit 5 is Reserved.
#define PWM_CCR0_CRLRI0_Pos                               6
#define PWM_CCR0_CRLRI0_Msk                               (0x01ul << PWM_CCR0_CRLRI0_Pos)
#define PWM_CCR0_CFLRI0_Pos                               7
#define PWM_CCR0_CFLRI0_Msk                               (0x01ul << PWM_CCR0_CFLRI0_Pos)
// Bits 8-15 are Reserved.
#define PWM_CCR0_INV1_Pos                                 16
#define PWM_CCR0_INV1_Msk                                 (0x01ul << PWM_CCR0_INV1_Pos)
#define PWM_CCR0_CRL_IE1_Pos                              17
#define PWM_CCR0_CRL_IE1_Msk                              (0x01ul << PWM_CCR0_CRL_IE1_Pos)
#define PWM_CCR0_CFL_IE1_Pos                              18
#define PWM_CCR0_CFL_IE1_Msk                              (0x01ul << PWM_CCR0_CFL_IE1_Pos)
#define PWM_CCR0_CAPCH1EN_Pos                             19
#define PWM_CCR0_CAPCH1EN_Msk                             (0x01ul << PWM_CCR0_CAPCH1EN_Pos)
#define PWM_CCR0_CAPIF1_Pos                               20
#define PWM_CCR0_CAPIF1_Msk                               (0x01ul << PWM_CCR0_CAPIF1_Pos)
// Bit 21 is Reserved.
#define PWM_CCR0_CRLRI1_Pos                               22
#define PWM_CCR0_CRLRI1_Msk                               (0x01ul << PWM_CCR0_CRLRI1_Pos)
#define PWM_CCR0_CFLRI1_Pos                               23
#define PWM_CCR0_CFLRI1_Msk                               (0x01ul << PWM_CCR0_CFLRI1_Pos)
// Bits 24-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register CCR2
  * 
  * @description PWM Group A Capture Control Register (CCR2) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 262-264
  * 
  * CCR2 = PWMA_BA+0x54
  * 
  * 
  * INV2 [0]
  * Channel 2 Inverter Enable
  * 
  * 1 = Inverter Enabled. Reverse the input signal from GPIO before fed to Capture timer
  * 0 = Inverter Disabled
  * 
  * 
  * CRL_IE2 [1]
  * Channel 2 Rising Latch Interrupt Enable
  * 
  * 1 = Rising latch interrupt Enabled.
  * 0 = Rising latch interrupt Disabled.
  * 
  * When Enabled, if capture detects PWM group channel 2 has rising transition, capture
  * issues an Interrupt.
  * 
  * 
  * CFL_IE2 [2]
  * Channel 2 Falling Latch Interrupt Enable
  * 
  * 1 = Falling latch interrupt Enabled.
  * 0 = Falling latch interrupt Disabled.
  * 
  * When Enabled, if capture detects PWM group channel 2 has falling transition, capture
  * issues an Interrupt.
  * 
  * 
  * CAPCH2EN [3]
  * Channel 2 Capture Function Enable
  * 
  * 1 = Capture function on PWM group channel 2 Enabled.
  * 0 = Capture function on PWM group channel 2 Disabled.
  * 
  * When Enabled, Capture latched the PWM-counter value and saved to CRLR (Rising
  * latch) and CFLR (Falling latch).
  * When Disabled, capture does not update CRLR and CFLR, and disable PWM group
  * channel 2 Interrupt.
  * 
  * 
  * CAPIF2 [4]
  * Channel 2 Capture Interrupt Indication Flag
  * 
  * If PWM group channel 2 rising latch interrupt is enabled (CRL_IE2=1), a rising
  * transition occurs at PWM group channel 2 will result in CAPIF2 to high.
  * A falling transition will cause CAPIF2 to be set high if PWM group channel 2 falling latch
  * interrupt is enabled (CFL_IE2=1).
  * 
  * Write 1 to clear this bit.
  * 
  * 
  * CRLRI2 [6]
  * CRLR2 Latched Indicator Bit
  * 
  * When PWM group input channel 2 has a rising transition, CRLR2 was latched with the
  * value of PWM down-counter and this bit is set by hardware.
  * Software can write 0 to clear this bit if BCn bit is 0, and can write 1 to clear this
  * bit if BCn bit is 1.
  * 
  * 
  * CFLRI2 [7]
  * CFLR2 Latched Indicator Bit
  * 
  * When PWM group input channel 2 has a falling transition, CFLR2 was latched with the
  * value of PWM down-counter and this bit is set by hardware.
  * Software can write 0 to clear this bit if BCn bit is 0, and can write 1 to clear this
  * bit if BCn bit is 1.
  * 
  * 
  * INV3 [16]
  * Channel 3 Inverter Enable
  * 
  * 1 = Inverter Enabled. Reverse the input signal from GPIO before fed to Capture timer
  * 0 = Inverter Disabled
  * 
  * 
  * CRL_IE3 [17]
  * Channel 3 Rising Latch Interrupt Enable
  * 
  * 1 = Rising latch interrupt Enabled.
  * 0 = Rising latch interrupt Disabled.
  * 
  * When Enabled, if capture detects PWM group channel 3 has rising transition, capture
  * issues an Interrupt.
  * 
  * 
  * CFL_IE3 [18]
  * Channel 3 Falling Latch Interrupt Enable
  * 
  * 1 = Falling latch interrupt Enabled.
  * 0 = Falling latch interrupt Disabled.
  * 
  * When Enabled, if capture detects PWM group channel 3 has falling transition, capture
  * issues an Interrupt.
  * 
  * 
  * CAPCH3EN [19]
  * Channel 3 Capture Function Enable
  * 
  * 1 = Capture function on PWM group channel 3 Enabled.
  * 0 = Capture function on PWM group channel 3 Disabled.
  * 
  * When Enabled, Capture latched the PWM-counter value and saved to CRLR (Rising
  * latch) and CFLR (Falling latch).
  * When Disabled, capture does not update CRLR and CFLR, and disable PWM group
  * channel 3 Interrupt.
  * 
  * 
  * CAPIF3 [20]
  * Channel 3 Capture Interrupt Indication Flag
  * 
  * If PWM group channel 3 rising latch interrupt is enabled (CRL_IE3=1), a rising
  * transition occurs at PWM group channel 3 will result in CAPIF3 to high.
  * A falling transition will cause CAPIF3 to be set high if PWM group channel 3 falling latch
  * interrupt is enabled (CFL_IE3=1).
  * 
  * Write 1 to clear this bit.
  * 
  * 
  * CRLRI3 [22]
  * CRLR3 Latched Indicator Bit
  * 
  * When PWM group input channel 3 has a rising transition, CRLR3 was latched with the
  * value of PWM down-counter and this bit is set by hardware.
  * Software can write 0 to clear this bit if BCn bit is 0, and can write 1 to clear this
  * bit if BCn bit is 1.
  * 
  * 
  * CFLRI3 [23]
  * CFLR3 Latched Indicator Bit
  * 
  * When PWM group input channel 3 has a falling transition, CFLR3 was latched with the
  * value of PWM down-counter and this bit is set by hardware.
  * Software can write 0 to clear this bit if BCn bit is 0, and can write 1 to clear this
  * bit if BCn bit is 1.
  * 
  */

#define PWM_CCR2_INV2_Pos                                 0
#define PWM_CCR2_INV2_Msk                                 (0x01ul << PWM_CCR2_INV2_Pos)
#define PWM_CCR2_CRL_IE2_Pos                              1
#define PWM_CCR2_CRL_IE2_Msk                              (0x01ul << PWM_CCR2_CRL_IE2_Pos)
#define PWM_CCR2_CFL_IE2_Pos                              2
#define PWM_CCR2_CFL_IE2_Msk                              (0x01ul << PWM_CCR2_CFL_IE2_Pos)
#define PWM_CCR2_CAPCH2EN_Pos                             3
#define PWM_CCR2_CAPCH2EN_Msk                             (0x01ul << PWM_CCR2_CAPCH2EN_Pos)
#define PWM_CCR2_CAPIF2_Pos                               4
#define PWM_CCR2_CAPIF2_Msk                               (0x01ul << PWM_CCR2_CAPIF2_Pos)
// Bit 5 is Reserved.
#define PWM_CCR2_CRLRI2_Pos                               6
#define PWM_CCR2_CRLRI2_Msk                               (0x01ul << PWM_CCR2_CRLRI2_Pos)
#define PWM_CCR2_CFLRI2_Pos                               7
#define PWM_CCR2_CFLRI2_Msk                               (0x01ul << PWM_CCR2_CFLRI2_Pos)
// Bits 8-15 are Reserved.
#define PWM_CCR2_INV3_Pos                                 16
#define PWM_CCR2_INV3_Msk                                 (0x01ul << PWM_CCR2_INV3_Pos)
#define PWM_CCR2_CRL_IE3_Pos                              17
#define PWM_CCR2_CRL_IE3_Msk                              (0x01ul << PWM_CCR2_CRL_IE3_Pos)
#define PWM_CCR2_CFL_IE3_Pos                              18
#define PWM_CCR2_CFL_IE3_Msk                              (0x01ul << PWM_CCR2_CFL_IE3_Pos)
#define PWM_CCR2_CAPCH3EN_Pos                             19
#define PWM_CCR2_CAPCH3EN_Msk                             (0x01ul << PWM_CCR2_CAPCH3EN_Pos)
#define PWM_CCR2_CAPIF3_Pos                               20
#define PWM_CCR2_CAPIF3_Msk                               (0x01ul << PWM_CCR2_CAPIF3_Pos)
// Bit 21 is Reserved.
#define PWM_CCR2_CRLRI3_Pos                               22
#define PWM_CCR2_CRLRI3_Msk                               (0x01ul << PWM_CCR2_CRLRI3_Pos)
#define PWM_CCR2_CFLRI3_Pos                               23
#define PWM_CCR2_CFLRI3_Msk                               (0x01ul << PWM_CCR2_CFLRI3_Pos)
// Bits 24-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register CRLR [0/1/2/3]
  * 
  * @description PWM Group A Capture Rising Latch Register (CRLR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 265
  * 
  * CRLR0 = PWMA_BA+0x58
  * CRLR1 = PWMA_BA+0x60
  * CRLR2 = PWMA_BA+0x68
  * CRLR3 = PWMA_BA+0x70
  * 
  * 
  * Capture Rising Latch Register
  * Latch the PWM counter when Channel 0/1/2/3 has a Rising transition.
  * 
  * Note: This one define should be used with the correct CRLRn memory map offset from above.
  * 
  */

#define PWM_CRLR_CRLR_Pos                                 0
#define PWM_CRLR_CRLR_Msk                                 (0xFFFFul << PWM_CRLR_CRLR_Pos)
// Bits 16-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register CFLR [0/1/2/3]
  * 
  * @description PWM Group A Capture Falling Latch Register (CFLR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 266
  * 
  * CFLR0 = PWMA_BA+0x5C
  * CFLR1 = PWMA_BA+0x64
  * CFLR2 = PWMA_BA+0x6C
  * CFLR3 = PWMA_BA+0x74
  * 
  * 
  * Capture Falling Latch Register
  * Latch the PWM counter when Channel 0/1/2/3 has a Falling transition.
  * 
  * Note: This one define should be used with the correct CFLRn memory map offset from above.
  * 
  */

#define PWM_CFLR_CFLR_Pos                                 0
#define PWM_CFLR_CFLR_Msk                                 (0xFFFFul << PWM_CFLR_CFLR_Pos)
// Bits 16-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register CAPENR
  * 
  * @description PWM Group A Capture Input Enable Register (CAPENR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 267
  * 
  * CAPENR = PWMA_BA+0x78
  * 
  * 
  * Capture Input Enable Register
  * 
  * There are four capture inputs from pad. Bit0~Bit3 are used to control each input enable
  * or disable.
  * 
  * 0 = Disabled (PWMx multi-function pin input does not affect input capture function.)
  * 1 = Enabled (PWMx multi-function pin input will affect its input capture function.)
  * 
  * Bit 3210 for PWM group A
  * Bit xxx1 -> Capture channel 0 is from pin PA.12
  * Bit xx1x -> Capture channel 1 is from pin PA.13
  * Bit x1xx -> Capture channel 2 is from pin PA.14
  * Bit 1xxx -> Capture channel 3 is from pin PA.15
  * 
  */

#define PWM_CAPENR_CAPENR_Pos                             0
#define PWM_CAPENR_CAPENR_Msk                             (0x0Ful << PWM_CAPENR_CAPENR_Pos)
// Bits 4-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register POE
  * 
  * @description PWM Group A Output Enable Register (POE) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 268
  * 
  * POE = PWMA_BA+0x7C
  * 
  * 
  * PWM0 [0]
  * Channel 0 Output Enable Register
  * 
  * 1 = PWM channel 0 output to pin Enabled.
  * 0 = PWM channel 0 output to pin Disabled.
  * 
  * 
  * PWM1 [1]
  * Channel 1 Output Enable Register
  * 
  * 1 = PWM channel 1 output to pin Enabled.
  * 0 = PWM channel 1 output to pin Disabled.
  * 
  * 
  * PWM2 [2]
  * Channel 2 Output Enable Register
  * 
  * 1 = PWM channel 2 output to pin Enabled.
  * 0 = PWM channel 2 output to pin Disabled.
  * 
  * 
  * PWM3 [3]
  * Channel 3 Output Enable Register
  * 
  * 1 = PWM channel 3 output to pin Enabled.
  * 0 = PWM channel 3 output to pin Disabled.
  * 
  * Note: The corresponding GPIO pin must also be switched to PWM function for
  * each needed PWM channel.
  * 
  */

#define PWM_POE_PWM0_Pos                                  0
#define PWM_POE_PWM0_Msk                                  (0x01ul << PWM_POE_PWM0_Pos)
#define PWM_POE_PWM1_Pos                                  1
#define PWM_POE_PWM1_Msk                                  (0x01ul << PWM_POE_PWM1_Pos)
#define PWM_POE_PWM2_Pos                                  2
#define PWM_POE_PWM2_Msk                                  (0x01ul << PWM_POE_PWM2_Pos)
#define PWM_POE_PWM3_Pos                                  3
#define PWM_POE_PWM3_Msk                                  (0x01ul << PWM_POE_PWM3_Pos)
// Bits 4-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register TCON
  * 
  * @description PWM Group A Trigger Control Register (TCON) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 269-270
  * 
  * TCON = PWMA_BA+0x80
  * 
  * 
  * PWM0TEN [0]
  * Channel 0 Center-Aligned Trigger Enable Register
  * 
  * 1 = PWM channel 0 trigger ADC function Enabled.
  * 0 = PWM channel 0 trigger ADC function Disabled.
  * 
  * PWM can trigger ADC to start conversion when PWM counter counts up to CNR
  * if this bit is set to 1.
  * 
  * 
  * PWM1TEN [1]
  * Channel 1 Center-Aligned Trigger Enable Register
  * 
  * 1 = PWM channel 1 trigger ADC function Enabled.
  * 0 = PWM channel 1 trigger ADC function Disabled.
  * 
  * PWM can trigger ADC to start conversion when PWM counter counts up to CNR
  * if this bit is set to 1.
  * 
  * 
  * PWM2TEN [2]
  * Channel 2 Center-Aligned Trigger Enable Register
  * 
  * 1 = PWM channel 2 trigger ADC function Enabled.
  * 0 = PWM channel 2 trigger ADC function Disabled.
  * 
  * PWM can trigger ADC to start conversion when PWM counter counts up to CNR
  * if this bit is set to 1.
  * 
  * 
  * PWM3TEN [3]
  * Channel 3 Center-Aligned Trigger Enable Register
  * 
  * 1 = PWM channel 3 trigger ADC function Enabled.
  * 0 = PWM channel 3 trigger ADC function Disabled.
  * 
  * PWM can trigger ADC to start conversion when PWM counter counts up to CNR
  * if this bit is set to 1.
  * 
  * 
  * Note: These functions are only supported when the relevant PWM is operating in
  * Center-aligned mode.
  * 
  */

#define PWM_TCON_PWM0TEN_Pos                              0
#define PWM_TCON_PWM0TEN_Msk                              (0x01ul << PWM_TCON_PWM0TEN_Pos)
#define PWM_TCON_PWM1TEN_Pos                              1
#define PWM_TCON_PWM1TEN_Msk                              (0x01ul << PWM_TCON_PWM1TEN_Pos)
#define PWM_TCON_PWM2TEN_Pos                              2
#define PWM_TCON_PWM2TEN_Msk                              (0x01ul << PWM_TCON_PWM2TEN_Pos)
#define PWM_TCON_PWM3TEN_Pos                              3
#define PWM_TCON_PWM3TEN_Msk                              (0x01ul << PWM_TCON_PWM3TEN_Pos)
// Bits 4-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register TSTATUS
  * 
  * @description PWM Group A Trigger Status Register (TSTATUS) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 271
  * 
  * TSTATUS = PWMA_BA+0x84
  * 
  * 
  * PWM0TF [0]
  * Channel 0 Center-aligned Trigger Flag
  * 
  * For Center-aligned operating mode, this bit is set to 1 by hardware when PWM
  * counter up count to CNR if PWM0TEN bit is set to 1. After this bit is set to 1, ADC
  * will start conversion if ADC triggered source is selected by PWM.
  * 
  * 
  * PWM1TF [1]
  * Channel 1 Center-aligned Trigger Flag
  * 
  * For Center-aligned operating mode, this bit is set to 1 by hardware when PWM
  * counter up count to CNR if PWM1TEN bit is set to 1. After this bit is set to 1, ADC
  * will start conversion if ADC triggered source is selected by PWM.
  * 
  * 
  * PWM2TF [2]
  * Channel 2 Center-aligned Trigger Flag
  * 
  * For Center-aligned operating mode, this bit is set to 1 by hardware when PWM
  * counter up count to CNR if PWM2TEN bit is set to 1. After this bit is set to 1, ADC
  * will start conversion if ADC triggered source is selected by PWM.
  * 
  * 
  * PWM3TF [3]
  * Channel 3 Center-aligned Trigger Flag
  * 
  * For Center-aligned operating mode, this bit is set to 1 by hardware when PWM
  * counter up count to CNR if PWM3TEN bit is set to 1. After this bit is set to 1, ADC
  * will start conversion if ADC triggered source is selected by PWM.
  * 
  * 
  * Software can write 1 to each of these bits to clear.
  * 
  */

#define PWM_TSTATUS_PWM0TF_Pos                            0
#define PWM_TSTATUS_PWM0TF_Msk                            (0x01ul << PWM_TSTATUS_PWM0TF_Pos)
#define PWM_TSTATUS_PWM1TF_Pos                            1
#define PWM_TSTATUS_PWM1TF_Msk                            (0x01ul << PWM_TSTATUS_PWM1TF_Pos)
#define PWM_TSTATUS_PWM2TF_Pos                            2
#define PWM_TSTATUS_PWM2TF_Msk                            (0x01ul << PWM_TSTATUS_PWM2TF_Pos)
#define PWM_TSTATUS_PWM3TF_Pos                            3
#define PWM_TSTATUS_PWM3TF_Msk                            (0x01ul << PWM_TSTATUS_PWM3TF_Pos)
// Bits 4-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register SYNCBUSY0
  * 
  * @description PWM Group A PWM0 Sync Busy Status Register (SYNCBUSY0) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 272
  * 
  * SYNCBUSY0 = PWMA_BA+0x88
  * 
  * 
  * PWM Synchronous Busy
  * 
  * When software writes CNR0/CMR0/PPR or switch PWM0 operation mode
  * (PCR[3]), PWM will have a busy time to update these values completely because
  * PWM clock may be different from system clock domain. Software needs to check
  * this busy status before writes CNR0/CMR0/PPR or switch PWM0 operation mode
  * (PCR[3]) to make sure previous setting has been update completely.
  * 
  * This bit will be set when software write CNR0/CMR0/PPR or switch PWM0
  * operation mode (PCR[3]) and will be cleared by hardware automatically when
  * PWM update these value completely.
  * 
  */

#define PWM_SYNCBUSY0_S_BUSY_Pos                          0
#define PWM_SYNCBUSY0_S_BUSY_Msk                          (0x01ul << PWM_SYNCBUSY0_S_BUSY_Pos)


/**
  * @brief PWM Controller (PWM) - Register SYNCBUSY1
  * 
  * @description PWM Group A PWM1 Sync Busy Status Register (SYNCBUSY1) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 273
  * 
  * SYNCBUSY1 = PWMA_BA+0x8C
  * 
  * 
  * PWM Synchronous Busy
  * 
  * When software writes CNR1/CMR1/PPR or switch PWM1 operation mode
  * (PCR[11]), PWM will have a busy time to update these values completely because
  * PWM clock may be different from system clock domain. Software needs to check
  * this busy status before writes CNR1/CMR1/PPR or switch PWM1 operation mode
  * (PCR[11]) to make sure previous setting has been update completely.
  * 
  * This bit will be set when software write CNR1/CMR1/PPR or switch PWM1
  * operation mode (PCR[11]) and will be cleared by hardware automatically when
  * PWM update these value completely.
  * 
  */

#define PWM_SYNCBUSY1_S_BUSY_Pos                          0
#define PWM_SYNCBUSY1_S_BUSY_Msk                          (0x01ul << PWM_SYNCBUSY1_S_BUSY_Pos)


/**
  * @brief PWM Controller (PWM) - Register SYNCBUSY2
  * 
  * @description PWM Group A PWM2 Sync Busy Status Register (SYNCBUSY2) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 274
  * 
  * SYNCBUSY2 = PWMA_BA+0x90
  * 
  * 
  * PWM Synchronous Busy
  * 
  * When software writes CNR2/CMR2/PPR or switch PWM2 operation mode
  * (PCR[19]), PWM will have a busy time to update these values completely because
  * PWM clock may be different from system clock domain. Software needs to check
  * this busy status before writes CNR2/CMR2/PPR or switch PWM2 operation mode
  * (PCR[19]) to make sure previous setting has been update completely.
  * 
  * This bit will be set when software write CNR2/CMR2/PPR or switch PWM2
  * operation mode (PCR[19]) and will be cleared by hardware automatically when
  * PWM update these value completely.
  * 
  */

#define PWM_SYNCBUSY2_S_BUSY_Pos                          0
#define PWM_SYNCBUSY2_S_BUSY_Msk                          (0x01ul << PWM_SYNCBUSY2_S_BUSY_Pos)


/**
  * @brief PWM Controller (PWM) - Register SYNCBUSY3
  * 
  * @description PWM Group A PWM3 Sync Busy Status Register (SYNCBUSY3) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 275
  * 
  * SYNCBUSY3 = PWMA_BA+0x94
  * 
  * 
  * PWM Synchronous Busy
  * 
  * When software writes CNR3/CMR3/PPR or switch PWM3 operation mode
  * (PCR[27]), PWM will have a busy time to update these values completely because
  * PWM clock may be different from system clock domain. Software needs to check
  * this busy status before writes CNR3/CMR3/PPR or switch PWM3 operation mode
  * (PCR[27]) to make sure previous setting has been update completely.
  * 
  * This bit will be set when software write CNR3/CMR3PPR or switch PWM3
  * operation mode (PCR[27]) and will be cleared by hardware automatically when
  * PWM update these value completely.
  * 
  */

