ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define PWM_SYNCBUSY3_S_BUSY_Pos                          0
#define PWM_SYNCBUSY3_S_BUSY_Msk                          (0x01ul << PWM_SYNCBUSY3_S_BUSY_Pos)


/**
  * @brief PWM Controller (PWM) - Register CAPPDMACTL
  * 
  * @description PWM Group A PDMA Control Register (CAPPDMACTL) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 276-277
  * 
  * CAPPDMACTL = PWMA_BA+0xC0
  * 
  * 
  * CAP0PDMAEN [0]
  * Channel 0 PDMA Enable
  * 
  * 1 = Channel 0 PDMA function Enabled for the channel 0 captured data and
  *     transfer to memory.
  * 0 = Channel 0 PDMA function Disabled.
  * 
  * 
  * CAP0PDMAMOD [1:2]
  * Select CRLR0 or CFLR0 to Transfer PDMA
  * 
  * 00 = Reserved
  * 01 = CFLR0
  * 10 = CRLR0
  * 11 = Both CRLR0 and CFLR0
  * 
  * 
  * CAP0RFORDER [3]
  * Set this bit to determine whether the CRLR0 or CFLR0 is the first captured
  * data transferred to memory through PDMA when CAP0PDMAMOD =11
  * 
  * 1 = CRLR0 is the first captured data to memory.
  * 0 = CFLR0 is the first captured data to memory.
  * 
  * 
  * CAP1PDMAEN [8]
  * Channel 1 PDMA Enable
  * 
  * 1 = Channel 1 PDMA function Enabled for the channel 1 captured data and
  *     transfer to memory.
  * 0 = Channel 1 PDMA function Disabled.
  * 
  * 
  * CAP1PDMAMOD [9:10]
  * Select CRLR1 or CFLR1 to Transfer PDMA
  * 
  * 00 = Reserved
  * 01 = CFLR1
  * 10 = CRLR1
  * 11 = Both CRLR1 and CFLR1
  * 
  * 
  * CAP1RFORDER [11]
  * Set this bit to determine whether the CRLR1 or CFLR1 is the first captured
  * data transferred to memory through PDMA when CAP1PDMAMOD =11
  * 
  * 1 = CRLR1 is the first captured data to memory.
  * 0 = CFLR1 is the first captured data to memory.
  * 
  * 
  * CAP2PDMAEN [16]
  * Channel 2 PDMA Enable
  * 
  * 1 = Channel 2 PDMA function Enabled for the channel 2 captured data and
  *     transfer to memory.
  * 0 = Channel 2 PDMA function Disabled.
  * 
  * 
  * CAP2PDMAMOD [17:18]
  * Select CRLR2 or CFLR2 to Transfer PDMA
  * 
  * 00 = Reserved
  * 01 = CFLR2
  * 10 = CRLR2
  * 11 = Both CRLR2 and CFLR2
  * 
  * 
  * CAP2RFORDER [19]
  * Set this bit to determine whether the CRLR2 or CFLR2 is the first captured
  * data transferred to memory through PDMA when CAP2PDMAMOD =11
  * 
  * 1 = CRLR2 is the first captured data to memory.
  * 0 = CFLR2 is the first captured data to memory.
  * 
  * 
  * CAP3PDMAEN [24]
  * Channel 3 PDMA Enable
  * 
  * 1 = Channel 3 PDMA function Enabled for the channel 3 captured data and
  *     transfer to memory.
  * 0 = Channel 3 PDMA function Disabled.
  * 
  * 
  * CAP3PDMAMOD [25:26]
  * Select CRLR3 or CFLR3 to Transfer PDMA
  * 
  * 00 = Reserved
  * 01 = CFLR3
  * 10 = CRLR3
  * 11 = Both CRLR3 and CFLR3
  * 
  * 
  * CAP3RFORDER [3]
  * Set this bit to determine whether the CRLR3 or CFLR3 is the first captured
  * data transferred to memory through PDMA when CAP3PDMAMOD =11
  * 
  * 1 = CRLR3 is the first captured data to memory.
  * 0 = CFLR3 is the first captured data to memory.
  * 
  */

/* PWM CAPPDMACTL Bit Field Definitions */
#define PWM_CAPPDMACTL_CAP0PDMAEN_Pos                     0
#define PWM_CAPPDMACTL_CAP0PDMAEN_Msk                     (0x01ul << PWM_CAPPDMACTL_CAP0PDMAEN_Pos)
#define PWM_CAPPDMACTL_CAP0PDMAMOD_Pos                    1
#define PWM_CAPPDMACTL_CAP0PDMAMOD_Msk                    (0x03ul << PWM_CAPPDMACTL_CAP0PDMAMOD_Pos)
#define PWM_CAPPDMACTL_CAP0RFORDER_Pos                    3
#define PWM_CAPPDMACTL_CAP0RFORDER_Msk                    (0x01ul << PWM_CAPPDMACTL_CAP0RFORDER_Pos)
// Bits 4-7 are Reserved.
#define PWM_CAPPDMACTL_CAP1PDMAEN_Pos                     8
#define PWM_CAPPDMACTL_CAP1PDMAEN_Msk                     (0x01ul << PWM_CAPPDMACTL_CAP1PDMAEN_Pos)
#define PWM_CAPPDMACTL_CAP1PDMAMOD_Pos                    9
#define PWM_CAPPDMACTL_CAP1PDMAMOD_Msk                    (0x03ul << PWM_CAPPDMACTL_CAP1PDMAMOD_Pos)
#define PWM_CAPPDMACTL_CAP1RFORDER_Pos                    11
#define PWM_CAPPDMACTL_CAP1RFORDER_Msk                    (0x01ul << PWM_CAPPDMACTL_CAP1RFORDER_Pos)
// Bits 12-15 are Reserved.
#define PWM_CAPPDMACTL_CAP2PDMAEN_Pos                     16
#define PWM_CAPPDMACTL_CAP2PDMAEN_Msk                     (0x01ul << PWM_CAPPDMACTL_CAP2PDMAEN_Pos)
#define PWM_CAPPDMACTL_CAP2PDMAMOD_Pos                    17
#define PWM_CAPPDMACTL_CAP2PDMAMOD_Msk                    (0x03ul << PWM_CAPPDMACTL_CAP2PDMAMOD_Pos)
#define PWM_CAPPDMACTL_CAP2RFORDER_Pos                    19
#define PWM_CAPPDMACTL_CAP2RFORDER_Msk                    (0x01ul << PWM_CAPPDMACTL_CAP2RFORDER_Pos)
// Bits 20-23 are Reserved.
#define PWM_CAPPDMACTL_CAP3PDMAEN_Pos                     24
#define PWM_CAPPDMACTL_CAP3PDMAEN_Msk                     (0x01ul << PWM_CAPPDMACTL_CAP3PDMAEN_Pos)
#define PWM_CAPPDMACTL_CAP3PDMAMOD_Pos                    25
#define PWM_CAPPDMACTL_CAP3PDMAMOD_Msk                    (0x03ul << PWM_CAPPDMACTL_CAP3PDMAMOD_Pos)
#define PWM_CAPPDMACTL_CAP3RFORDER_Pos                    27
#define PWM_CAPPDMACTL_CAP3RFORDER_Msk                    (0x01ul << PWM_CAPPDMACTL_CAP3RFORDER_Pos)
// Bits 28-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register CAP0PDMA
  * 
  * @description PWM Group A PDMA Data Register0 (CAP0PDMA) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 278
  * 
  * CAP0PDMA = PWMA_BA+0xC4
  * 
  * 
  * CAP0RFPDMA
  * PDMA data register for channel 0
  * This is the capture value (CFLR0/CRLR0) for channel 0
  * 
  */

#define PWM_CAP0PDMA_CAP0RFPDMA_Pos                       0
#define PWM_CAP0PDMA_CAP0RFPDMA_Msk                       (0xFFFFul << PWM_CAP0PDMA_CAP0RFPDMA_Pos)
// Bits 16-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register CAP1PDMA
  * 
  * @description PWM Group A PDMA Data Register1 (CAP1PDMA) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 279
  * 
  * CAP1PDMA = PWMA_BA+0xC8
  * 
  * 
  * CAP1RFPDMA
  * PDMA data register for channel 1
  * This is the capture value (CFLR1/CRLR1) for channel 1
  * 
  */

#define PWM_CAP1PDMA_CAP1RFPDMA_Pos                       0
#define PWM_CAP1PDMA_CAP1RFPDMA_Msk                       (0xFFFFul << PWM_CAP1PDMA_CAP1RFPDMA_Pos)
// Bits 16-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register CAP2PDMA
  * 
  * @description PWM Group A PDMA Data Register2 (CAP2PDMA) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 280
  * 
  * CAP2PDMA = PWMA_BA+0xCC
  * 
  * 
  * CAP2RFPDMA
  * PDMA data register for channel 2
  * This is the capture value (CFLR2/CRLR2) for channel 2
  * 
  */

#define PWM_CAP2PDMA_CAP2RFPDMA_Pos                       0
#define PWM_CAP2PDMA_CAP2RFPDMA_Msk                       (0xFFFFul << PWM_CAP2PDMA_CAP2RFPDMA_Pos)
// Bits 16-31 are Reserved.


/**
  * @brief PWM Controller (PWM) - Register CAP3PDMA
  * 
  * @description PWM Group A PDMA Data Register3 (CAP3PDMA) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.9.6 Register Description, page 281
  * 
  * CAP3PDMA = PWMA_BA+0xD0
  * 
  * 
  * CAP3RFPDMA
  * PDMA data register for channel 3
  * This is the capture value (CFLR3/CRLR3) for channel 3
  * 
  */

#define PWM_CAP3PDMA_CAP3RFPDMA_Pos                       0
#define PWM_CAP3PDMA_CAP3RFPDMA_Msk                       (0xFFFFul << PWM_CAP3PDMA_CAP3RFPDMA_Pos)
// Bits 16-31 are Reserved.


/* PWM-Timer Start Procedure
The following procedure is recommended for starting a PWM drive:
1. Set clock selector (CSR)
2. Set prescaler (PPR)
3. Set inverter on/off, dead-zone generator on/off, auto-reload/one-shot mode and stop
PWM-timer (PCR)
4. Set comparator register (CMR) for setting PWM duty.
5. Set PWM down-counter register (CNR) for setting PWM period.
6. Set interrupt enable register (PIER)
7. Set the corresponding GPIO pins as PWM function (enable POE and disable CAPENR)
for the corresponding PWM channel.
8. Enable PWM timer start running (set CHxEN = 1 in PCR)
 */



/* =========================================================================================================================== */
/* ================                                    TIMER Controller                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER Controller (TIMER)
  * 
  * @description See NUC123 Technical Reference Manual 5.11.5 Register Map, page 325-326
  * 
  * TMR_BA01 = 0x4001_0000
  * TMR_BA23 = 0x4011_0000
  * 
  * Struct rearranged from table to track actual locations (without having to specify offsets)
  * 
  * TIMER_T Struct is per-TMR pair (TMR01, TMR23).
  * 
  */

