ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
typedef struct {

    __IO uint32_t TCSR;          // TMR_BAxx + 0x00                       Timer Control and Status Register
    __IO uint32_t TCMPR;         // TMR_BAxx + 0x04                       Timer Compare Register
    __IO uint32_t TISR;          // TMR_BAxx + 0x08                       Timer Interrupt Status Register
    __I  uint32_t TDR;           // TMR_BAxx + 0x0C                       Timer Data Register
    __I  uint32_t TCAP;          // TMR_BAxx + 0x10                       Timer Capture Data Register
    __IO uint32_t TEXCON;        // TMR_BAxx + 0x14                       Timer External Control Register
    __IO uint32_t TEXISR;        // TMR_BAxx + 0x18                       Timer External Interrupt Status Register

} TIMER_T;


/**
  * @brief TIMER Controller (TIMER) - Register TCSR
  * 
  * @description TIMER [0/1/2/3] Timer Control and Status Register (TCSR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.11.6 Register Description, page 327-329
  * 
  * TCSR0 = TMR_BA01+0x00
  * TCSR1 = TMR_BA01+0x20
  * TCSR2 = TMR_BA23+0x00
  * TCSR3 = TMR_BA23+0x20
  * 
  * 
  * PRESCALE [0:7]
  * Pre-scale Counter
  * 
  * Clock input is divided by PRESCALE+1 before it is fed to the counter.
  * If PRESCALE = 0, there is no scaling.
  * 
  * 
  * TDR_EN [16]
  * Data Load Enable
  * 
  * When TDR_EN is set, TDR (Timer Data Register) will be updated continuously with the
  * 24-bit up-timer value as the timer is counting.
  * 
  * 1 = Timer Data Register update Enabled.
  * 0 = Timer Data Register update Disabled.
  * 
  * 
  * WAKEN [23]
  * Wake-up Enable
  * 
  * When WAKE_EN is set and the TIF is set, the timer controller will generator a wake-up
  * trigger event to CPU.
  * 
  * 0 = Wake-up trigger event Disabled.
  * 1 = Wake-up trigger event Enabled.
  * 
  * 
  * CTB [24]
  * Counter Mode Enable Bit
  * 
  * This bit is the counter mode enable bit. When Timer is used as an event counter, this
  * bit should be set to 1 and Timer will work as an event counter. The counter detect
  * phase can be selected as rising/falling edge of external pin by TX_PHASE field.
  * 
  * 1 = Counter mode Enabled.
  * 0 = Counter mode Disabled.
  * 
  * 
  * CACT [25]
  * Timer Active Status Bit (Read only)
  * 
  * This bit indicates the up-timer status.
  * 
  * 0 = Timer is not active
  * 1 = Timer is active
  * 
  * 
  * CRST [26]
  * Timer Reset Bit
  * 
  * Set this bit will reset the 24-bit up-timer, 8-bit pre-scale counter and also force CEN
  * to 0.
  * 
  * 0 = No effect
  * 1 = Reset Timer's 8-bit pre-scale counter, internal 24-bit up-timer and CEN bit
  * 
  * 
  * MODE [27:28]
  * Timer Operating Mode
  * 
  * 00 = The timer is operating at the one-shot mode. The associated
  *      interrupt signal is generated once (if IE is enabled) and CEN is
  *      automatically cleared by hardware.
  * 01 = The timer is operating at the periodic mode. The associated
  *      interrupt signal is generated periodically (if IE is enabled).
  * 10 = The timer is operating at the toggle mode. The interrupt signal is
  *      generated periodically (if IE is enabled). And the associated
  *      signal (tout) is changing back and forth with 50% duty cycle.
  * 11 = The timer is operating at continuous counting mode. The
  *      associated interrupt signal is generated when TDR = TCMPR (if
  *      IE is enabled). However, the 24-bit up-timer counts continuously.
  * 
  * 
  * IE [29]
  * Interrupt Enable Bit
  * 
  * 1 = Timer Interrupt Enabled
  * 0 = Timer Interrupt Disabled
  * 
  * If timer interrupt is enabled, the timer asserts its interrupt signal when the associated
  * up-timer value is equal to TCMPR.
  * 
  * 
  * CEN [30]
  * Timer Enable Bit
  * 
  * 1 = Starts counting
  * 0 = Stops/Suspends counting
  * 
  * Note1: If CEN is in stop and then CEN is set to 1, the 24-bit up-timer will keep
  * counting up from the last stop counting value.
  * Note2: This bit is auto-cleared by hardware in one-shot mode (MODE [27:28] = 00)
  * when the associated timer interrupt is generated (IE [29] = 1).
  * 
  * 
  * DBGACK_TMR [31]
  * ICE Debug mode Acknowledge Disable (Write-protection Bit)
  * 
  * 0 = ICE debug mode acknowledgement effects TIMER counting.
  *     TIMER counter will be held while ICE debug mode acknowledged.
  * 1 = ICE debug mode acknowledgement disabled.
  *     TIMER counter will keep going regardless of ICE debug mode acknowledgement.
  * 
  */

#define TIMER_TCSR_PRESCALE_Pos                           0
#define TIMER_TCSR_PRESCALE_Msk                           (0xFFul << TIMER_TCSR_PRESCALE_Pos)
// Bits 8-15 are Reserved.
#define TIMER_TCSR_TDR_EN_Pos                             16
#define TIMER_TCSR_TDR_EN_Msk                             (0x01ul << TIMER_TCSR_TDR_EN_Pos)
// Bits 17-22 are Reserved.
#define TIMER_TCSR_WAKE_EN_Pos                            23
#define TIMER_TCSR_WAKE_EN_Msk                            (0x01ul << TIMER_TCSR_WAKE_EN_Pos)
#define TIMER_TCSR_CTB_Pos                                24
#define TIMER_TCSR_CTB_Msk                                (0x01ul << TIMER_TCSR_CTB_Pos)
#define TIMER_TCSR_CACT_Pos                               25
#define TIMER_TCSR_CACT_Msk                               (0x01ul << TIMER_TCSR_CACT_Pos)
#define TIMER_TCSR_CRST_Pos                               26
#define TIMER_TCSR_CRST_Msk                               (0x01ul << TIMER_TCSR_CRST_Pos)
#define TIMER_TCSR_MODE_Pos                               27
#define TIMER_TCSR_MODE_Msk                               (0x03ul << TIMER_TCSR_MODE_Pos)
#define TIMER_TCSR_IE_Pos                                 29
#define TIMER_TCSR_IE_Msk                                 (0x01ul << TIMER_TCSR_IE_Pos)
#define TIMER_TCSR_CEN_Pos                                30
#define TIMER_TCSR_CEN_Msk                                (0x01ul << TIMER_TCSR_CEN_Pos)
#define TIMER_TCSR_DBGACK_TMR_Pos                         31
#define TIMER_TCSR_DBGACK_TMR_Msk                         (0x01ul << TIMER_TCSR_DBGACK_TMR_Pos)


/**
  * @brief TIMER Controller (TIMER) - Register TCMP
  * 
  * @description TIMER [0/1/2/3] Timer Compare Register (TCMP) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.11.6 Register Description, page 330
  * 
  * TCMPR0 = TMR_BA01+0x04
  * TCMPR1 = TMR_BA01+0x24
  * TCMPR2 = TMR_BA23+0x04
  * TCMPR3 = TMR_BA23+0x24
  * 
  * 
  * TCMP [0:23]
  * Timer Compared Value
  * 
  * TCMP is a 24-bit compared register. When the internal 24-bit up-timer counts and its
  * value is equal to TCMP value, a Timer Interrupt is requested if the timer interrupt is
  * enabled with TCSR.IE[29]=1. The TCMP value defines the timer counting cycle time.
  * Time out period = (Period of timer clock input) * (8-bit PRESCALE + 1) * (24-bit TCMP)
  * 
  * Note1: Never write 0x0 or 0x1 in TCMP, or the core will run into unknown state.
  * Note2: When timer is operating in continuous counting mode, the 24-bit up-timer will
  * count continuously if software writes a new value into TCMP. If timer is operating in
  * other modes, the 24-bit up-timer will restart counting and will use the newest TCMP value
  * to be the compared value if the software has written a new value into TCMP.
  * 
  */

#define TIMER_TCMP_TCMP_Pos                               0
#define TIMER_TCMP_TCMP_Msk                               (0xFFFFFFul << TIMER_TCMP_TCMP_Pos)
// Bits 24-31 are Reserved.


/**
  * @brief TIMER Controller (TIMER) - Register TISR
  * 
  * @description TIMER [0/1/2/3] Timer Interrupt Status Register (TISR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.11.6 Register Description, page 331
  * 
  * TISR0 = TMR_BA01+0x08
  * TISR1 = TMR_BA01+0x28
  * TISR2 = TMR_BA23+0x08
  * TISR3 = TMR_BA23+0x28
  * 
  * 
  * TIF [0]
  * Timer Interrupt Flag
  * 
  * This bit indicates the interrupt status of timer.
  * The TIF bit is set by hardware when the up counting value of internal 24-bit up-timer
  * matches the timer compared value (TCMP). It is cleared by writing 1 to this bit.
  * 
  * 
  * TWF [1]
  * Timer Wakeup Flag
  * 
  * If timer causes CPU wakes up from power-down mode, this bit will be set to high.
  * It must be cleared by software with a write 1 to this bit.
  * 
  * 0 = Timer does not cause CPU wakeup.
  * 1 = CPU wakes up from sleep or power-down mode by timer time-out.
  * 
  * 
  */

#define TIMER_TISR_TIF_Pos                                0
#define TIMER_TISR_TIF_Msk                                (0x01ul << TIMER_TISR_TIF_Pos)
#define TIMER_TISR_TWF_Pos                                1
#define TIMER_TISR_TWF_Msk                                (0x01ul << TIMER_TISR_TWF_Pos)
// Bits 2-31 are Reserved.


/**
  * @brief TIMER Controller (TIMER) - Register TDR
  * 
  * @description TIMER [0/1/2/3] Timer Data Register (TDR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.11.6 Register Description, page 332
  * 
  * TDR0 = TMR_BA01+0x0C
  * TDR1 = TMR_BA01+0x2C
  * TDR2 = TMR_BA23+0x0C
  * TDR3 = TMR_BA23+0x2C
  * 
  * 
  * TDR [0:23]
  * Timer Data Register
  * 
  * 1. CTB (TCSR[24] ) = 0:
  *    TDR is 24- bits up timer value.
  *    User can read TDR for getting current 24- bits up timer value if
  *    TCSR[24] = is set to 0
  * 2. CTB (TCSR[24] ) = 1:
  *    TDR is 24- bits up event counter value.
  *    User can read TDR for getting current 24- bits up event counter value
  *    if TCSR[24] is 1
  * 
  */

