ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define TIMER_TDR_TDR_Pos                                 0
#define TIMER_TDR_TDR_Msk                                 (0xFFFFFFul << TIMER_TDR_TDR_Pos)
// Bits 24-31 are Reserved.


/**
  * @brief TIMER Controller (TIMER) - Register TCAP
  * 
  * @description TIMER [0/1/2/3] Timer Capture Data Register (TCAP) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.11.6 Register Description, page 333
  * 
  * TCAP0 = TMR_BA01+0x10
  * TCAP1 = TMR_BA01+0x30
  * TCAP2 = TMR_BA23+0x10
  * TCAP3 = TMR_BA23+0x30
  * 
  * 
  * TCAP [0:23]
  * Timer Capture Data Register
  * 
  * When TEXEN (TEXCON[3]) is set, RSTCAPn(TTXCON[4]) is 0, and the transition
  * on the TEX pins associated TEX_EDGE(TEXCON[2:1]) setting has occurred -
  * the internal 24-bit up-timer value will be loaded into TCAP.
  * 
  * User can read this register for the counter value.
  * 
  */

#define TIMER_TCAP_TCAP_Pos                               0
#define TIMER_TCAP_TCAP_Msk                               (0xFFFFFFul << TIMER_TCAP_TCAP_Pos)
// Bits 24-31 are Reserved.


/**
  * @brief TIMER Controller (TIMER) - Register TEXCON
  * 
  * @description TIMER [0/1/2/3] Timer External Control Register (TEXCON) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.11.6 Register Description, page 334-335
  * 
  * TEXCON0 = TMR_BA01+0x14
  * TEXCON1 = TMR_BA01+0x34
  * TEXCON2 = TMR_BA23+0x14
  * TEXCON3 = TMR_BA23+0x34
  * 
  * 
  * TX_PHASE [0]
  * Timer External Count Phase
  * 
  * This bit indicates the external count pin phase.
  * 
  * 1 = A rising edge of external count pin will be counted.
  * 0 = A falling edge of external count pin will be counted.
  * 
  * 
  * TEX_EDGE [1:2]
  * Timer External Pin Edge Detect
  * 
  * 00 = 1 to 0 transition on TEX will be detected.
  * 01 = 0 to 1 transition on TEX will be detected.
  * 10 = Either 1 to 0 or 0 to 1 transition on TEX will be detected.
  * 11 = Reserved.
  * 
  * 
  * TEXEN [3]
  * Timer External Pin Enable
  * 
  * This bit enables the reset/capture function on the TEX pin.
  * 
  * 1 = Transition detected on the TEX pin will result in capture or reset of timer counter.
  * 0 = TEX pin will be ignored.
  * 
  * 
  * RSTCAPn [4]
  * Timer External Reset Counter/Capture Mode Selection
  * 
  * 1 = TEX transition is used as the timer counter reset function.
  * 0 = TEX transition is used as the timer capture function.
  * 
  * 
  * TEXIEN [5]
  * Timer External Interrupt Enable Bit
  * 
  * 1 = Timer external interrupt Enabled.
  * 0 = Timer external interrupt Disabled.
  * 
  * If timer external interrupt is enabled, the timer asserts its external interrupt signal
  * which issent to NVIC to inform CPU when the transition on the TEX pins associated with
  * TEX_EDGE(TEXCON[2:1]) setting has happened.
  * 
  * For example, while TEXIEN = 1, TEXEN = 1, and TEX_EDGE = 00, a 1 to 0 transition
  * on the TEX pin will cause the TEXIF(TEXISR[0]) interrupt flag to be set, then the
  * interrupt signal is generated and sent to NVIC to inform MCU.
  * 
  * 
  * TEXDB [6]
  * Timer External Capture Pin De-bounce Enable Bit
  * 
  * 1 = De-bounce Enabled.
  * 0 = De-bounce Disabled.
  * 
  * If this bit is enabled, the edge of T0EX~T3EX pin is detected with de-bounce circuit.
  * 
  * 
  * TCDB [7]
  * Timer Counter Pin De-bounce Enable Bit
  * 
  * 1 = De-bounce Enabled.
  * 0 = De-bounce Disabled.
  * 
  * If this bit is enabled, the edge of TM0~TM3 pin is detected with de-bounce circuit.
  * 
  */

#define TIMER_TEXCON_TX_PHASE_Pos                         0
#define TIMER_TEXCON_TX_PHASE_Msk                         (0x01ul << TIMER_TEXCON_TX_PHASE_Pos)
#define TIMER_TEXCON_TEX_EDGE_Pos                         1
#define TIMER_TEXCON_TEX_EDGE_Msk                         (0x03ul << TIMER_TEXCON_TEX_EDGE_Pos)
#define TIMER_TEXCON_TEXEN_Pos                            3
#define TIMER_TEXCON_TEXEN_Msk                            (0x01ul << TIMER_TEXCON_TEXEN_Pos)
#define TIMER_TEXCON_RSTCAPSEL_Pos                        4
#define TIMER_TEXCON_RSTCAPSEL_Msk                        (0x01ul << TIMER_TEXCON_RSTCAPSEL_Pos)
#define TIMER_TEXCON_TEXIEN_Pos                           5
#define TIMER_TEXCON_TEXIEN_Msk                           (0x01ul << TIMER_TEXCON_TEXIEN_Pos)
#define TIMER_TEXCON_TEXDB_Pos                            6
#define TIMER_TEXCON_TEXDB_Msk                            (0x01ul << TIMER_TEXCON_TEXDB_Pos)
#define TIMER_TEXCON_TCDB_Pos                             7
#define TIMER_TEXCON_TCDB_Msk                             (0x01ul << TIMER_TEXCON_TCDB_Pos)
// Bits 8-31 are Reserved.


/**
  * @brief TIMER Controller (TIMER) - Register TEXISR
  * 
  * @description TIMER [0/1/2/3] Timer External Interrupt Status Register (TEXISR) bit defines
  * 
  * See NUC123 Technical Reference Manual 5.11.6 Register Description, page 336
  * 
  * TEXISR0 = TMR_BA01+0x18
  * TEXISR1 = TMR_BA01+0x38
  * TEXISR2 = TMR_BA23+0x18
  * TEXISR3 = TMR_BA23+0x38
  * 
  * 
  * TEXIF [0]
  * Timer External Interrupt Flag
  * 
  * This bit indicates the external interrupt status of Timer.
  * This bit is set by hardware when TEXEN (TEXCON[3]) is to 1, and the transition on
  * the TEX pins associated with TEX_EDGE (TEXCON[2:1]) setting has occurred.
  * 
  * It is cleared by writing 1 to this bit.
  * 
  * For example, while TEXEN = 1, and TEX_EDGE = 00, a 1 to 0 transition on the TEX
  * pin causes the TEXIF bit to be set.
  * 
  */

#define TIMER_TEXISR_TEXIF_Pos                            0
#define TIMER_TEXISR_TEXIF_Msk                            (0x01ul << TIMER_TEXISR_TEXIF_Pos)
// Bits 1-31 are Reserved.


/*@}*/ /* end of group NUC123SD4AN0_Peripherals */

/* =========================================  End of section using anonymous unions  ========================================= */
#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/* ToDo: add here your device peripherals base addresses
         following is an example for timer */
/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  * 
  * See NUC123 Technical Reference Manual 5.1.2 System Memory Map, pages 29-30
  * 
  */

/* Peripheral and SRAM base address */
// #define <DeviceAbbreviation>_FLASH_BASE       (0x00000000UL)                              /*!< (FLASH     ) Base Address */
// #define <DeviceAbbreviation>_SRAM_BASE        (0x20000000UL)                              /*!< (SRAM      ) Base Address */
// #define <DeviceAbbreviation>_PERIPH_BASE      (0x40000000UL)                              /*!< (Peripheral) Base Address */
#define FLASH_BASE          (0x00000000ul)
#define SRAM_BASE           (0x20000000ul)
#define AHB_BASE            (0x50000000ul)
#define APB1_BASE           (0x40000000ul)
#define APB2_BASE           (0x40100000ul)

/* Peripheral memory map */
// #define <DeviceAbbreviation>TIM0_BASE         (<DeviceAbbreviation>_PERIPH_BASE)          /*!< (Timer0    ) Base Address */
// #define <DeviceAbbreviation>TIM1_BASE         (<DeviceAbbreviation>_PERIPH_BASE + 0x0800) /*!< (Timer1    ) Base Address */
// #define <DeviceAbbreviation>TIM2_BASE         (<DeviceAbbreviation>_PERIPH_BASE + 0x1000) /*!< (Timer2    ) Base Address */
#define GCR_BASE             (AHB_BASE+0x00000)                           // System Global Controller Base Address
#define CLK_BASE             (AHB_BASE+0x00200)                           // System Clock Controller Base Address
#define INT_BASE             (AHB_BASE+0x00300)                           // Interrupt Source Controller Base Address

