ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123SD4AN0.h
#define GPIO_BASE            (AHB_BASE+0x4000)                            // GPIO Base Address
#define PA_BASE              (GPIO_BASE+0x0000)                           // GPIO PORTA Base Address
#define PB_BASE              (GPIO_BASE+0x0040)                           // GPIO PORTB Base Address
#define PC_BASE              (GPIO_BASE+0x0080)                           // GPIO PORTC Base Address
#define PD_BASE              (GPIO_BASE+0x00C0)                           // GPIO PORTD Base Address
#define PF_BASE              (GPIO_BASE+0x0140)                           // GPIO PORTF Base Address
#define DBNCECON_BASE        (GPIO_BASE+0x0180)                           // GPIO De-bounce Cycle Control Base Address
#define GPIO_PIN_DATA_BASE   (GPIO_BASE+0x0200)                           // GPIO Pin Data Input/Output Control Base Address

// #define WDT_BASE             (APB1_BASE+0x4000)                           // Watchdog Timer Base Address
// #define WWDT_BASE            (APB1_BASE+0x4100)                           // Window Watchdog Timer Base Address

#define TIMER0_BASE          (APB1_BASE+0x10000)                          // Timer0 Base Address
#define TIMER1_BASE          (APB1_BASE+0x10020)                          // Timer1 Base Address
#define TIMER2_BASE          (APB2_BASE+0x10000)                          // Timer2 Base Address
#define TIMER3_BASE          (APB2_BASE+0x10020)                          // Timer3 Base Address

#define SPI0_BASE            (APB1_BASE+0x30000)                          // SPI0 Base Address
#define SPI1_BASE            (APB1_BASE+0x34000)                          // SPI1 Base Address
#define SPI2_BASE            (APB2_BASE+0x30000)                          // SPI2 Base Address

#define PWMA_BASE            (APB1_BASE+0x40000)                          // PWMA Base Address                                */

// #define UART0_BASE           (APB1_BASE+0x50000)                          // UART0 Base Address
// #define UART1_BASE           (APB2_BASE+0x50000)                          // UART1 Base Address

#define USBD_BASE            (APB1_BASE+0x60000)                          // USBD Base Address

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/* ToDo: add here your device peripherals pointer definitions
         following is an example for timer */
/** @addtogroup Device_Peripheral_declaration
  * @{
  */

// #define <DeviceAbbreviation>_TIM0        ((<DeviceAbbreviation>_TMR_TypeDef *) <DeviceAbbreviation>TIM0_BASE)
// #define <DeviceAbbreviation>_TIM1        ((<DeviceAbbreviation>_TMR_TypeDef *) <DeviceAbbreviation>TIM0_BASE)
// #define <DeviceAbbreviation>_TIM2        ((<DeviceAbbreviation>_TMR_TypeDef *) <DeviceAbbreviation>TIM0_BASE)


#define SYS                  ((GCR_T *) GCR_BASE)
#define CLK                  ((CLK_T *) CLK_BASE)
#define SYSINT               ((GCR_INT_T *) INT_BASE)

#define PA                   ((GPIO_T *) PA_BASE)
#define PB                   ((GPIO_T *) PB_BASE)
#define PC                   ((GPIO_T *) PC_BASE)
#define PD                   ((GPIO_T *) PD_BASE)
#define PF                   ((GPIO_T *) PF_BASE)
#define GPIO_DBNCE           ((GPIO_DBNCECON_T *) DBNCECON_BASE)

// #define WDT                  ((WDT_T *) WDT_BASE)
// #define WWDT                 ((WWDT_T *) WWDT_BASE)

#define TIMER0               ((TIMER_T *) TIMER0_BASE)
#define TIMER1               ((TIMER_T *) TIMER1_BASE)
#define TIMER2               ((TIMER_T *) TIMER2_BASE)
#define TIMER3               ((TIMER_T *) TIMER3_BASE)

#define PWMA                 ((PWM_T *) PWMA_BASE)

#define SPI0                 ((SPI_T *) SPI0_BASE)
#define SPI1                 ((SPI_T *) SPI1_BASE)
#define SPI2                 ((SPI_T *) SPI2_BASE)

// #define UART0                ((UART_T *) UART0_BASE)
// #define UART1                ((UART_T *) UART1_BASE)

#define USBD                 ((USBD_T *) USBD_BASE)

/*
  * |Module index        |Clock source                          |Divider                 |
  * | :----------------  | :------------------------------------| :--------------------- |
  * |\ref WDT_MODULE     |\ref CLK_CLKSEL1_WDT_S_LIRC           | x                      |
  * |\ref WDT_MODULE     |\ref CLK_CLKSEL1_WDT_S_HCLK_DIV2048   | x                      |
  * |\ref ADC_MODULE     |\ref CLK_CLKSEL1_ADC_S_HXT            |\ref CLK_CLKDIV_ADC(x)  |
  * |\ref ADC_MODULE     |\ref CLK_CLKSEL1_ADC_S_PLL            |\ref CLK_CLKDIV_ADC(x)  |
  * |\ref ADC_MODULE     |\ref CLK_CLKSEL1_ADC_S_HCLK           |\ref CLK_CLKDIV_ADC(x)  |
  * |\ref ADC_MODULE     |\ref CLK_CLKSEL1_ADC_S_HIRC           |\ref CLK_CLKDIV_ADC(x)  |
  * |\ref SPI0_MODULE    |\ref CLK_CLKSEL1_SPI0_S_HCLK          | x                      |
  * |\ref SPI0_MODULE    |\ref CLK_CLKSEL1_SPI0_S_PLL           | x                      |
  * |\ref SPI1_MODULE    |\ref CLK_CLKSEL1_SPI1_S_HCLK          | x                      |
  * |\ref SPI1_MODULE    |\ref CLK_CLKSEL1_SPI1_S_PLL           | x                      |
  * |\ref SPI2_MODULE    |\ref CLK_CLKSEL1_SPI2_S_HCLK          | x                      |
  * |\ref SPI2_MODULE    |\ref CLK_CLKSEL1_SPI2_S_PLL           | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_HXT           | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_HCLK          | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_EXT_TRG       | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_LIRC          | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_HIRC          | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_HXT           | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_HCLK          | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_EXT_TRG       | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_LIRC          | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_HIRC          | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_HXT           | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_HCLK          | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_EXT_TRG       | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_LIRC          | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_HIRC          | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_HXT           | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_HCLK          | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_EXT_TRG       | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_LIRC          | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_HIRC          | x                      |
  * |\ref UART0_MODULE   |\ref CLK_CLKSEL1_UART_S_HXT           |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART0_MODULE   |\ref CLK_CLKSEL1_UART_S_PLL           |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART0_MODULE   |\ref CLK_CLKSEL1_UART_S_HIRC          |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART1_MODULE   |\ref CLK_CLKSEL1_UART_S_HXT           |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART1_MODULE   |\ref CLK_CLKSEL1_UART_S_PLL           |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART1_MODULE   |\ref CLK_CLKSEL1_UART_S_HIRC          |\ref CLK_CLKDIV_UART(x) |
  * |\ref PWM01_MODULE   |\ref CLK_CLKSEL12_PWM01_S_HXT         | x                      |
  * |\ref PWM01_MODULE   |\ref CLK_CLKSEL12_PWM01_S_HCLK        | x                      |
  * |\ref PWM01_MODULE   |\ref CLK_CLKSEL12_PWM01_S_HIRC        | x                      |
  * |\ref PWM01_MODULE   |\ref CLK_CLKSEL12_PWM01_S_LIRC        | x                      |
  * |\ref PWM23_MODULE   |\ref CLK_CLKSEL12_PWM23_S_HXT         | x                      |
  * |\ref PWM23_MODULE   |\ref CLK_CLKSEL12_PWM23_S_HCLK        | x                      |
  * |\ref PWM23_MODULE   |\ref CLK_CLKSEL12_PWM23_S_HIRC        | x                      |
  * |\ref PWM23_MODULE   |\ref CLK_CLKSEL12_PWM23_S_LIRC        | x                      |
  * |\ref I2S_MODULE     |\ref CLK_CLKSEL2_I2S_S_HXT            | x                      |
  * |\ref I2S_MODULE     |\ref CLK_CLKSEL2_I2S_S_PLL            | x                      |
  * |\ref I2S_MODULE     |\ref CLK_CLKSEL2_I2S_S_HCLK           | x                      |
  * |\ref I2S_MODULE     |\ref CLK_CLKSEL2_I2S_S_HIRC           | x                      |
  * |\ref FDIV_MODULE    |\ref CLK_CLKSEL2_FRQDIV_S_HXT         | x                      |
  * |\ref FDIV_MODULE    |\ref CLK_CLKSEL2_FRQDIV_S_HCLK        | x                      |
  * |\ref FDIV_MODULE    |\ref CLK_CLKSEL2_FRQDIV_S_HIRC        | x                      |
  * |\ref WWDT_MODULE    |\ref CLK_CLKSEL2_WWDT_S_HCLK_DIV2048  | x                      |
  * |\ref WWDT_MODULE    |\ref CLK_CLKSEL2_WWDT_S_LIRC          | x                      |
  * |\ref USBD_MODULE    | x                                    |\ref CLK_CLKDIV_USB(x)  |
*/
typedef enum ModuleNum {

  WDT_ModuleNum = 0,
  ADC_ModuleNum = 1,
  SPI0_ModuleNum,
  SPI1_ModuleNum,
  SPI2_ModuleNum,
  TMR0_ModuleNum,
  TMR1_ModuleNum,
  TMR2_ModuleNum,
  TMR3_ModuleNum,
  UART0_ModuleNum,
  UART1_ModuleNum,
  PWM01_ModuleNum,
  PWM23_ModuleNum,
  I2S_ModuleNum,
  FDIV_ModuleNum,
  WWDT_ModuleNum,
  USBD_ModuleNum,
  I2C0_ModuleNum,
  I2C1_ModuleNum,
  PS2_ModuleNum,
  PDMA_ModuleNum,
  ISP_ModuleNum

} ModuleNum_Type;


/* =========================================================================================================================== */
/* ================                             Peripheral Register Operations                                ================ */
/* =========================================================================================================================== */

#ifndef NULL
#define NULL        0
#endif

#define UNLOCKREG()        do{*((__IO uint32_t *)(GCR_BASE + 0x100)) = 0x59;*((__IO uint32_t *)(GCR_BASE + 0x100)) = 0x16;*((__IO uint32_t *)(GCR_BASE + 0x100)) = 0x88;}while(*((__IO uint32_t *)(GCR_BASE + 0x100))==0)
#define LOCKREG()          *((__IO uint32_t *)(GCR_BASE + 0x100)) = 0x00

#define REGCOPY(dest, src)  *((uint32_t *)&(dest)) = *((uint32_t *)&(src))
#define CLEAR(dest)         *((uint32_t *)&(dest)) = 0

#define MEM32(addr) (*((volatile unsigned long *) (addr)))


/* =========================================================================================================================== */
/* ================                                  Peripheral includes                                      ================ */
/* =========================================================================================================================== */



/** @} */ /* End of group NUC123SD4AN0 */

/** @} */ /* End of group NUVOTON */

#ifdef __cplusplus
}
#endif



#endif  /* NUC123SD4AN0_H */